espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*
** ###################################################################
**     Processor:           MIMXRT595SFFOA_dsp
**     Compiler:            XCC Compiler
**     Reference manual:    RT500 Reference Manual. Rev.0,07/2019
**     Version:             rev. 2.0, 2019-07-22
**     Build:               b190805
**
**     Abstract:
**         CMSIS Peripheral Access Layer for MIMXRT595S_dsp
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2019 NXP
**     All rights reserved.
**
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2019-04-19)
**         Initial version.
**     - rev. 2.0 (2019-07-22)
**         Base on rev 0.5 RM.
**
** ###################################################################
*/

/*!
 * @file MIMXRT595S_dsp.h
 * @version 2.0
 * @date 2019-07-22
 * @brief CMSIS Peripheral Access Layer for MIMXRT595S_dsp
 *
 * CMSIS Peripheral Access Layer for MIMXRT595S_dsp
 */

#ifndef _MIMXRT595S_DSP_H_
#define _MIMXRT595S_DSP_H_                       /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0200U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 46                 /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -5,               /**< SysIRQ, Non Maskable Interrupt */
  Software_IRQn                = -4,               /**< Software triggered Interrupt */
  RtosTimer0_IRQn              = -3,               /**< Internal RTOS Timer0 Interrupt */
  RtosTimer1_IRQn              = -2,               /**< Internal RTOS Timer1 Interrupt */
  Profiling_IRQn               = -1,               /**< Profiling Interrupt */

  /* Device specific interrupts */
  FLEXCOMM0_IRQn               = 0,                /**< Flexcomm Interface 0 (USART, SPI, I2C, I2S) */
  FLEXCOMM1_IRQn               = 1,                /**< Flexcomm Interface 1 (USART, SPI, I2C, I2S) */
  FLEXCOMM2_IRQn               = 2,                /**< Flexcomm Interface 2 (USART, SPI, I2C, I2S) */
  FLEXCOMM3_IRQn               = 3,                /**< Flexcomm Interface 3 (USART, SPI, I2C, I2S) */
  FLEXCOMM4_IRQn               = 4,                /**< Flexcomm Interface 4 (USART, SPI, I2C, I2S) */
  FLEXCOMM5_IRQn               = 5,                /**< Flexcomm Interface 5 (USART, SPI, I2C, I2S) */
  FLEXCOMM6_IRQn               = 6,                /**< Flexcomm Interface 6 (USART, SPI, I2C, I3S) */
  FLEXCOMM7_IRQn               = 7,                /**< Flexcomm Interface 7 (USART, SPI, I2C, I4S) */
  FLEXCOMM14_IRQn              = 8,                /**< Flexcomm Interface 14 (USART, SPI, I2C, I5S) */
  FLEXCOMM16_IRQn              = 9,                /**< Flexcomm Interface 16 (USART, SPI, I2C, I6S) */
  PIN_INT0_IRQn                = 10,               /**< Pin interrupt 0 or pattern match engine slice 0 int */
  PIN_INT1_IRQn                = 11,               /**< Pin interrupt 1 or pattern match engine slice 1 int */
  PIN_INT2_IRQn                = 12,               /**< Pin interrupt 2 or pattern match engine slice 2 int */
  PIN_INT3_IRQn                = 13,               /**< Pin interrupt 3 or pattern match engine slice 3 int */
  PIN_INT4_IRQn                = 14,               /**< Pin interrupt 4 or pattern match engine slice 4 int */
  PIN_INT5_IRQn                = 15,               /**< Pin interrupt 5 or pattern match engine slice 5 int */
  PIN_INT6_IRQn                = 16,               /**< Pin interrupt 6 or pattern match engine slice 6 int */
  PIN_INT7_IRQn                = 17,               /**< Pin interrupt 7 or pattern match engine slice 7 int */
  GPIO_INTA_IRQn               = 18,               /**< GPIO interrupt A */
  GPIO_INTB_IRQn               = 19,               /**< GPIO interrupt B */
  WDT1_IRQn                    = 20,               /**< Windowed watchdog timer 1 */
  DMA0_IRQn                    = 21,               /**< DMA controller 0 (secure or CM33 DMA) */
  DMA1_IRQn                    = 22,               /**< DMA controller 1 (non-secure or DSP DMA) */
  MU_B_IRQn                    = 23,               /**< Messaging Unit interrupt */
  UTICK0_IRQn                  = 24,               /**< Micro-tick Timer */
  MRT0_IRQn                    = 25,               /**< Multi-Rate Timer */
  OS_EVENT_IRQn                = 26,               /**< OS event timer */
  CTIMER0_IRQn                 = 27,               /**< Standard counter/timer CTIMER0 */
  CTIMER1_IRQn                 = 28,               /**< Standard counter/timer CTIMER1 */
  CTIMER2_IRQn                 = 29,               /**< Standard counter/timer CTIMER2 */
  CTIMER3_IRQn                 = 30,               /**< Standard counter/timer CTIMER3 */
  CTIMER4_IRQn                 = 31,               /**< Standard counter/timer CTIMER4 */
  RTC_IRQn                     = 32,               /**< RTC alarm and wake-up */
  I3C0_IRQn                    = 33,               /**< I3C interface 0 */
  I3C1_IRQn                    = 34,               /**< I3C interface 1 */
  DMIC0_IRQn                   = 35,               /**< Digital microphone and DMIC subsystem */
  HWVAD_IRQn                   = 36,               /**< Hardware Voice Activity Detector */
  LCDIF_IRQn                   = 37,               /**< Liquid Crystal Display Interface interrupt */
  GPU_IRQn                     = 38,               /**< Graphics Processor Unit interrupt */
  SMARTDMA_IRQn                = 39,               /**< Smart DMA Controller interrupt */
  FLEXIO_IRQn                  = 40                /**< Flexible IO interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */

