espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name OPACRB - Off-Platform Peripheral Access Control Register */
/*! @{ */
#define AIPS_OPACRB_TP7_MASK                     (0x1U)
#define AIPS_OPACRB_TP7_SHIFT                    (0U)
/*! TP7 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRB_TP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_TP7_SHIFT)) & AIPS_OPACRB_TP7_MASK)
#define AIPS_OPACRB_WP7_MASK                     (0x2U)
#define AIPS_OPACRB_WP7_SHIFT                    (1U)
/*! WP7 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRB_WP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_WP7_SHIFT)) & AIPS_OPACRB_WP7_MASK)
#define AIPS_OPACRB_SP7_MASK                     (0x4U)
#define AIPS_OPACRB_SP7_SHIFT                    (2U)
/*! SP7 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRB_SP7(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_SP7_SHIFT)) & AIPS_OPACRB_SP7_MASK)
#define AIPS_OPACRB_TP4_MASK                     (0x1000U)
#define AIPS_OPACRB_TP4_SHIFT                    (12U)
/*! TP4 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRB_TP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_TP4_SHIFT)) & AIPS_OPACRB_TP4_MASK)
#define AIPS_OPACRB_WP4_MASK                     (0x2000U)
#define AIPS_OPACRB_WP4_SHIFT                    (13U)
/*! WP4 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRB_WP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_WP4_SHIFT)) & AIPS_OPACRB_WP4_MASK)
#define AIPS_OPACRB_SP4_MASK                     (0x4000U)
#define AIPS_OPACRB_SP4_SHIFT                    (14U)
/*! SP4 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRB_SP4(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_SP4_SHIFT)) & AIPS_OPACRB_SP4_MASK)
#define AIPS_OPACRB_TP3_MASK                     (0x10000U)
#define AIPS_OPACRB_TP3_SHIFT                    (16U)
/*! TP3 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRB_TP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_TP3_SHIFT)) & AIPS_OPACRB_TP3_MASK)
#define AIPS_OPACRB_WP3_MASK                     (0x20000U)
#define AIPS_OPACRB_WP3_SHIFT                    (17U)
/*! WP3 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRB_WP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_WP3_SHIFT)) & AIPS_OPACRB_WP3_MASK)
#define AIPS_OPACRB_SP3_MASK                     (0x40000U)
#define AIPS_OPACRB_SP3_SHIFT                    (18U)
/*! SP3 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRB_SP3(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_SP3_SHIFT)) & AIPS_OPACRB_SP3_MASK)
#define AIPS_OPACRB_TP2_MASK                     (0x100000U)
#define AIPS_OPACRB_TP2_SHIFT                    (20U)
/*! TP2 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRB_TP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_TP2_SHIFT)) & AIPS_OPACRB_TP2_MASK)
#define AIPS_OPACRB_WP2_MASK                     (0x200000U)
#define AIPS_OPACRB_WP2_SHIFT                    (21U)
/*! WP2 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRB_WP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_WP2_SHIFT)) & AIPS_OPACRB_WP2_MASK)
#define AIPS_OPACRB_SP2_MASK                     (0x400000U)
#define AIPS_OPACRB_SP2_SHIFT                    (22U)
/*! SP2 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRB_SP2(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_SP2_SHIFT)) & AIPS_OPACRB_SP2_MASK)
#define AIPS_OPACRB_TP1_MASK                     (0x1000000U)
#define AIPS_OPACRB_TP1_SHIFT                    (24U)
/*! TP1 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRB_TP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_TP1_SHIFT)) & AIPS_OPACRB_TP1_MASK)
#define AIPS_OPACRB_WP1_MASK                     (0x2000000U)
#define AIPS_OPACRB_WP1_SHIFT                    (25U)
/*! WP1 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRB_WP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_WP1_SHIFT)) & AIPS_OPACRB_WP1_MASK)
#define AIPS_OPACRB_SP1_MASK                     (0x4000000U)
#define AIPS_OPACRB_SP1_SHIFT                    (26U)
/*! SP1 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRB_SP1(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_SP1_SHIFT)) & AIPS_OPACRB_SP1_MASK)
#define AIPS_OPACRB_TP0_MASK                     (0x10000000U)
#define AIPS_OPACRB_TP0_SHIFT                    (28U)
/*! TP0 - Trusted Protect
 *  0b0..Accesses from an untrusted master are allowed.
 *  0b1..Accesses from an untrusted master are not allowed.
 */
#define AIPS_OPACRB_TP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_TP0_SHIFT)) & AIPS_OPACRB_TP0_MASK)
#define AIPS_OPACRB_WP0_MASK                     (0x20000000U)
#define AIPS_OPACRB_WP0_SHIFT                    (29U)
/*! WP0 - Write Protect
 *  0b0..This peripheral allows write accesses.
 *  0b1..This peripheral is write protected.
 */
#define AIPS_OPACRB_WP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_WP0_SHIFT)) & AIPS_OPACRB_WP0_MASK)
#define AIPS_OPACRB_SP0_MASK                     (0x40000000U)
#define AIPS_OPACRB_SP0_SHIFT                    (30U)
/*! SP0 - Supervisor Protect
 *  0b0..This peripheral does not require supervisor privilege level for accesses.
 *  0b1..This peripheral requires supervisor privilege level for accesses.
 */
#define AIPS_OPACRB_SP0(x)                       (((uint32_t)(((uint32_t)(x)) << AIPS_OPACRB_SP0_SHIFT)) & AIPS_OPACRB_SP0_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group AIPS_Register_Masks */


/* AIPS - Peripheral instance base addresses */
/** Peripheral AIPS0 base address */
#define AIPS0_BASE                               (0x40110000u)
/** Peripheral AIPS0 base pointer */
#define AIPS0                                    ((AIPS_Type *)AIPS0_BASE)
/** Peripheral AIPS1 base address */
#define AIPS1_BASE                               (0x40130000u)
/** Peripheral AIPS1 base pointer */
#define AIPS1                                    ((AIPS_Type *)AIPS1_BASE)
/** Array initializer of AIPS peripheral base addresses */
#define AIPS_BASE_ADDRS                          { AIPS0_BASE, AIPS1_BASE }
/** Array initializer of AIPS peripheral base pointers */
#define AIPS_BASE_PTRS                           { AIPS0, AIPS1 }

/*!
 * @}
 */ /* end of group AIPS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- AXI_SWITCH Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AXI_SWITCH_Peripheral_Access_Layer AXI_SWITCH Peripheral Access Layer
 * @{
 */

/** AXI_SWITCH - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[8];
  __IO uint32_t FN_MOD_BM_ISS;                     /**< Bus Matrix Issuing Functionality Modification., offset: 0x8 */
       uint8_t RESERVED_1[24];
  __IO uint32_t FN_MOD2;                           /**< Bypass Merge, offset: 0x24 */
       uint8_t RESERVED_2[216];
  __IO uint32_t READ_QOS;                          /**< Read channel QoS value, offset: 0x100 */
  __IO uint32_t WRITE_QOS;                         /**< WRITE channel QoS value, offset: 0x104 */
  __IO uint32_t FN_MOD;                            /**< Issuing Functionality Modification, offset: 0x108 */
} AXI_SWITCH_Type;

/* ----------------------------------------------------------------------------
   -- AXI_SWITCH Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup AXI_SWITCH_Register_Masks AXI_SWITCH Register Masks
 * @{
 */

/*! @name FN_MOD_BM_ISS - Bus Matrix Issuing Functionality Modification. */
/*! @{ */
#define AXI_SWITCH_FN_MOD_BM_ISS_FN_MOD_BM_ISS_MASK (0x3U)
#define AXI_SWITCH_FN_MOD_BM_ISS_FN_MOD_BM_ISS_SHIFT (0U)
/*! FN_MOD_BM_ISS - Read channel QoS value
 */
#define AXI_SWITCH_FN_MOD_BM_ISS_FN_MOD_BM_ISS(x) (((uint32_t)(((uint32_t)(x)) << AXI_SWITCH_FN_MOD_BM_ISS_FN_MOD_BM_ISS_SHIFT)) & AXI_SWITCH_FN_MOD_BM_ISS_FN_MOD_BM_ISS_MASK)
/*! @} */

/*! @name FN_MOD2 - Bypass Merge */
/*! @{ */
#define AXI_SWITCH_FN_MOD2_FN_MOD2_MASK          (0x1U)
#define AXI_SWITCH_FN_MOD2_FN_MOD2_SHIFT         (0U)
/*! FN_MOD2 - Bypass Merge
 */
#define AXI_SWITCH_FN_MOD2_FN_MOD2(x)            (((uint32_t)(((uint32_t)(x)) << AXI_SWITCH_FN_MOD2_FN_MOD2_SHIFT)) & AXI_SWITCH_FN_MOD2_FN_MOD2_MASK)
/*! @} */

/*! @name READ_QOS - Read channel QoS value */
/*! @{ */
#define AXI_SWITCH_READ_QOS_READ_QOS_MASK        (0xFU)
#define AXI_SWITCH_READ_QOS_READ_QOS_SHIFT       (0U)
/*! READ_QOS - Read channel QoS value
 */
#define AXI_SWITCH_READ_QOS_READ_QOS(x)          (((uint32_t)(((uint32_t)(x)) << AXI_SWITCH_READ_QOS_READ_QOS_SHIFT)) & AXI_SWITCH_READ_QOS_READ_QOS_MASK)
/*! @} */

