espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name INTENSET - Interrupt Enable Set */
/*! @{ */
#define CASPER_INTENSET_DONE_MASK                (0x1U)
#define CASPER_INTENSET_DONE_SHIFT               (0U)
/*! DONE - Done
 *  0b0..Do not interrupt when done
 *  0b1..Interrupt when done
 */
#define CASPER_INTENSET_DONE(x)                  (((uint32_t)(((uint32_t)(x)) << CASPER_INTENSET_DONE_SHIFT)) & CASPER_INTENSET_DONE_MASK)
/*! @} */

/*! @name INTENCLR - Interrupt Enable Clear */
/*! @{ */
#define CASPER_INTENCLR_DONE_MASK                (0x1U)
#define CASPER_INTENCLR_DONE_SHIFT               (0U)
/*! DONE - Done
 *  0b0..If written 0, ignored
 *  0b1..If written 1, do not interrupt when done.
 */
#define CASPER_INTENCLR_DONE(x)                  (((uint32_t)(((uint32_t)(x)) << CASPER_INTENCLR_DONE_SHIFT)) & CASPER_INTENCLR_DONE_MASK)
/*! @} */

/*! @name INTSTAT - Interrupt status */
/*! @{ */
#define CASPER_INTSTAT_DONE_MASK                 (0x1U)
#define CASPER_INTSTAT_DONE_SHIFT                (0U)
/*! DONE
 *  0b0..Not caused by accelerator being done
 *  0b1..Caused by accelerator being done
 */
#define CASPER_INTSTAT_DONE(x)                   (((uint32_t)(((uint32_t)(x)) << CASPER_INTSTAT_DONE_SHIFT)) & CASPER_INTSTAT_DONE_MASK)
/*! @} */

/*! @name AREG - A Register */
/*! @{ */
#define CASPER_AREG_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_AREG_REG_VALUE_SHIFT              (0U)
/*! REG_VALUE - Register Value
 */
#define CASPER_AREG_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_AREG_REG_VALUE_SHIFT)) & CASPER_AREG_REG_VALUE_MASK)
/*! @} */

/*! @name BREG - B Register */
/*! @{ */
#define CASPER_BREG_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_BREG_REG_VALUE_SHIFT              (0U)
/*! REG_VALUE - Register Value
 */
#define CASPER_BREG_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_BREG_REG_VALUE_SHIFT)) & CASPER_BREG_REG_VALUE_MASK)
/*! @} */

/*! @name CREG - C Register */
/*! @{ */
#define CASPER_CREG_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_CREG_REG_VALUE_SHIFT              (0U)
/*! REG_VALUE - Register Value
 */
#define CASPER_CREG_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_CREG_REG_VALUE_SHIFT)) & CASPER_CREG_REG_VALUE_MASK)
/*! @} */

/*! @name DREG - D Register */
/*! @{ */
#define CASPER_DREG_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_DREG_REG_VALUE_SHIFT              (0U)
/*! REG_VALUE - Register Value
 */
#define CASPER_DREG_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_DREG_REG_VALUE_SHIFT)) & CASPER_DREG_REG_VALUE_MASK)
/*! @} */

/*! @name RES0 - Result Register 0 */
/*! @{ */
#define CASPER_RES0_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_RES0_REG_VALUE_SHIFT              (0U)
/*! REG_VALUE - Register Value
 */
#define CASPER_RES0_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_RES0_REG_VALUE_SHIFT)) & CASPER_RES0_REG_VALUE_MASK)
/*! @} */

/*! @name RES1 - Result Register 1 */
/*! @{ */
#define CASPER_RES1_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_RES1_REG_VALUE_SHIFT              (0U)
#define CASPER_RES1_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_RES1_REG_VALUE_SHIFT)) & CASPER_RES1_REG_VALUE_MASK)
/*! @} */

/*! @name RES2 - Result Register 2 */
/*! @{ */
#define CASPER_RES2_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_RES2_REG_VALUE_SHIFT              (0U)
/*! REG_VALUE - Register Value
 */
#define CASPER_RES2_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_RES2_REG_VALUE_SHIFT)) & CASPER_RES2_REG_VALUE_MASK)
/*! @} */

/*! @name RES3 - Result Register 3 */
/*! @{ */
#define CASPER_RES3_REG_VALUE_MASK               (0xFFFFFFFFU)
#define CASPER_RES3_REG_VALUE_SHIFT              (0U)
#define CASPER_RES3_REG_VALUE(x)                 (((uint32_t)(((uint32_t)(x)) << CASPER_RES3_REG_VALUE_SHIFT)) & CASPER_RES3_REG_VALUE_MASK)
/*! @} */

/*! @name MASK - Mask */
/*! @{ */
#define CASPER_MASK_MASK_MASK                    (0xFFFFFFFFU)
#define CASPER_MASK_MASK_SHIFT                   (0U)
/*! MASK - Mask
 */
#define CASPER_MASK_MASK(x)                      (((uint32_t)(((uint32_t)(x)) << CASPER_MASK_MASK_SHIFT)) & CASPER_MASK_MASK_MASK)
/*! @} */

/*! @name REMASK - Remask */
/*! @{ */
#define CASPER_REMASK_MASK_MASK                  (0xFFFFFFFFU)
#define CASPER_REMASK_MASK_SHIFT                 (0U)
/*! MASK - Mask
 */
#define CASPER_REMASK_MASK(x)                    (((uint32_t)(((uint32_t)(x)) << CASPER_REMASK_MASK_SHIFT)) & CASPER_REMASK_MASK_MASK)
/*! @} */

/*! @name LOCK - Lock */
/*! @{ */
#define CASPER_LOCK_LOCK_MASK                    (0x1U)
#define CASPER_LOCK_LOCK_SHIFT                   (0U)
/*! LOCK - Lock
 *  0b0..Unlock
 *  0b1..Lock to current security level
 */
#define CASPER_LOCK_LOCK(x)                      (((uint32_t)(((uint32_t)(x)) << CASPER_LOCK_LOCK_SHIFT)) & CASPER_LOCK_LOCK_MASK)
#define CASPER_LOCK_KEY_MASK                     (0x1FFF0U)
#define CASPER_LOCK_KEY_SHIFT                    (4U)
/*! KEY - Key
 *  0b0011100111101..Key Value
 */
#define CASPER_LOCK_KEY(x)                       (((uint32_t)(((uint32_t)(x)) << CASPER_LOCK_KEY_SHIFT)) & CASPER_LOCK_KEY_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group CASPER_Register_Masks */


/* CASPER - Peripheral instance base addresses */
/** Peripheral CASPER base address */
#define CASPER_BASE                              (0x40201000u)
/** Peripheral CASPER base pointer */
#define CASPER                                   ((CASPER_Type *)CASPER_BASE)
/** Array initializer of CASPER peripheral base addresses */
#define CASPER_BASE_ADDRS                        { CASPER_BASE }
/** Array initializer of CASPER peripheral base pointers */
#define CASPER_BASE_PTRS                         { CASPER }

/*!
 * @}
 */ /* end of group CASPER_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CLKCTL0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL0_Peripheral_Access_Layer CLKCTL0 Peripheral Access Layer
 * @{
 */

/** CLKCTL0 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PSCCTL0;                           /**< PSC Control 0, offset: 0x10 */
  __IO uint32_t PSCCTL1;                           /**< PSC Control 1, offset: 0x14 */
  __IO uint32_t PSCCTL2;                           /**< PSC Control 2, offset: 0x18 */
       uint8_t RESERVED_1[36];
  __O  uint32_t PSCCTL0_SET;                       /**< PSC Control 0 Set, offset: 0x40 */
  __O  uint32_t PSCCTL1_SET;                       /**< PSC Control 1 Set, offset: 0x44 */
  __O  uint32_t PSCCTL2_SET;                       /**< PSC Control 2 Set, offset: 0x48 */
       uint8_t RESERVED_2[36];
  __O  uint32_t PSCCTL0_CLR;                       /**< PSC Control 0 Clear, offset: 0x70 */
  __O  uint32_t PSCCTL1_CLR;                       /**< PSC Control 1 Clear, offset: 0x74 */
  __O  uint32_t PSCCTL2_CLR;                       /**< PSC Control 2 Clear, offset: 0x78 */
       uint8_t RESERVED_3[4];
  __IO uint32_t FRO_CONTROL;                       /**< FRO Control, offset: 0x80 */
  __I  uint32_t FRO_CAPVAL;                        /**< Captured Value, offset: 0x84 */
       uint8_t RESERVED_4[4];
  __IO uint32_t FRO_RDTRIM;                        /**< FRO Trim, offset: 0x8C */
       uint8_t RESERVED_5[120];
  __IO uint32_t FRODIVSEL;                         /**< FRO Clock Divider, offset: 0x108 */
  __I  uint32_t FROCLKSTATUS;                      /**< FRO Clock Status, offset: 0x10C */
  __IO uint32_t FRODIVOEN;                         /**< FRO Enable Register, offset: 0x110 */
       uint8_t RESERVED_6[28];
  __IO uint32_t LOWFREQCLKDIV;                     /**< Low Frequency Clock Divider, offset: 0x130 */
       uint8_t RESERVED_7[44];
  __IO uint32_t SYSOSCCTL0;                        /**< System Oscillator Control 0, offset: 0x160 */
       uint8_t RESERVED_8[4];
  __IO uint32_t SYSOSC_BYPASS;                     /**< System Oscillator Bypass, offset: 0x168 */
       uint8_t RESERVED_9[36];
  __IO uint32_t LPOSCCTL0;                         /**< Low Power Oscillator Control 0, offset: 0x190 */
       uint8_t RESERVED_10[44];
  __IO uint32_t A32KHZOSCCTL0;                     /**< 32 KHz Oscillator Control 0, offset: 0x1C0 */
       uint8_t RESERVED_11[60];
  __IO uint32_t SYSPLL0CLKSEL;                     /**< System PLL 0 Clock Select, offset: 0x200 */
  __IO uint32_t SYSPLL0CTL0;                       /**< System PLL0 Control 0, offset: 0x204 */
       uint8_t RESERVED_12[4];
  __IO uint32_t SYSPLL0LOCKTIMEDIV2;               /**< System PLL0 Lock Time Div2, offset: 0x20C */
  __IO uint32_t SYSPLL0NUM;                        /**< System PLL0 Numerator, offset: 0x210 */
  __IO uint32_t SYSPLL0DENOM;                      /**< System PLL0 Denominator, offset: 0x214 */
  __IO uint32_t SYSPLL0PFD;                        /**< System PLL0 PFD, offset: 0x218 */
       uint8_t RESERVED_13[484];
  __IO uint32_t SYSCPUAHBCLKDIV;                   /**< System CPU AHB Clock Divider, offset: 0x400 */
       uint8_t RESERVED_14[44];
  __IO uint32_t MAINCLKSELA;                       /**< Main Clock Select A, offset: 0x430 */
  __IO uint32_t MAINCLKSELB;                       /**< Main Clock Select B, offset: 0x434 */
       uint8_t RESERVED_15[200];
  __IO uint32_t PFCDIV[2];                         /**< PFC0DIV, array offset: 0x500, array step: 0x4 */
       uint8_t RESERVED_16[280];
  __IO uint32_t FLEXSPI0FCLKSEL;                   /**< FlexSPI0 Functional Clock Select, offset: 0x620 */
  __IO uint32_t FLEXSPI0FCLKDIV;                   /**< FlexSPI0 Functional Clock Divider, offset: 0x624 */
       uint8_t RESERVED_17[8];
  __IO uint32_t FLEXSPI1FCLKSEL;                   /**< FlexSPI1 Functional Clock Select, offset: 0x630 */
  __IO uint32_t FLEXSPI1FCLKDIV;                   /**< FlexSPI1 Functional Clock Divider, offset: 0x634 */
       uint8_t RESERVED_18[8];
  __IO uint32_t SCTFCLKSEL;                        /**< SCT Functional Clock Select, offset: 0x640 */
  __IO uint32_t SCTIN7CLKDIV;                      /**< SCT Functional Clock Divider, offset: 0x644 */
       uint8_t RESERVED_19[24];
  __IO uint32_t USBHSFCLKSEL;                      /**< USB HS Functional Clock Select, offset: 0x660 */
  __IO uint32_t USBHSFCLKDIV;                      /**< USB HS Functional Clock Divider, offset: 0x664 */
       uint8_t RESERVED_20[24];
  __IO uint32_t SDIO0FCLKSEL;                      /**< SDIO0 Functional Clock Select, offset: 0x680 */
  __IO uint32_t SDIO0FCLKDIV;                      /**< SDIO0 Functional Clock Divider, offset: 0x684 */
       uint8_t RESERVED_21[8];
  __IO uint32_t SDIO1FCLKSEL;                      /**< SDIO1 Functional Clock Select, offset: 0x690 */
  __IO uint32_t SDIO1FCLKDIV;                      /**< SDIO1 Functional Clock Divider, offset: 0x694 */
       uint8_t RESERVED_22[56];
  __IO uint32_t ADC0FCLKSEL0;                      /**< ADC0 Functional Clock Select 0, offset: 0x6D0 */
  __IO uint32_t ADC0FCLKSEL1;                      /**< ADC0 Functional Clock Select 1, offset: 0x6D4 */
  __IO uint32_t ADC0FCLKDIV;                       /**< ADC0 Functional Clock Divider, offset: 0x6D8 */
       uint8_t RESERVED_23[36];
  __IO uint32_t UTICKFCLKSEL;                      /**< UTICK Functional Clock Select, offset: 0x700 */
       uint8_t RESERVED_24[28];
  __IO uint32_t WDT0FCLKSEL;                       /**< WDT0 Functional Clock Select, offset: 0x720 */
       uint8_t RESERVED_25[12];
  __IO uint32_t A32KHZWAKECLKSEL;                  /**< 32 KHz Wake Clock Source Select, offset: 0x730 */
  __IO uint32_t A32KHZWAKECLKDIV;                  /**< 32 KHz Wake Clock Divider, offset: 0x734 */
       uint8_t RESERVED_26[40];
  __IO uint32_t SYSTICKFCLKSEL;                    /**< SYSTICK Functional Clock Select, offset: 0x760 */
  __IO uint32_t SYSTICKFCLKDIV;                    /**< SYSTICK Functional Clock Divider, offset: 0x764 */
       uint8_t RESERVED_27[8];
  __IO uint32_t DPHYCLKSEL;                        /**< MIPI-DSI PHY Clock Select, offset: 0x770 */
  __IO uint32_t DPHYCLKDIV;                        /**< MIPI-DSI PHY Clock Divider, offset: 0x774 */
  __IO uint32_t DPHYESCCLKSEL;                     /**< DPHYESC Clock Select, offset: 0x778 */
  __IO uint32_t DPHYESCRXCLKDIV;                   /**< DPHYESC RX Clock Divider, offset: 0x77C */
  __IO uint32_t DPHYESCTXCLKDIV;                   /**< DPHYESC TX Clock Divider, offset: 0x780 */
       uint8_t RESERVED_28[12];
  __IO uint32_t GPUCLKSEL;                         /**< GPU Clock Select, offset: 0x790 */
  __IO uint32_t GPUCLKDIV;                         /**< GPU Clock Divider, offset: 0x794 */
       uint8_t RESERVED_29[8];
  __IO uint32_t DCPIXELCLKSEL;                     /**< LCDIF Pixel Clock Select, offset: 0x7A0 */
  __IO uint32_t DCPIXELCLKDIV;                     /**< LCDIF Pixel Clock Divider, offset: 0x7A4 */
} CLKCTL0_Type;

/* ----------------------------------------------------------------------------
   -- CLKCTL0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL0_Register_Masks CLKCTL0 Register Masks
 * @{
 */

/*! @name PSCCTL0 - PSC Control 0 */
/*! @{ */
#define CLKCTL0_PSCCTL0_DSP_MASK                 (0x2U)
#define CLKCTL0_PSCCTL0_DSP_SHIFT                (1U)
/*! DSP - DSP
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_DSP(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_DSP_SHIFT)) & CLKCTL0_PSCCTL0_DSP_MASK)
#define CLKCTL0_PSCCTL0_ROM_CTRLR_MASK           (0x4U)
#define CLKCTL0_PSCCTL0_ROM_CTRLR_SHIFT          (2U)
/*! ROM_CTRLR - 128KB ROM Controller
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_ROM_CTRLR(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_ROM_CTRLR_SHIFT)) & CLKCTL0_PSCCTL0_ROM_CTRLR_MASK)
#define CLKCTL0_PSCCTL0_AXI_SWITCH_MASK          (0x8U)
#define CLKCTL0_PSCCTL0_AXI_SWITCH_SHIFT         (3U)
/*! AXI_SWITCH - AXI Switch
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_AXI_SWITCH(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_AXI_SWITCH_SHIFT)) & CLKCTL0_PSCCTL0_AXI_SWITCH_MASK)
#define CLKCTL0_PSCCTL0_AXI_CTLR_MASK            (0x10U)
#define CLKCTL0_PSCCTL0_AXI_CTLR_SHIFT           (4U)
/*! AXI_CTLR - AXI Controller
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_AXI_CTLR(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_AXI_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_AXI_CTLR_MASK)
#define CLKCTL0_PSCCTL0_POWERQUAD_MASK           (0x100U)
#define CLKCTL0_PSCCTL0_POWERQUAD_SHIFT          (8U)
/*! POWERQUAD - POWERQUAD
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_POWERQUAD(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_POWERQUAD_SHIFT)) & CLKCTL0_PSCCTL0_POWERQUAD_MASK)
#define CLKCTL0_PSCCTL0_CASPER_MASK              (0x200U)
#define CLKCTL0_PSCCTL0_CASPER_SHIFT             (9U)
/*! CASPER - CASPER
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_CASPER(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_CASPER_SHIFT)) & CLKCTL0_PSCCTL0_CASPER_MASK)
#define CLKCTL0_PSCCTL0_HASHCRYPT_MASK           (0x400U)
#define CLKCTL0_PSCCTL0_HASHCRYPT_SHIFT          (10U)
/*! HASHCRYPT - HASHCRYPT
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_HASHCRYPT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_HASHCRYPT_SHIFT)) & CLKCTL0_PSCCTL0_HASHCRYPT_MASK)
#define CLKCTL0_PSCCTL0_PUF_MASK                 (0x800U)
#define CLKCTL0_PSCCTL0_PUF_SHIFT                (11U)
/*! PUF - PUF
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_PUF(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_PUF_SHIFT)) & CLKCTL0_PSCCTL0_PUF_MASK)
#define CLKCTL0_PSCCTL0_RNG_MASK                 (0x1000U)
#define CLKCTL0_PSCCTL0_RNG_SHIFT                (12U)
/*! RNG - Random Number Generator (RNG)
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_RNG(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_RNG_SHIFT)) & CLKCTL0_PSCCTL0_RNG_MASK)
#define CLKCTL0_PSCCTL0_FLEXSPI0_OTFAD_MASK      (0x10000U)
#define CLKCTL0_PSCCTL0_FLEXSPI0_OTFAD_SHIFT     (16U)
/*! FLEXSPI0_OTFAD - FLEXSPI0 / OTFAD
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_FLEXSPI0_OTFAD(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_FLEXSPI0_OTFAD_SHIFT)) & CLKCTL0_PSCCTL0_FLEXSPI0_OTFAD_MASK)
#define CLKCTL0_PSCCTL0_OTP_CTLR_MASK            (0x20000U)
#define CLKCTL0_PSCCTL0_OTP_CTLR_SHIFT           (17U)
/*! OTP_CTLR - OTP Controller
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_OTP_CTLR(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_OTP_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_OTP_CTLR_MASK)
#define CLKCTL0_PSCCTL0_FLEXSPI1_MASK            (0x40000U)
#define CLKCTL0_PSCCTL0_FLEXSPI1_SHIFT           (18U)
/*! FLEXSPI1 - FLEXSPI1
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_FLEXSPI1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_FLEXSPI1_SHIFT)) & CLKCTL0_PSCCTL0_FLEXSPI1_MASK)
#define CLKCTL0_PSCCTL0_USBHS_PHY_MASK           (0x100000U)
#define CLKCTL0_PSCCTL0_USBHS_PHY_SHIFT          (20U)
/*! USBHS_PHY - USB HS PHY
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_USBHS_PHY(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_USBHS_PHY_SHIFT)) & CLKCTL0_PSCCTL0_USBHS_PHY_MASK)
#define CLKCTL0_PSCCTL0_USBHS_DEVICE_MASK        (0x200000U)
#define CLKCTL0_PSCCTL0_USBHS_DEVICE_SHIFT       (21U)
/*! USBHS_DEVICE - USB HS Device
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_USBHS_DEVICE(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_USBHS_DEVICE_SHIFT)) & CLKCTL0_PSCCTL0_USBHS_DEVICE_MASK)
#define CLKCTL0_PSCCTL0_USBHS_HOST_MASK          (0x400000U)
#define CLKCTL0_PSCCTL0_USBHS_HOST_SHIFT         (22U)
/*! USBHS_HOST - USB HS Host
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_USBHS_HOST(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_USBHS_HOST_SHIFT)) & CLKCTL0_PSCCTL0_USBHS_HOST_MASK)
#define CLKCTL0_PSCCTL0_USBHS_SRAM_MASK          (0x800000U)
#define CLKCTL0_PSCCTL0_USBHS_SRAM_SHIFT         (23U)
/*! USBHS_SRAM - USB HS SRAM
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_USBHS_SRAM(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_USBHS_SRAM_SHIFT)) & CLKCTL0_PSCCTL0_USBHS_SRAM_MASK)
#define CLKCTL0_PSCCTL0_SCT_MASK                 (0x1000000U)
#define CLKCTL0_PSCCTL0_SCT_SHIFT                (24U)
/*! SCT - SCT
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_SCT(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SCT_SHIFT)) & CLKCTL0_PSCCTL0_SCT_MASK)
#define CLKCTL0_PSCCTL0_GPU_MASK                 (0x4000000U)
#define CLKCTL0_PSCCTL0_GPU_SHIFT                (26U)
/*! GPU - GPU
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_GPU(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_GPU_SHIFT)) & CLKCTL0_PSCCTL0_GPU_MASK)
#define CLKCTL0_PSCCTL0_DISPLAY_CTLR_MASK        (0x8000000U)
#define CLKCTL0_PSCCTL0_DISPLAY_CTLR_SHIFT       (27U)
/*! DISPLAY_CTLR - Display Controller
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_DISPLAY_CTLR(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_DISPLAY_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_DISPLAY_CTLR_MASK)
#define CLKCTL0_PSCCTL0_MIPI_DSI_CTLR_MASK       (0x10000000U)
#define CLKCTL0_PSCCTL0_MIPI_DSI_CTLR_SHIFT      (28U)
/*! MIPI_DSI_CTLR - MIPI-DSI Controller
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_MIPI_DSI_CTLR(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_MIPI_DSI_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_MIPI_DSI_CTLR_MASK)
#define CLKCTL0_PSCCTL0_SMARTDMA_MASK            (0x40000000U)
#define CLKCTL0_PSCCTL0_SMARTDMA_SHIFT           (30U)
/*! SMARTDMA - Smart DMA
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL0_SMARTDMA(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SMARTDMA_SHIFT)) & CLKCTL0_PSCCTL0_SMARTDMA_MASK)
/*! @} */

/*! @name PSCCTL1 - PSC Control 1 */
/*! @{ */
#define CLKCTL0_PSCCTL1_SDIO0_MASK               (0x4U)
#define CLKCTL0_PSCCTL1_SDIO0_SHIFT              (2U)
/*! SDIO0 - SDIO0
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL1_SDIO0(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SDIO0_SHIFT)) & CLKCTL0_PSCCTL1_SDIO0_MASK)
#define CLKCTL0_PSCCTL1_SDIO1_MASK               (0x8U)
#define CLKCTL0_PSCCTL1_SDIO1_SHIFT              (3U)
/*! SDIO1 - SDIO1
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL1_SDIO1(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SDIO1_SHIFT)) & CLKCTL0_PSCCTL1_SDIO1_MASK)
#define CLKCTL0_PSCCTL1_ACMP0_MASK               (0x8000U)
#define CLKCTL0_PSCCTL1_ACMP0_SHIFT              (15U)
/*! ACMP0 - ACMP0
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL1_ACMP0(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_ACMP0_SHIFT)) & CLKCTL0_PSCCTL1_ACMP0_MASK)
#define CLKCTL0_PSCCTL1_ADC0_MASK                (0x10000U)
#define CLKCTL0_PSCCTL1_ADC0_SHIFT               (16U)
/*! ADC0 - ADC0
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL1_ADC0(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_ADC0_SHIFT)) & CLKCTL0_PSCCTL1_ADC0_MASK)
#define CLKCTL0_PSCCTL1_SHSGPIO0_MASK            (0x1000000U)
#define CLKCTL0_PSCCTL1_SHSGPIO0_SHIFT           (24U)
/*! SHSGPIO0 - SHSGPIO0
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL1_SHSGPIO0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SHSGPIO0_SHIFT)) & CLKCTL0_PSCCTL1_SHSGPIO0_MASK)
/*! @} */

/*! @name PSCCTL2 - PSC Control 2 */
/*! @{ */
#define CLKCTL0_PSCCTL2_UTICK0_MASK              (0x1U)
#define CLKCTL0_PSCCTL2_UTICK0_SHIFT             (0U)
/*! UTICK0 - Micro-Tick Timer 0
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL2_UTICK0(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_UTICK0_SHIFT)) & CLKCTL0_PSCCTL2_UTICK0_MASK)
#define CLKCTL0_PSCCTL2_WWDT0_MASK               (0x2U)
#define CLKCTL0_PSCCTL2_WWDT0_SHIFT              (1U)
/*! WWDT0 - Watchdog Timer 0
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL2_WWDT0(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_WWDT0_SHIFT)) & CLKCTL0_PSCCTL2_WWDT0_MASK)
#define CLKCTL0_PSCCTL2_PMC_MASK                 (0x20000000U)
#define CLKCTL0_PSCCTL2_PMC_SHIFT                (29U)
/*! PMC - Power Management Controller
 *  0b0..Disable clock
 *  0b1..Enable clock
 */
#define CLKCTL0_PSCCTL2_PMC(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_PMC_SHIFT)) & CLKCTL0_PSCCTL2_PMC_MASK)
/*! @} */

