espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name PSCCTL0_SET - PSC Control 0 Set */
/*! @{ */
#define CLKCTL0_PSCCTL0_SET_DSP_MASK             (0x2U)
#define CLKCTL0_PSCCTL0_SET_DSP_SHIFT            (1U)
/*! DSP - DSP
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_DSP(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_DSP_SHIFT)) & CLKCTL0_PSCCTL0_SET_DSP_MASK)
#define CLKCTL0_PSCCTL0_SET_ROM_CTRLR_MASK       (0x4U)
#define CLKCTL0_PSCCTL0_SET_ROM_CTRLR_SHIFT      (2U)
/*! ROM_CTRLR - 128KB ROM Controller
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_ROM_CTRLR(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_ROM_CTRLR_SHIFT)) & CLKCTL0_PSCCTL0_SET_ROM_CTRLR_MASK)
#define CLKCTL0_PSCCTL0_SET_AXI_SWITCH_MASK      (0x8U)
#define CLKCTL0_PSCCTL0_SET_AXI_SWITCH_SHIFT     (3U)
/*! AXI_SWITCH - AXI Switch
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_AXI_SWITCH(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_AXI_SWITCH_SHIFT)) & CLKCTL0_PSCCTL0_SET_AXI_SWITCH_MASK)
#define CLKCTL0_PSCCTL0_SET_AXI_CTLR_MASK        (0x10U)
#define CLKCTL0_PSCCTL0_SET_AXI_CTLR_SHIFT       (4U)
/*! AXI_CTLR - AXI Controller
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_AXI_CTLR(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_AXI_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_SET_AXI_CTLR_MASK)
#define CLKCTL0_PSCCTL0_SET_POWERQUAD_MASK       (0x100U)
#define CLKCTL0_PSCCTL0_SET_POWERQUAD_SHIFT      (8U)
/*! POWERQUAD - POWERQUAD
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_POWERQUAD(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_POWERQUAD_SHIFT)) & CLKCTL0_PSCCTL0_SET_POWERQUAD_MASK)
#define CLKCTL0_PSCCTL0_SET_CASPER_MASK          (0x200U)
#define CLKCTL0_PSCCTL0_SET_CASPER_SHIFT         (9U)
/*! CASPER - CASPER
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_CASPER(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_CASPER_SHIFT)) & CLKCTL0_PSCCTL0_SET_CASPER_MASK)
#define CLKCTL0_PSCCTL0_SET_HASHCRYPT_MASK       (0x400U)
#define CLKCTL0_PSCCTL0_SET_HASHCRYPT_SHIFT      (10U)
/*! HASHCRYPT - HASHCRYPT
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_HASHCRYPT(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_HASHCRYPT_SHIFT)) & CLKCTL0_PSCCTL0_SET_HASHCRYPT_MASK)
#define CLKCTL0_PSCCTL0_SET_PUF_MASK             (0x800U)
#define CLKCTL0_PSCCTL0_SET_PUF_SHIFT            (11U)
/*! PUF - PUF
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_PUF(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_PUF_SHIFT)) & CLKCTL0_PSCCTL0_SET_PUF_MASK)
#define CLKCTL0_PSCCTL0_SET_RNG_MASK             (0x1000U)
#define CLKCTL0_PSCCTL0_SET_RNG_SHIFT            (12U)
/*! RNG - Random Number Generator (RNG)
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_RNG(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_RNG_SHIFT)) & CLKCTL0_PSCCTL0_SET_RNG_MASK)
#define CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_MASK  (0x10000U)
#define CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_SHIFT (16U)
/*! FLEXSPI0_OTFAD - FLEXSPI0 / OTFAD
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_SHIFT)) & CLKCTL0_PSCCTL0_SET_FLEXSPI0_OTFAD_MASK)
#define CLKCTL0_PSCCTL0_SET_OTP_CTLR_MASK        (0x20000U)
#define CLKCTL0_PSCCTL0_SET_OTP_CTLR_SHIFT       (17U)
/*! OTP_CTLR - OTP Controller
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_OTP_CTLR(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_OTP_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_SET_OTP_CTLR_MASK)
#define CLKCTL0_PSCCTL0_SET_FLEXSPI1_MASK        (0x40000U)
#define CLKCTL0_PSCCTL0_SET_FLEXSPI1_SHIFT       (18U)
/*! FLEXSPI1 - FLEXSPI1
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_FLEXSPI1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_FLEXSPI1_SHIFT)) & CLKCTL0_PSCCTL0_SET_FLEXSPI1_MASK)
#define CLKCTL0_PSCCTL0_SET_USBHS_PHY_MASK       (0x100000U)
#define CLKCTL0_PSCCTL0_SET_USBHS_PHY_SHIFT      (20U)
/*! USBHS_PHY - USB HS PHY
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_USBHS_PHY(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_USBHS_PHY_SHIFT)) & CLKCTL0_PSCCTL0_SET_USBHS_PHY_MASK)
#define CLKCTL0_PSCCTL0_SET_USBHS_DEVICE_MASK    (0x200000U)
#define CLKCTL0_PSCCTL0_SET_USBHS_DEVICE_SHIFT   (21U)
/*! USBHS_DEVICE - USB HS Device
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_USBHS_DEVICE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_USBHS_DEVICE_SHIFT)) & CLKCTL0_PSCCTL0_SET_USBHS_DEVICE_MASK)
#define CLKCTL0_PSCCTL0_SET_USBHS_HOST_MASK      (0x400000U)
#define CLKCTL0_PSCCTL0_SET_USBHS_HOST_SHIFT     (22U)
/*! USBHS_HOST - USB HS Host
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_USBHS_HOST(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_USBHS_HOST_SHIFT)) & CLKCTL0_PSCCTL0_SET_USBHS_HOST_MASK)
#define CLKCTL0_PSCCTL0_SET_USBHS_SRAM_MASK      (0x800000U)
#define CLKCTL0_PSCCTL0_SET_USBHS_SRAM_SHIFT     (23U)
/*! USBHS_SRAM - USB HS SRAM
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_USBHS_SRAM(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_USBHS_SRAM_SHIFT)) & CLKCTL0_PSCCTL0_SET_USBHS_SRAM_MASK)
#define CLKCTL0_PSCCTL0_SET_SCT_MASK             (0x1000000U)
#define CLKCTL0_PSCCTL0_SET_SCT_SHIFT            (24U)
/*! SCT - SCT
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_SCT(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_SCT_SHIFT)) & CLKCTL0_PSCCTL0_SET_SCT_MASK)
#define CLKCTL0_PSCCTL0_SET_GPU_MASK             (0x4000000U)
#define CLKCTL0_PSCCTL0_SET_GPU_SHIFT            (26U)
/*! GPU - GPU
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_GPU(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_GPU_SHIFT)) & CLKCTL0_PSCCTL0_SET_GPU_MASK)
#define CLKCTL0_PSCCTL0_SET_DISPLAY_CTLR_MASK    (0x8000000U)
#define CLKCTL0_PSCCTL0_SET_DISPLAY_CTLR_SHIFT   (27U)
/*! DISPLAY_CTLR - Display Controller
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_DISPLAY_CTLR(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_DISPLAY_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_SET_DISPLAY_CTLR_MASK)
#define CLKCTL0_PSCCTL0_SET_MIPI_DSI_CTLR_MASK   (0x10000000U)
#define CLKCTL0_PSCCTL0_SET_MIPI_DSI_CTLR_SHIFT  (28U)
/*! MIPI_DSI_CTLR - MIPI-DSI Controller
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_MIPI_DSI_CTLR(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_MIPI_DSI_CTLR_SHIFT)) & CLKCTL0_PSCCTL0_SET_MIPI_DSI_CTLR_MASK)
#define CLKCTL0_PSCCTL0_SET_SMARTDMA_MASK        (0x40000000U)
#define CLKCTL0_PSCCTL0_SET_SMARTDMA_SHIFT       (30U)
/*! SMARTDMA - Smart DMA
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL0 register
 */
#define CLKCTL0_PSCCTL0_SET_SMARTDMA(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL0_SET_SMARTDMA_SHIFT)) & CLKCTL0_PSCCTL0_SET_SMARTDMA_MASK)
/*! @} */

/*! @name PSCCTL1_SET - PSC Control 1 Set */
/*! @{ */
#define CLKCTL0_PSCCTL1_SET_SDIO0_MASK           (0x4U)
#define CLKCTL0_PSCCTL1_SET_SDIO0_SHIFT          (2U)
/*! SDIO0 - SDIO0
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL1 register
 */
#define CLKCTL0_PSCCTL1_SET_SDIO0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_SDIO0_SHIFT)) & CLKCTL0_PSCCTL1_SET_SDIO0_MASK)
#define CLKCTL0_PSCCTL1_SET_SDIO1_MASK           (0x8U)
#define CLKCTL0_PSCCTL1_SET_SDIO1_SHIFT          (3U)
/*! SDIO1 - SDIO1
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL1 register
 */
#define CLKCTL0_PSCCTL1_SET_SDIO1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_SDIO1_SHIFT)) & CLKCTL0_PSCCTL1_SET_SDIO1_MASK)
#define CLKCTL0_PSCCTL1_SET_ACMP0_MASK           (0x8000U)
#define CLKCTL0_PSCCTL1_SET_ACMP0_SHIFT          (15U)
/*! ACMP0 - ACMP0
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL1 register
 */
#define CLKCTL0_PSCCTL1_SET_ACMP0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_ACMP0_SHIFT)) & CLKCTL0_PSCCTL1_SET_ACMP0_MASK)
#define CLKCTL0_PSCCTL1_SET_ADC0_MASK            (0x10000U)
#define CLKCTL0_PSCCTL1_SET_ADC0_SHIFT           (16U)
/*! ADC0 - ADC0
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL1 register
 */
#define CLKCTL0_PSCCTL1_SET_ADC0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_ADC0_SHIFT)) & CLKCTL0_PSCCTL1_SET_ADC0_MASK)
#define CLKCTL0_PSCCTL1_SET_SHSGPIO0_MASK        (0x1000000U)
#define CLKCTL0_PSCCTL1_SET_SHSGPIO0_SHIFT       (24U)
/*! SHSGPIO0 - SHSGPIO0
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL1 register
 */
#define CLKCTL0_PSCCTL1_SET_SHSGPIO0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL1_SET_SHSGPIO0_SHIFT)) & CLKCTL0_PSCCTL1_SET_SHSGPIO0_MASK)
/*! @} */

/*! @name PSCCTL2_SET - PSC Control 2 Set */
/*! @{ */
#define CLKCTL0_PSCCTL2_SET_UTICK0_MASK          (0x1U)
#define CLKCTL0_PSCCTL2_SET_UTICK0_SHIFT         (0U)
/*! UTICK0 - Micro-Tick Timer 0
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL2 register
 */
#define CLKCTL0_PSCCTL2_SET_UTICK0(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_UTICK0_SHIFT)) & CLKCTL0_PSCCTL2_SET_UTICK0_MASK)
#define CLKCTL0_PSCCTL2_SET_WWDT0_MASK           (0x2U)
#define CLKCTL0_PSCCTL2_SET_WWDT0_SHIFT          (1U)
/*! WWDT0 - Watchdog Timer 0
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL2 register
 */
#define CLKCTL0_PSCCTL2_SET_WWDT0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_WWDT0_SHIFT)) & CLKCTL0_PSCCTL2_SET_WWDT0_MASK)
#define CLKCTL0_PSCCTL2_SET_PMC_MASK             (0x20000000U)
#define CLKCTL0_PSCCTL2_SET_PMC_SHIFT            (29U)
/*! PMC - Power Management Controller
 *  0b0..No effect
 *  0b1..Sets the corresponding bit in PSCCTL2 register
 */
#define CLKCTL0_PSCCTL2_SET_PMC(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL0_PSCCTL2_SET_PMC_SHIFT)) & CLKCTL0_PSCCTL2_SET_PMC_MASK)
/*! @} */

