espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name PSCCTL0_SET - Clock Set 0 */
/*! @{ */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM0_FC0_MASK   (0x100U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM0_FC0_SHIFT  (8U)
/*! FLEXCOMM0_FC0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM0_FC0(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM0_FC0_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM0_FC0_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM1_FC1_MASK   (0x200U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM1_FC1_SHIFT  (9U)
/*! FLEXCOMM1_FC1
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM1_FC1(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM1_FC1_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM1_FC1_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM2_FC2_MASK   (0x400U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM2_FC2_SHIFT  (10U)
/*! FLEXCOMM2_FC2
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM2_FC2(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM2_FC2_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM2_FC2_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM3_FC3_MASK   (0x800U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM3_FC3_SHIFT  (11U)
/*! FLEXCOMM3_FC3
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM3_FC3(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM3_FC3_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM3_FC3_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM4_FC4_MASK   (0x1000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM4_FC4_SHIFT  (12U)
/*! FLEXCOMM4_FC4
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM4_FC4(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM4_FC4_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM4_FC4_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM5_FC5_MASK   (0x2000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM5_FC5_SHIFT  (13U)
/*! FLEXCOMM5_FC5
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM5_FC5(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM5_FC5_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM5_FC5_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM6_FC6_MASK   (0x4000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM6_FC6_SHIFT  (14U)
/*! FLEXCOMM6_FC6
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM6_FC6(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM6_FC6_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM6_FC6_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM7_FC7_MASK   (0x8000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM7_FC7_SHIFT  (15U)
/*! FLEXCOMM7_FC7
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM7_FC7(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM7_FC7_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM7_FC7_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM8_FC8_MASK   (0x10000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM8_FC8_SHIFT  (16U)
/*! FLEXCOMM8_FC8
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM8_FC8(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM8_FC8_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM8_FC8_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM9_FC9_MASK   (0x20000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM9_FC9_SHIFT  (17U)
/*! FLEXCOMM9_FC9
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM9_FC9(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM9_FC9_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM9_FC9_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM10_FC10_MASK (0x40000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM10_FC10_SHIFT (18U)
/*! FLEXCOMM10_FC10
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM10_FC10(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM10_FC10_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM10_FC10_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM11_FC11_MASK (0x80000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM11_FC11_SHIFT (19U)
/*! FLEXCOMM11_FC11
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM11_FC11(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM11_FC11_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM11_FC11_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM12_FC12_MASK (0x100000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM12_FC12_SHIFT (20U)
/*! FLEXCOMM12_FC12
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM12_FC12(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM12_FC12_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM12_FC12_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM13_FC13_MASK (0x200000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM13_FC13_SHIFT (21U)
/*! FLEXCOMM13_FC13
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM13_FC13(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM13_FC13_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM13_FC13_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM14_MASK      (0x400000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM14_SHIFT     (22U)
/*! FLEXCOMM14
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM14(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM14_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM14_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM15_I2C_MASK  (0x800000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM15_I2C_SHIFT (23U)
/*! FLEXCOMM15_I2C
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM15_I2C(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM15_I2C_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM15_I2C_MASK)
#define CLKCTL1_PSCCTL0_SET_DMIC0_MASK           (0x1000000U)
#define CLKCTL1_PSCCTL0_SET_DMIC0_SHIFT          (24U)
/*! DMIC0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_DMIC0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_DMIC0_SHIFT)) & CLKCTL1_PSCCTL0_SET_DMIC0_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM16_MASK      (0x2000000U)
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM16_SHIFT     (25U)
/*! FLEXCOMM16
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXCOMM16(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXCOMM16_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXCOMM16_MASK)
#define CLKCTL1_PSCCTL0_SET_OSEVENT_TIMER_MASK   (0x8000000U)
#define CLKCTL1_PSCCTL0_SET_OSEVENT_TIMER_SHIFT  (27U)
/*! OSEVENT_TIMER
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_OSEVENT_TIMER(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_OSEVENT_TIMER_SHIFT)) & CLKCTL1_PSCCTL0_SET_OSEVENT_TIMER_MASK)
#define CLKCTL1_PSCCTL0_SET_FLEXIO_MASK          (0x20000000U)
#define CLKCTL1_PSCCTL0_SET_FLEXIO_SHIFT         (29U)
/*! FLEXIO
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL0_SET_FLEXIO(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_SET_FLEXIO_SHIFT)) & CLKCTL1_PSCCTL0_SET_FLEXIO_MASK)
/*! @} */

/*! @name PSCCTL1_SET - Clock Set 1 */
/*! @{ */
#define CLKCTL1_PSCCTL1_SET_HSGPIO0_MASK         (0x1U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO0_SHIFT        (0U)
/*! HSGPIO0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO0_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO0_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO1_MASK         (0x2U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO1_SHIFT        (1U)
/*! HSGPIO1
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO1_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO1_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO2_MASK         (0x4U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO2_SHIFT        (2U)
/*! HSGPIO2
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO2_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO2_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO3_MASK         (0x8U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO3_SHIFT        (3U)
/*! HSGPIO3
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO3(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO3_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO3_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO4_MASK         (0x10U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO4_SHIFT        (4U)
/*! HSGPIO4
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO4(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO4_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO4_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO5_MASK         (0x20U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO5_SHIFT        (5U)
/*! HSGPIO5
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO5(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO5_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO5_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO6_MASK         (0x40U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO6_SHIFT        (6U)
/*! HSGPIO6
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO6(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO6_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO6_MASK)
#define CLKCTL1_PSCCTL1_SET_HSGPIO7_MASK         (0x80U)
#define CLKCTL1_PSCCTL1_SET_HSGPIO7_SHIFT        (7U)
/*! HSGPIO7
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_HSGPIO7(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_HSGPIO7_SHIFT)) & CLKCTL1_PSCCTL1_SET_HSGPIO7_MASK)
#define CLKCTL1_PSCCTL1_SET_CRC_MASK             (0x10000U)
#define CLKCTL1_PSCCTL1_SET_CRC_SHIFT            (16U)
/*! CRC
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_CRC(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_CRC_SHIFT)) & CLKCTL1_PSCCTL1_SET_CRC_MASK)
#define CLKCTL1_PSCCTL1_SET_DMAC0_MASK           (0x800000U)
#define CLKCTL1_PSCCTL1_SET_DMAC0_SHIFT          (23U)
/*! DMAC0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_DMAC0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_DMAC0_SHIFT)) & CLKCTL1_PSCCTL1_SET_DMAC0_MASK)
#define CLKCTL1_PSCCTL1_SET_DMAC1_MASK           (0x1000000U)
#define CLKCTL1_PSCCTL1_SET_DMAC1_SHIFT          (24U)
/*! DMAC1
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_DMAC1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_DMAC1_SHIFT)) & CLKCTL1_PSCCTL1_SET_DMAC1_MASK)
#define CLKCTL1_PSCCTL1_SET_MU_MASK              (0x10000000U)
#define CLKCTL1_PSCCTL1_SET_MU_SHIFT             (28U)
/*! MU
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_MU(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_MU_SHIFT)) & CLKCTL1_PSCCTL1_SET_MU_MASK)
#define CLKCTL1_PSCCTL1_SET_SEMA_MASK            (0x20000000U)
#define CLKCTL1_PSCCTL1_SET_SEMA_SHIFT           (29U)
/*! SEMA
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_SEMA(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_SEMA_SHIFT)) & CLKCTL1_PSCCTL1_SET_SEMA_MASK)
#define CLKCTL1_PSCCTL1_SET_FREQME_MASK          (0x80000000U)
#define CLKCTL1_PSCCTL1_SET_FREQME_SHIFT         (31U)
/*! FREQME
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL1_SET_FREQME(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_SET_FREQME_SHIFT)) & CLKCTL1_PSCCTL1_SET_FREQME_MASK)
/*! @} */

/*! @name PSCCTL2_SET - Clock Set 2 */
/*! @{ */
#define CLKCTL1_PSCCTL2_SET_CT32BIT0_MASK        (0x1U)
#define CLKCTL1_PSCCTL2_SET_CT32BIT0_SHIFT       (0U)
/*! CT32BIT0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_CT32BIT0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_CT32BIT0_SHIFT)) & CLKCTL1_PSCCTL2_SET_CT32BIT0_MASK)
#define CLKCTL1_PSCCTL2_SET_CT32BIT1_MASK        (0x2U)
#define CLKCTL1_PSCCTL2_SET_CT32BIT1_SHIFT       (1U)
/*! CT32BIT1
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_CT32BIT1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_CT32BIT1_SHIFT)) & CLKCTL1_PSCCTL2_SET_CT32BIT1_MASK)
#define CLKCTL1_PSCCTL2_SET_CT32BIT2_MASK        (0x4U)
#define CLKCTL1_PSCCTL2_SET_CT32BIT2_SHIFT       (2U)
/*! CT32BIT2
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_CT32BIT2(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_CT32BIT2_SHIFT)) & CLKCTL1_PSCCTL2_SET_CT32BIT2_MASK)
#define CLKCTL1_PSCCTL2_SET_CT32BIT3_MASK        (0x8U)
#define CLKCTL1_PSCCTL2_SET_CT32BIT3_SHIFT       (3U)
/*! CT32BIT3
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_CT32BIT3(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_CT32BIT3_SHIFT)) & CLKCTL1_PSCCTL2_SET_CT32BIT3_MASK)
#define CLKCTL1_PSCCTL2_SET_CT32BIT4_MASK        (0x10U)
#define CLKCTL1_PSCCTL2_SET_CT32BIT4_SHIFT       (4U)
/*! CT32BIT4
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_CT32BIT4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_CT32BIT4_SHIFT)) & CLKCTL1_PSCCTL2_SET_CT32BIT4_MASK)
#define CLKCTL1_PSCCTL2_SET_RTCLITE_MASK         (0x80U)
#define CLKCTL1_PSCCTL2_SET_RTCLITE_SHIFT        (7U)
/*! RTCLITE
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_RTCLITE(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_RTCLITE_SHIFT)) & CLKCTL1_PSCCTL2_SET_RTCLITE_MASK)
#define CLKCTL1_PSCCTL2_SET_MRT0_MASK            (0x100U)
#define CLKCTL1_PSCCTL2_SET_MRT0_SHIFT           (8U)
/*! MRT0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_MRT0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_MRT0_SHIFT)) & CLKCTL1_PSCCTL2_SET_MRT0_MASK)
#define CLKCTL1_PSCCTL2_SET_WWDT1_MASK           (0x400U)
#define CLKCTL1_PSCCTL2_SET_WWDT1_SHIFT          (10U)
/*! WWDT1
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_WWDT1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_WWDT1_SHIFT)) & CLKCTL1_PSCCTL2_SET_WWDT1_MASK)
#define CLKCTL1_PSCCTL2_SET_I3C0_MASK            (0x10000U)
#define CLKCTL1_PSCCTL2_SET_I3C0_SHIFT           (16U)
/*! I3C0
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_I3C0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_I3C0_SHIFT)) & CLKCTL1_PSCCTL2_SET_I3C0_MASK)
#define CLKCTL1_PSCCTL2_SET_GPIOINTCTL_MASK      (0x40000000U)
#define CLKCTL1_PSCCTL2_SET_GPIOINTCTL_SHIFT     (30U)
/*! GPIOINTCTL
 *  0b0..No Effect
 *  0b1..Set Bit
 */
#define CLKCTL1_PSCCTL2_SET_GPIOINTCTL(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_GPIOINTCTL_SHIFT)) & CLKCTL1_PSCCTL2_SET_GPIOINTCTL_MASK)
#define CLKCTL1_PSCCTL2_SET_PIMCTL_MASK          (0x80000000U)
#define CLKCTL1_PSCCTL2_SET_PIMCTL_SHIFT         (31U)
#define CLKCTL1_PSCCTL2_SET_PIMCTL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_SET_PIMCTL_SHIFT)) & CLKCTL1_PSCCTL2_SET_PIMCTL_MASK)
/*! @} */

/*! @name PSCCTL0_CLR - Clock Clear 0 */
/*! @{ */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM0_FC0_MASK   (0x100U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM0_FC0_SHIFT  (8U)
/*! FLEXCOMM0_FC0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM0_FC0(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM0_FC0_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM0_FC0_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM1_FC1_MASK   (0x200U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM1_FC1_SHIFT  (9U)
/*! FLEXCOMM1_FC1
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM1_FC1(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM1_FC1_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM1_FC1_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM2_FC2_MASK   (0x400U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM2_FC2_SHIFT  (10U)
/*! FLEXCOMM2_FC2
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM2_FC2(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM2_FC2_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM2_FC2_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM3_FC3_MASK   (0x800U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM3_FC3_SHIFT  (11U)
/*! FLEXCOMM3_FC3
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM3_FC3(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM3_FC3_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM3_FC3_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM4_FC4_MASK   (0x1000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM4_FC4_SHIFT  (12U)
/*! FLEXCOMM4_FC4
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM4_FC4(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM4_FC4_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM4_FC4_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM5_FC5_MASK   (0x2000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM5_FC5_SHIFT  (13U)
/*! FLEXCOMM5_FC5
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM5_FC5(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM5_FC5_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM5_FC5_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM6_FC6_MASK   (0x4000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM6_FC6_SHIFT  (14U)
/*! FLEXCOMM6_FC6
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM6_FC6(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM6_FC6_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM6_FC6_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM7_FC7_MASK   (0x8000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM7_FC7_SHIFT  (15U)
/*! FLEXCOMM7_FC7
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM7_FC7(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM7_FC7_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM7_FC7_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM8_FC8_MASK   (0x10000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM8_FC8_SHIFT  (16U)
/*! FLEXCOMM8_FC8
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM8_FC8(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM8_FC8_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM8_FC8_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM9_FC9_MASK   (0x20000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM9_FC9_SHIFT  (17U)
/*! FLEXCOMM9_FC9
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM9_FC9(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM9_FC9_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM9_FC9_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM10_FC10_MASK (0x40000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM10_FC10_SHIFT (18U)
/*! FLEXCOMM10_FC10
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM10_FC10(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM10_FC10_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM10_FC10_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM11_FC11_MASK (0x80000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM11_FC11_SHIFT (19U)
/*! FLEXCOMM11_FC11
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM11_FC11(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM11_FC11_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM11_FC11_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM12_FC12_MASK (0x100000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM12_FC12_SHIFT (20U)
/*! FLEXCOMM12_FC12
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM12_FC12(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM12_FC12_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM12_FC12_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM13_FC13_MASK (0x200000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM13_FC13_SHIFT (21U)
/*! FLEXCOMM13_FC13
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM13_FC13(x)   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM13_FC13_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM13_FC13_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM14_MASK      (0x400000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM14_SHIFT     (22U)
/*! FLEXCOMM14
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM14(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM14_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM14_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM15_I2C_MASK  (0x800000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM15_I2C_SHIFT (23U)
/*! FLEXCOMM15_I2C
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM15_I2C(x)    (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM15_I2C_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM15_I2C_MASK)
#define CLKCTL1_PSCCTL0_CLR_DMIC0_MASK           (0x1000000U)
#define CLKCTL1_PSCCTL0_CLR_DMIC0_SHIFT          (24U)
/*! DMIC0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_DMIC0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_DMIC0_SHIFT)) & CLKCTL1_PSCCTL0_CLR_DMIC0_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM16_MASK      (0x2000000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM16_SHIFT     (25U)
/*! FLEXCOMM16
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXCOMM16(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXCOMM16_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXCOMM16_MASK)
#define CLKCTL1_PSCCTL0_CLR_OSEVENT_TIMER_MASK   (0x8000000U)
#define CLKCTL1_PSCCTL0_CLR_OSEVENT_TIMER_SHIFT  (27U)
/*! OSEVENT_TIMER
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_OSEVENT_TIMER(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_OSEVENT_TIMER_SHIFT)) & CLKCTL1_PSCCTL0_CLR_OSEVENT_TIMER_MASK)
#define CLKCTL1_PSCCTL0_CLR_FLEXIO_MASK          (0x20000000U)
#define CLKCTL1_PSCCTL0_CLR_FLEXIO_SHIFT         (29U)
/*! FLEXIO
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL0_CLR_FLEXIO(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL0_CLR_FLEXIO_SHIFT)) & CLKCTL1_PSCCTL0_CLR_FLEXIO_MASK)
/*! @} */

