espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name PSCCTL1_CLR - Clock Clear 1 */
/*! @{ */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO0_MASK         (0x1U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO0_SHIFT        (0U)
/*! HSGPIO0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO0(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO0_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO0_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO1_MASK         (0x2U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO1_SHIFT        (1U)
/*! HSGPIO1
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO1(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO1_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO1_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO2_MASK         (0x4U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO2_SHIFT        (2U)
/*! HSGPIO2
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO2(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO2_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO2_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO3_MASK         (0x8U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO3_SHIFT        (3U)
/*! HSGPIO3
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO3(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO3_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO3_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO4_MASK         (0x10U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO4_SHIFT        (4U)
/*! HSGPIO4
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO4(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO4_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO4_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO5_MASK         (0x20U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO5_SHIFT        (5U)
/*! HSGPIO5
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO5(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO5_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO5_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO6_MASK         (0x40U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO6_SHIFT        (6U)
/*! HSGPIO6
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO6(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO6_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO6_MASK)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO7_MASK         (0x80U)
#define CLKCTL1_PSCCTL1_CLR_HSGPIO7_SHIFT        (7U)
/*! HSGPIO7
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_HSGPIO7(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_HSGPIO7_SHIFT)) & CLKCTL1_PSCCTL1_CLR_HSGPIO7_MASK)
#define CLKCTL1_PSCCTL1_CLR_CRC_MASK             (0x10000U)
#define CLKCTL1_PSCCTL1_CLR_CRC_SHIFT            (16U)
/*! CRC
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_CRC(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_CRC_SHIFT)) & CLKCTL1_PSCCTL1_CLR_CRC_MASK)
#define CLKCTL1_PSCCTL1_CLR_DMAC0_MASK           (0x800000U)
#define CLKCTL1_PSCCTL1_CLR_DMAC0_SHIFT          (23U)
/*! DMAC0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_DMAC0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_DMAC0_SHIFT)) & CLKCTL1_PSCCTL1_CLR_DMAC0_MASK)
#define CLKCTL1_PSCCTL1_CLR_DMAC1_MASK           (0x1000000U)
#define CLKCTL1_PSCCTL1_CLR_DMAC1_SHIFT          (24U)
/*! DMAC1
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_DMAC1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_DMAC1_SHIFT)) & CLKCTL1_PSCCTL1_CLR_DMAC1_MASK)
#define CLKCTL1_PSCCTL1_CLR_MU_MASK              (0x10000000U)
#define CLKCTL1_PSCCTL1_CLR_MU_SHIFT             (28U)
/*! MU
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_MU(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_MU_SHIFT)) & CLKCTL1_PSCCTL1_CLR_MU_MASK)
#define CLKCTL1_PSCCTL1_CLR_SEMA_MASK            (0x20000000U)
#define CLKCTL1_PSCCTL1_CLR_SEMA_SHIFT           (29U)
/*! SEMA
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_SEMA(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_SEMA_SHIFT)) & CLKCTL1_PSCCTL1_CLR_SEMA_MASK)
#define CLKCTL1_PSCCTL1_CLR_FREQME_MASK          (0x80000000U)
#define CLKCTL1_PSCCTL1_CLR_FREQME_SHIFT         (31U)
/*! FREQME
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL1_CLR_FREQME(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL1_CLR_FREQME_SHIFT)) & CLKCTL1_PSCCTL1_CLR_FREQME_MASK)
/*! @} */

/*! @name PSCCTL2_CLR - Clock Clear 2 */
/*! @{ */
#define CLKCTL1_PSCCTL2_CLR_CT32BIT0_MASK        (0x1U)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT0_SHIFT       (0U)
/*! CT32BIT0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_CT32BIT0(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_CT32BIT0_SHIFT)) & CLKCTL1_PSCCTL2_CLR_CT32BIT0_MASK)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT1_MASK        (0x2U)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT1_SHIFT       (1U)
/*! CT32BIT1
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_CT32BIT1(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_CT32BIT1_SHIFT)) & CLKCTL1_PSCCTL2_CLR_CT32BIT1_MASK)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT2_MASK        (0x4U)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT2_SHIFT       (2U)
/*! CT32BIT2
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_CT32BIT2(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_CT32BIT2_SHIFT)) & CLKCTL1_PSCCTL2_CLR_CT32BIT2_MASK)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT3_MASK        (0x8U)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT3_SHIFT       (3U)
/*! CT32BIT3
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_CT32BIT3(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_CT32BIT3_SHIFT)) & CLKCTL1_PSCCTL2_CLR_CT32BIT3_MASK)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT4_MASK        (0x10U)
#define CLKCTL1_PSCCTL2_CLR_CT32BIT4_SHIFT       (4U)
/*! CT32BIT4
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_CT32BIT4(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_CT32BIT4_SHIFT)) & CLKCTL1_PSCCTL2_CLR_CT32BIT4_MASK)
#define CLKCTL1_PSCCTL2_CLR_RTCLITE_MASK         (0x80U)
#define CLKCTL1_PSCCTL2_CLR_RTCLITE_SHIFT        (7U)
/*! RTCLITE
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_RTCLITE(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_RTCLITE_SHIFT)) & CLKCTL1_PSCCTL2_CLR_RTCLITE_MASK)
#define CLKCTL1_PSCCTL2_CLR_MRT0_MASK            (0x100U)
#define CLKCTL1_PSCCTL2_CLR_MRT0_SHIFT           (8U)
/*! MRT0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_MRT0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_MRT0_SHIFT)) & CLKCTL1_PSCCTL2_CLR_MRT0_MASK)
#define CLKCTL1_PSCCTL2_CLR_WWDT1_MASK           (0x400U)
#define CLKCTL1_PSCCTL2_CLR_WWDT1_SHIFT          (10U)
/*! WWDT1
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_WWDT1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_WWDT1_SHIFT)) & CLKCTL1_PSCCTL2_CLR_WWDT1_MASK)
#define CLKCTL1_PSCCTL2_CLR_I3C0_MASK            (0x10000U)
#define CLKCTL1_PSCCTL2_CLR_I3C0_SHIFT           (16U)
/*! I3C0
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_I3C0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_I3C0_SHIFT)) & CLKCTL1_PSCCTL2_CLR_I3C0_MASK)
#define CLKCTL1_PSCCTL2_CLR_I3C1_MASK            (0x20000U)
#define CLKCTL1_PSCCTL2_CLR_I3C1_SHIFT           (17U)
/*! I3C1
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_I3C1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_I3C1_SHIFT)) & CLKCTL1_PSCCTL2_CLR_I3C1_MASK)
#define CLKCTL1_PSCCTL2_CLR_GPIOINTCTL_MASK      (0x40000000U)
#define CLKCTL1_PSCCTL2_CLR_GPIOINTCTL_SHIFT     (30U)
/*! GPIOINTCTL
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_GPIOINTCTL(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_GPIOINTCTL_SHIFT)) & CLKCTL1_PSCCTL2_CLR_GPIOINTCTL_MASK)
#define CLKCTL1_PSCCTL2_CLR_PIMCTL_MASK          (0x80000000U)
#define CLKCTL1_PSCCTL2_CLR_PIMCTL_SHIFT         (31U)
/*! PIMCTL
 *  0b0..No Effect
 *  0b1..Clear Bit
 */
#define CLKCTL1_PSCCTL2_CLR_PIMCTL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_PSCCTL2_CLR_PIMCTL_SHIFT)) & CLKCTL1_PSCCTL2_CLR_PIMCTL_MASK)
/*! @} */

/*! @name AUDIOPLL0CLKSEL - Audio PLL0 Clock Select */
/*! @{ */
#define CLKCTL1_AUDIOPLL0CLKSEL_SEL_MASK         (0x7U)
#define CLKCTL1_AUDIOPLL0CLKSEL_SEL_SHIFT        (0U)
/*! SEL - Audio PLL0 Clock Select
 *  0b000..FRO Clock (Divided-by-8 selection)
 *  0b001..OSC_CLK clock (User-Selectable)
 *  0b010..Reserved
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_AUDIOPLL0CLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0CLKSEL_SEL_SHIFT)) & CLKCTL1_AUDIOPLL0CLKSEL_SEL_MASK)
/*! @} */

/*! @name AUDIOPLL0CTL0 - Audio PLL0 Control 0 */
/*! @{ */
#define CLKCTL1_AUDIOPLL0CTL0_BYPASS_MASK        (0x1U)
#define CLKCTL1_AUDIOPLL0CTL0_BYPASS_SHIFT       (0U)
/*! BYPASS - AUDIOPLL0 BYPASS Mode
 *  0b0..PFD outputs are PFD-programmed clocks
 *  0b1..Bypass Mode. PFD outputs are sourced directly from the reference input clock
 */
#define CLKCTL1_AUDIOPLL0CTL0_BYPASS(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0CTL0_BYPASS_SHIFT)) & CLKCTL1_AUDIOPLL0CTL0_BYPASS_MASK)
#define CLKCTL1_AUDIOPLL0CTL0_RESET_MASK         (0x2U)
#define CLKCTL1_AUDIOPLL0CTL0_RESET_SHIFT        (1U)
/*! RESET - AUDIOPLL0 Reset
 *  0b0..AUDIOPLL0 reset is removed
 *  0b1..AUDIOPLL0 is placed into reset
 */
#define CLKCTL1_AUDIOPLL0CTL0_RESET(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0CTL0_RESET_SHIFT)) & CLKCTL1_AUDIOPLL0CTL0_RESET_MASK)
#define CLKCTL1_AUDIOPLL0CTL0_HOLDRINGOFF_ENA_MASK (0x2000U)
#define CLKCTL1_AUDIOPLL0CTL0_HOLDRINGOFF_ENA_SHIFT (13U)
/*! HOLDRINGOFF_ENA - Hold Ring Off Control
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL1_AUDIOPLL0CTL0_HOLDRINGOFF_ENA(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0CTL0_HOLDRINGOFF_ENA_SHIFT)) & CLKCTL1_AUDIOPLL0CTL0_HOLDRINGOFF_ENA_MASK)
#define CLKCTL1_AUDIOPLL0CTL0_MULT_MASK          (0xFF0000U)
#define CLKCTL1_AUDIOPLL0CTL0_MULT_SHIFT         (16U)
/*! MULT - Multiplication Factor for F SYSPLL0_OUTPUT
 *  0b00010000..Divide by 16
 *  0b00010001..Divide by 17
 *  0b00010100..Divide by 20
 *  0b00010110..Divide by 22
 *  0b00011011..Divide by 27
 *  0b00100001..Divide by 33
 */
#define CLKCTL1_AUDIOPLL0CTL0_MULT(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0CTL0_MULT_SHIFT)) & CLKCTL1_AUDIOPLL0CTL0_MULT_MASK)
/*! @} */

/*! @name AUDIOPLL0LOCKTIMEDIV2 - Audio PLL0 Lock Time Divide-by-2 */
/*! @{ */
#define CLKCTL1_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK (0xFFFFU)
#define CLKCTL1_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_SHIFT (0U)
/*! LOCKTIMEDIV2 - AUDIOPLL0 Lock Time Divide-by-2
 */
#define CLKCTL1_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_SHIFT)) & CLKCTL1_AUDIOPLL0LOCKTIMEDIV2_LOCKTIMEDIV2_MASK)
/*! @} */

/*! @name AUDIOPLL0NUM - Audio PLL0 Numerator */
/*! @{ */
#define CLKCTL1_AUDIOPLL0NUM_NUM_MASK            (0x3FFFFFFFU)
#define CLKCTL1_AUDIOPLL0NUM_NUM_SHIFT           (0U)
/*! NUM - Numerator
 */
#define CLKCTL1_AUDIOPLL0NUM_NUM(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0NUM_NUM_SHIFT)) & CLKCTL1_AUDIOPLL0NUM_NUM_MASK)
/*! @} */

/*! @name AUDIOPLL0DENOM - Audio PLL0 Denominator */
/*! @{ */
#define CLKCTL1_AUDIOPLL0DENOM_DENOM_MASK        (0x3FFFFFFFU)
#define CLKCTL1_AUDIOPLL0DENOM_DENOM_SHIFT       (0U)
/*! DENOM - Denominator
 */
#define CLKCTL1_AUDIOPLL0DENOM_DENOM(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0DENOM_DENOM_SHIFT)) & CLKCTL1_AUDIOPLL0DENOM_DENOM_MASK)
/*! @} */

/*! @name AUDIOPLL0PFD - Audio PLL0 PFD */
/*! @{ */
#define CLKCTL1_AUDIOPLL0PFD_PFD0_MASK           (0x3FU)
#define CLKCTL1_AUDIOPLL0PFD_PFD0_SHIFT          (0U)
/*! PFD0 - PLL Fractional Divider 0
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD0(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD0_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD0_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY_MASK    (0x40U)
#define CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY_SHIFT   (6U)
/*! PFD0_CLKRDY - PFD0 Clock Ready Status Flag
 *  0b0..Not ready
 *  0b1..Ready
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE_MASK   (0x80U)
#define CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE_SHIFT  (7U)
/*! PFD0_CLKGATE - PFD0 Clock Gate
 *  0b0..PFD0 clock is not gated
 *  0b1..PFD0 clock is gated
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD1_MASK           (0x3F00U)
#define CLKCTL1_AUDIOPLL0PFD_PFD1_SHIFT          (8U)
/*! PFD1 - PLL Fractional Divider 1
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD1_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD1_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD1_CLKRDY_MASK    (0x4000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD1_CLKRDY_SHIFT   (14U)
/*! PFD1_CLKRDY - PFD1 Clock Ready Status Flag
 *  0b0..Not ready
 *  0b1..Ready
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD1_CLKRDY(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD1_CLKRDY_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD1_CLKRDY_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD1_CLKGATE_MASK   (0x8000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD1_CLKGATE_SHIFT  (15U)
/*! PFD1_CLKGATE - PFD1 Clock Gate
 *  0b0..PFD1 clock is not gated
 *  0b1..PFD1 clock is gated
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD1_CLKGATE(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD1_CLKGATE_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD1_CLKGATE_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD2_MASK           (0x3F0000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD2_SHIFT          (16U)
/*! PFD2 - PLL Fractional Divider 2
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD2(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD2_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD2_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD2_CLKRDY_MASK    (0x400000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD2_CLKRDY_SHIFT   (22U)
/*! PFD2_CLKRDY - PFD2 Clock Ready Status Flag
 *  0b0..Not ready
 *  0b1..Ready
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD2_CLKRDY(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD2_CLKRDY_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD2_CLKRDY_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD2_CLKGATE_MASK   (0x800000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD2_CLKGATE_SHIFT  (23U)
/*! PFD2_CLKGATE - PFD2 Clock Gate
 *  0b0..PFD2 clock is not gated
 *  0b1..PFD2 clock is gated
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD2_CLKGATE(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD2_CLKGATE_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD2_CLKGATE_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD3_MASK           (0x3F000000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD3_SHIFT          (24U)
/*! PFD3 - PLL Fractional Divider 3
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD3(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD3_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD3_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD3_CLKRDY_MASK    (0x40000000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD3_CLKRDY_SHIFT   (30U)
/*! PFD3_CLKRDY - PFD3 Clock Ready Status Flag
 *  0b0..Not ready
 *  0b1..Ready
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD3_CLKRDY(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD3_CLKRDY_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD3_CLKRDY_MASK)
#define CLKCTL1_AUDIOPLL0PFD_PFD3_CLKGATE_MASK   (0x80000000U)
#define CLKCTL1_AUDIOPLL0PFD_PFD3_CLKGATE_SHIFT  (31U)
/*! PFD3_CLKGATE - PFD3 Clock Gate
 *  0b0..PFD3 clock is not gated
 *  0b1..PFD3 clock is gated
 */
#define CLKCTL1_AUDIOPLL0PFD_PFD3_CLKGATE(x)     (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLL0PFD_PFD3_CLKGATE_SHIFT)) & CLKCTL1_AUDIOPLL0PFD_PFD3_CLKGATE_MASK)
/*! @} */

/*! @name AUDIOPLLCLKDIV - Audio PLL Clock Divider */
/*! @{ */
#define CLKCTL1_AUDIOPLLCLKDIV_DIV_MASK          (0xFFU)
#define CLKCTL1_AUDIOPLLCLKDIV_DIV_SHIFT         (0U)
/*! DIV - 32 KHz Wake Clock Divider Value
 */
#define CLKCTL1_AUDIOPLLCLKDIV_DIV(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLLCLKDIV_DIV_SHIFT)) & CLKCTL1_AUDIOPLLCLKDIV_DIV_MASK)
#define CLKCTL1_AUDIOPLLCLKDIV_RESET_MASK        (0x20000000U)
#define CLKCTL1_AUDIOPLLCLKDIV_RESET_SHIFT       (29U)
/*! RESET - Reset the Divider Counter
 *  0b0..No effect
 *  0b1..Reset the Divider Counter
 */
#define CLKCTL1_AUDIOPLLCLKDIV_RESET(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLLCLKDIV_RESET_SHIFT)) & CLKCTL1_AUDIOPLLCLKDIV_RESET_MASK)
#define CLKCTL1_AUDIOPLLCLKDIV_HALT_MASK         (0x40000000U)
#define CLKCTL1_AUDIOPLLCLKDIV_HALT_SHIFT        (30U)
/*! HALT - Halt the Divider Counter
 *  0b0..No effect
 *  0b1..Halt (stop) the Divider Counter
 */
#define CLKCTL1_AUDIOPLLCLKDIV_HALT(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLLCLKDIV_HALT_SHIFT)) & CLKCTL1_AUDIOPLLCLKDIV_HALT_MASK)
#define CLKCTL1_AUDIOPLLCLKDIV_REQFLAG_MASK      (0x80000000U)
#define CLKCTL1_AUDIOPLLCLKDIV_REQFLAG_SHIFT     (31U)
/*! REQFLAG - Divider Status Flag
 *  0b0..The Divider change has finished
 *  0b1..The Divider value has changed
 */
#define CLKCTL1_AUDIOPLLCLKDIV_REQFLAG(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL1_AUDIOPLLCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_AUDIOPLLCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name DSPCPUCLKDIV - DSP CPU Clock Divider */
/*! @{ */
#define CLKCTL1_DSPCPUCLKDIV_DIV_MASK            (0xFFU)
#define CLKCTL1_DSPCPUCLKDIV_DIV_SHIFT           (0U)
/*! DIV - DSP Clock Divider Value
 */
#define CLKCTL1_DSPCPUCLKDIV_DIV(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL1_DSPCPUCLKDIV_DIV_SHIFT)) & CLKCTL1_DSPCPUCLKDIV_DIV_MASK)
#define CLKCTL1_DSPCPUCLKDIV_RESET_MASK          (0x20000000U)
#define CLKCTL1_DSPCPUCLKDIV_RESET_SHIFT         (29U)
/*! RESET - Reset the Divider Counter
 *  0b0..No effect
 *  0b1..Reset the Divider Counter
 */
#define CLKCTL1_DSPCPUCLKDIV_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL1_DSPCPUCLKDIV_RESET_SHIFT)) & CLKCTL1_DSPCPUCLKDIV_RESET_MASK)
#define CLKCTL1_DSPCPUCLKDIV_HALT_MASK           (0x40000000U)
#define CLKCTL1_DSPCPUCLKDIV_HALT_SHIFT          (30U)
/*! HALT - Halt the Divider Counter
 *  0b0..No effect
 *  0b1..Halt (stop) the Divider Counter
 */
#define CLKCTL1_DSPCPUCLKDIV_HALT(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_DSPCPUCLKDIV_HALT_SHIFT)) & CLKCTL1_DSPCPUCLKDIV_HALT_MASK)
#define CLKCTL1_DSPCPUCLKDIV_REQFLAG_MASK        (0x80000000U)
#define CLKCTL1_DSPCPUCLKDIV_REQFLAG_SHIFT       (31U)
/*! REQFLAG - Divider Status Flag
 *  0b0..The Divider change has finished (clock being divided must be running for this status to change).
 *  0b1..The Divider value has changed.
 */
#define CLKCTL1_DSPCPUCLKDIV_REQFLAG(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL1_DSPCPUCLKDIV_REQFLAG_SHIFT)) & CLKCTL1_DSPCPUCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name DSPCPUCLKSELA - DSP CPU Clock Select A */
/*! @{ */
#define CLKCTL1_DSPCPUCLKSELA_SEL_MASK           (0x3U)
#define CLKCTL1_DSPCPUCLKSELA_SEL_SHIFT          (0U)
/*! SEL - DSP Main 1st Stage Control Clock Source
 *  0b00..FRO Clock
 *  0b01..OSC_CLK Clock
 *  0b10..Low Power Oscillator Clock (LPOSC)
 *  0b11..Reserved
 */
#define CLKCTL1_DSPCPUCLKSELA_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_DSPCPUCLKSELA_SEL_SHIFT)) & CLKCTL1_DSPCPUCLKSELA_SEL_MASK)
/*! @} */

