espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name DSPCPUCLKSELB - DSP CPU Clock Select B */
/*! @{ */
#define CLKCTL1_DSPCPUCLKSELB_SEL_MASK           (0x3U)
#define CLKCTL1_DSPCPUCLKSELB_SEL_SHIFT          (0U)
/*! SEL - Main Clock Source
 *  0b00..MAINCLKSELA 1st Stage Clock
 *  0b01..Main System PLL Clock
 *  0b10..DSP System PLL Clock
 *  0b11..RTC 32 KHz Clock
 */
#define CLKCTL1_DSPCPUCLKSELB_SEL(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL1_DSPCPUCLKSELB_SEL_SHIFT)) & CLKCTL1_DSPCPUCLKSELB_SEL_MASK)
/*! @} */

/*! @name OSEVENTTFCLKSEL - OS Event Timer FCLK Select */
/*! @{ */
#define CLKCTL1_OSEVENTTFCLKSEL_SEL_MASK         (0x7U)
#define CLKCTL1_OSEVENTTFCLKSEL_SEL_SHIFT        (0U)
/*! SEL - OS Event Timer Functional Clock Source
 *  0b000..Low Power Oscillator Clock (LPOSC)
 *  0b001..RTC 32 KHz Clock
 *  0b010..HCLK Free-Running Clock (Global Time Stamping)
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_OSEVENTTFCLKSEL_SEL(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL1_OSEVENTTFCLKSEL_SEL_SHIFT)) & CLKCTL1_OSEVENTTFCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG0CLKSEL - Fractional Generator 0 Clock Select */
/*! @{ */
#define CLKCTL1_FRG0CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG0CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 0 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG0CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG0CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG0CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG0CTL - Fractional Generator 0 Control */
/*! @{ */
#define CLKCTL1_FRG0CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG0CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG0CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG0CTL_DIV_SHIFT)) & CLKCTL1_FRG0CTL_DIV_MASK)
#define CLKCTL1_FRG0CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG0CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG0CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG0CTL_MULT_SHIFT)) & CLKCTL1_FRG0CTL_MULT_MASK)
/*! @} */

/*! @name FC0FCLKSEL - FLEXCOMM 0 Clock Select */
/*! @{ */
#define CLKCTL1_FC0FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC0FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC0FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC0FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC0FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG1CLKSEL - Fractional Generator 1 Clock Select */
/*! @{ */
#define CLKCTL1_FRG1CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG1CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 1 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG1CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG1CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG1CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG1CTL - Fractional Generator 1 Control */
/*! @{ */
#define CLKCTL1_FRG1CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG1CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG1CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG1CTL_DIV_SHIFT)) & CLKCTL1_FRG1CTL_DIV_MASK)
#define CLKCTL1_FRG1CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG1CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG1CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG1CTL_MULT_SHIFT)) & CLKCTL1_FRG1CTL_MULT_MASK)
/*! @} */

/*! @name FC1FCLKSEL - FLEXCOMM 1 Clock Select */
/*! @{ */
#define CLKCTL1_FC1FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC1FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC1FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC1FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC1FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG2CLKSEL - Fractional Generator 2 Clock Select */
/*! @{ */
#define CLKCTL1_FRG2CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG2CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 2 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG2CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG2CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG2CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG2CTL - Fractional Generator 2 Control */
/*! @{ */
#define CLKCTL1_FRG2CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG2CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG2CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG2CTL_DIV_SHIFT)) & CLKCTL1_FRG2CTL_DIV_MASK)
#define CLKCTL1_FRG2CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG2CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG2CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG2CTL_MULT_SHIFT)) & CLKCTL1_FRG2CTL_MULT_MASK)
/*! @} */

/*! @name FC2FCLKSEL - FLEXCOMM 2 Clock Select */
/*! @{ */
#define CLKCTL1_FC2FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC2FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC2FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC2FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC2FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG3CLKSEL - Fractional Generator 3 Clock Select */
/*! @{ */
#define CLKCTL1_FRG3CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG3CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 3 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG3CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG3CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG3CLKSEL_SEL_MASK)
/*! @} */

