espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name FRG3CTL - Fractional Generator 3 Control */
/*! @{ */
#define CLKCTL1_FRG3CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG3CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG3CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG3CTL_DIV_SHIFT)) & CLKCTL1_FRG3CTL_DIV_MASK)
#define CLKCTL1_FRG3CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG3CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG3CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG3CTL_MULT_SHIFT)) & CLKCTL1_FRG3CTL_MULT_MASK)
/*! @} */

/*! @name FC3FCLKSEL - FLEXCOMM 3 Clock Select */
/*! @{ */
#define CLKCTL1_FC3FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC3FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC3FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC3FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC3FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG4CLKSEL - Fractional Generator 4 Clock Select */
/*! @{ */
#define CLKCTL1_FRG4CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG4CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 4 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG4CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG4CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG4CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG4CTL - Fractional Generator 4 Control */
/*! @{ */
#define CLKCTL1_FRG4CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG4CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG4CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG4CTL_DIV_SHIFT)) & CLKCTL1_FRG4CTL_DIV_MASK)
#define CLKCTL1_FRG4CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG4CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG4CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG4CTL_MULT_SHIFT)) & CLKCTL1_FRG4CTL_MULT_MASK)
/*! @} */

/*! @name FC4FCLKSEL - FLEXCOMM 4 Clock Select */
/*! @{ */
#define CLKCTL1_FC4FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC4FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC4FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC4FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC4FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG5CLKSEL - Fractional Generator 5 Clock Select */
/*! @{ */
#define CLKCTL1_FRG5CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG5CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 5 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG5CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG5CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG5CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG5CTL - Fractional Generator 5 Control */
/*! @{ */
#define CLKCTL1_FRG5CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG5CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG5CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG5CTL_DIV_SHIFT)) & CLKCTL1_FRG5CTL_DIV_MASK)
#define CLKCTL1_FRG5CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG5CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG5CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG5CTL_MULT_SHIFT)) & CLKCTL1_FRG5CTL_MULT_MASK)
/*! @} */

/*! @name FC5FCLKSEL - FLEXCOMM 5 Clock Select */
/*! @{ */
#define CLKCTL1_FC5FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC5FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC5FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC5FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC5FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG6CLKSEL - Fractional Generator 6 Clock Select */
/*! @{ */
#define CLKCTL1_FRG6CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG6CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 6 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG6CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG6CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG6CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG6CTL - Fractional Generator 6 Control */
/*! @{ */
#define CLKCTL1_FRG6CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG6CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG6CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG6CTL_DIV_SHIFT)) & CLKCTL1_FRG6CTL_DIV_MASK)
#define CLKCTL1_FRG6CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG6CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG6CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG6CTL_MULT_SHIFT)) & CLKCTL1_FRG6CTL_MULT_MASK)
/*! @} */

/*! @name FC6FCLKSEL - FLEXCOMM 6 Clock Select */
/*! @{ */
#define CLKCTL1_FC6FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC6FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC6FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC6FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC6FCLKSEL_SEL_MASK)
/*! @} */

