espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name FRG7CLKSEL - Fractional Generator 7 Clock Select */
/*! @{ */
#define CLKCTL1_FRG7CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG7CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 7 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG7CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG7CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG7CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG7CTL - Fractional Generator 7 Control */
/*! @{ */
#define CLKCTL1_FRG7CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG7CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG7CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG7CTL_DIV_SHIFT)) & CLKCTL1_FRG7CTL_DIV_MASK)
#define CLKCTL1_FRG7CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG7CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG7CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG7CTL_MULT_SHIFT)) & CLKCTL1_FRG7CTL_MULT_MASK)
/*! @} */

/*! @name FC7FCLKSEL - FLEXCOMM 7 Clock Select */
/*! @{ */
#define CLKCTL1_FC7FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC7FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC7FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC7FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC7FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG8CLKSEL - Fractional Generator 8 Clock Select */
/*! @{ */
#define CLKCTL1_FRG8CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG8CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 8 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG8CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG8CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG8CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG8CTL - Fractional Generator 8 Control */
/*! @{ */
#define CLKCTL1_FRG8CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG8CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG8CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG8CTL_DIV_SHIFT)) & CLKCTL1_FRG8CTL_DIV_MASK)
#define CLKCTL1_FRG8CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG8CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG8CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG8CTL_MULT_SHIFT)) & CLKCTL1_FRG8CTL_MULT_MASK)
/*! @} */

/*! @name FC8FCLKSEL - FLEXCOMM 8 Clock Select */
/*! @{ */
#define CLKCTL1_FC8FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC8FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC8FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC8FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC8FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG9CLKSEL - Fractional Generator 9 Clock Select */
/*! @{ */
#define CLKCTL1_FRG9CLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FRG9CLKSEL_SEL_SHIFT             (0U)
/*! SEL - Fractional Generator 9 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG9CLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG9CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG9CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG9CTL - Fractional Generator 9 Control */
/*! @{ */
#define CLKCTL1_FRG9CTL_DIV_MASK                 (0xFFU)
#define CLKCTL1_FRG9CTL_DIV_SHIFT                (0U)
#define CLKCTL1_FRG9CTL_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG9CTL_DIV_SHIFT)) & CLKCTL1_FRG9CTL_DIV_MASK)
#define CLKCTL1_FRG9CTL_MULT_MASK                (0xFF00U)
#define CLKCTL1_FRG9CTL_MULT_SHIFT               (8U)
#define CLKCTL1_FRG9CTL_MULT(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG9CTL_MULT_SHIFT)) & CLKCTL1_FRG9CTL_MULT_MASK)
/*! @} */

/*! @name FC9FCLKSEL - FLEXCOMM 9 Clock Select */
/*! @{ */
#define CLKCTL1_FC9FCLKSEL_SEL_MASK              (0x7U)
#define CLKCTL1_FC9FCLKSEL_SEL_SHIFT             (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC9FCLKSEL_SEL(x)                (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC9FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC9FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG10CLKSEL - Fractional Generator 10 Clock Select */
/*! @{ */
#define CLKCTL1_FRG10CLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FRG10CLKSEL_SEL_SHIFT            (0U)
/*! SEL - Fractional Generator 10 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG10CLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG10CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG10CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG10CTL - Fractional Generator 10 Control */
/*! @{ */
#define CLKCTL1_FRG10CTL_DIV_MASK                (0xFFU)
#define CLKCTL1_FRG10CTL_DIV_SHIFT               (0U)
#define CLKCTL1_FRG10CTL_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG10CTL_DIV_SHIFT)) & CLKCTL1_FRG10CTL_DIV_MASK)
#define CLKCTL1_FRG10CTL_MULT_MASK               (0xFF00U)
#define CLKCTL1_FRG10CTL_MULT_SHIFT              (8U)
#define CLKCTL1_FRG10CTL_MULT(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG10CTL_MULT_SHIFT)) & CLKCTL1_FRG10CTL_MULT_MASK)
/*! @} */

