espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name FC10FCLKSEL - FLEXCOMM 10 Clock Select */
/*! @{ */
#define CLKCTL1_FC10FCLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FC10FCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC10FCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC10FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC10FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG11CLKSEL - Fractional Generator 11 Clock Select */
/*! @{ */
#define CLKCTL1_FRG11CLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FRG11CLKSEL_SEL_SHIFT            (0U)
/*! SEL - Fractional Generator 11 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG11CLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG11CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG11CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG11CTL - Fractional Generator 11 Control */
/*! @{ */
#define CLKCTL1_FRG11CTL_DIV_MASK                (0xFFU)
#define CLKCTL1_FRG11CTL_DIV_SHIFT               (0U)
#define CLKCTL1_FRG11CTL_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG11CTL_DIV_SHIFT)) & CLKCTL1_FRG11CTL_DIV_MASK)
#define CLKCTL1_FRG11CTL_MULT_MASK               (0xFF00U)
#define CLKCTL1_FRG11CTL_MULT_SHIFT              (8U)
#define CLKCTL1_FRG11CTL_MULT(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG11CTL_MULT_SHIFT)) & CLKCTL1_FRG11CTL_MULT_MASK)
/*! @} */

/*! @name FC11FCLKSEL - FLEXCOMM 11 Clock Select */
/*! @{ */
#define CLKCTL1_FC11FCLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FC11FCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC11FCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC11FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC11FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG12CLKSEL - Fractional Generator 12 Clock Select */
/*! @{ */
#define CLKCTL1_FRG12CLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FRG12CLKSEL_SEL_SHIFT            (0U)
/*! SEL - Fractional Generator 12 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG12CLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG12CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG12CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG12CTL - Fractional Generator 12 Control */
/*! @{ */
#define CLKCTL1_FRG12CTL_DIV_MASK                (0xFFU)
#define CLKCTL1_FRG12CTL_DIV_SHIFT               (0U)
#define CLKCTL1_FRG12CTL_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG12CTL_DIV_SHIFT)) & CLKCTL1_FRG12CTL_DIV_MASK)
#define CLKCTL1_FRG12CTL_MULT_MASK               (0xFF00U)
#define CLKCTL1_FRG12CTL_MULT_SHIFT              (8U)
#define CLKCTL1_FRG12CTL_MULT(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG12CTL_MULT_SHIFT)) & CLKCTL1_FRG12CTL_MULT_MASK)
/*! @} */

/*! @name FC12FCLKSEL - FLEXCOMM 12 Clock Select */
/*! @{ */
#define CLKCTL1_FC12FCLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FC12FCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC12FCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC12FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC12FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG13CLKSEL - Fractional Generator 13 Clock Select */
/*! @{ */
#define CLKCTL1_FRG13CLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FRG13CLKSEL_SEL_SHIFT            (0U)
/*! SEL - Fractional Generator 13 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG13CLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG13CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG13CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG13CTL - Fractional Generator 13 Control */
/*! @{ */
#define CLKCTL1_FRG13CTL_DIV_MASK                (0xFFU)
#define CLKCTL1_FRG13CTL_DIV_SHIFT               (0U)
#define CLKCTL1_FRG13CTL_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG13CTL_DIV_SHIFT)) & CLKCTL1_FRG13CTL_DIV_MASK)
#define CLKCTL1_FRG13CTL_MULT_MASK               (0xFF00U)
#define CLKCTL1_FRG13CTL_MULT_SHIFT              (8U)
#define CLKCTL1_FRG13CTL_MULT(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG13CTL_MULT_SHIFT)) & CLKCTL1_FRG13CTL_MULT_MASK)
/*! @} */

/*! @name FC13FCLKSEL - FLEXCOMM 13 Clock Select */
/*! @{ */
#define CLKCTL1_FC13FCLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FC13FCLKSEL_SEL_SHIFT            (0U)
/*! SEL - Flexcomm Functional Clock Source
 *  0b000..FRO Clock Divided-by-4
 *  0b001..Audio PLL Clock
 *  0b010..Master Clock In
 *  0b011..FCn FRG Clock
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FC13FCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FC13FCLKSEL_SEL_SHIFT)) & CLKCTL1_FC13FCLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG14CLKSEL - Fractional Generator 14 Clock Select */
/*! @{ */
#define CLKCTL1_FRG14CLKSEL_SEL_MASK             (0x7U)
#define CLKCTL1_FRG14CLKSEL_SEL_SHIFT            (0U)
/*! SEL - Fractional Generator 14 Clock Source
 *  0b000..Main Clock
 *  0b001..FRG PLL Clock
 *  0b010..FRO Clock Divided by 4
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Reserved
 *  0b110..Reserved
 *  0b111..None, output gated to reduce power
 */
#define CLKCTL1_FRG14CLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG14CLKSEL_SEL_SHIFT)) & CLKCTL1_FRG14CLKSEL_SEL_MASK)
/*! @} */

/*! @name FRG14CTL - Fractional Generator 14 Control */
/*! @{ */
#define CLKCTL1_FRG14CTL_DIV_MASK                (0xFFU)
#define CLKCTL1_FRG14CTL_DIV_SHIFT               (0U)
#define CLKCTL1_FRG14CTL_DIV(x)                  (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG14CTL_DIV_SHIFT)) & CLKCTL1_FRG14CTL_DIV_MASK)
#define CLKCTL1_FRG14CTL_MULT_MASK               (0xFF00U)
#define CLKCTL1_FRG14CTL_MULT_SHIFT              (8U)
#define CLKCTL1_FRG14CTL_MULT(x)                 (((uint32_t)(((uint32_t)(x)) << CLKCTL1_FRG14CTL_MULT_SHIFT)) & CLKCTL1_FRG14CTL_MULT_MASK)
/*! @} */

