espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/** LCDIF - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4672];
  __IO uint32_t FRAMEBUFFERCONFIG0;                /**< Frame Buffer and Timing control, offset: 0x1240 */
       uint8_t RESERVED_1[28];
  __IO uint32_t FRAMEBUFFERADDRESS0;               /**< Starting address of the frame buffer, offset: 0x1260 */
       uint8_t RESERVED_2[28];
  __IO uint32_t FRAMEBUFFERSTRIDE0;                /**< Stride of the frame buffer in bytes, offset: 0x1280 */
       uint8_t RESERVED_3[28];
  __IO uint32_t FRAMEBUFFERORIGIN0;                /**< Pixel origin inside the frame buffer for the top-left panel pixel, offset: 0x12A0 */
       uint8_t RESERVED_4[188];
  __IO uint32_t DISPLAYDITHERCONFIG0;              /**< Configuration register for dithering, offset: 0x1360 */
       uint8_t RESERVED_5[28];
  __IO uint32_t DISPLAYDITHERTABLELOW0;            /**< Dither table low, offset: 0x1380 */
       uint8_t RESERVED_6[28];
  __IO uint32_t DISPLAYDITHERTABLEHIGH0;           /**< Dither table high, offset: 0x13A0 */
       uint8_t RESERVED_7[28];
  __IO uint32_t PANELCONFIG0;                      /**< Panel configuration, offset: 0x13C0 */
       uint8_t RESERVED_8[28];
  __IO uint32_t PANELTIMING0;                      /**< Timing for hardware panel sequencing, offset: 0x13E0 */
       uint8_t RESERVED_9[28];
  __IO uint32_t HDISPLAY0;                         /**< Horizontal Total and Display End counters, offset: 0x1400 */
       uint8_t RESERVED_10[28];
  __IO uint32_t HSYNC0;                            /**< Horizontal Sync counters, offset: 0x1420 */
       uint8_t RESERVED_11[28];
  __IO uint32_t HCOUNTER10;                        /**< Horizontal Programmable Counter 1, offset: 0x1440 */
       uint8_t RESERVED_12[28];
  __IO uint32_t HCOUNTER20;                        /**< Horizontal Programmable Counter 2, offset: 0x1460 */
       uint8_t RESERVED_13[28];
  __IO uint32_t VDISPLAY0;                         /**< Vertical Total and Display End counters, offset: 0x1480 */
       uint8_t RESERVED_14[28];
  __IO uint32_t VSYNC0;                            /**< Vertical Sync counters, offset: 0x14A0 */
       uint8_t RESERVED_15[28];
  __I  uint32_t DISPLAYCURRENTLOCATION0;           /**< Current x,y location of display controller, offset: 0x14C0 */
       uint8_t RESERVED_16[28];
  __IO uint32_t GAMMAINDEX0;                       /**< Index into gamma table, offset: 0x14E0 */
       uint8_t RESERVED_17[28];
  __IO uint32_t GAMMADATA0;                        /**< Translation values for the gamma table, offset: 0x1500 */
       uint8_t RESERVED_18[28];
  __IO uint32_t CURSORCONFIG;                      /**< Configuration register for the cursor, offset: 0x1520 */
       uint8_t RESERVED_19[12];
  __IO uint32_t CURSORADDRESS;                     /**< Address of the cursor shape, offset: 0x1530 */
       uint8_t RESERVED_20[12];
  __IO uint32_t CURSORLOCATION;                    /**< Location of the cursor on the owning display, offset: 0x1540 */
       uint8_t RESERVED_21[12];
  __IO uint32_t CURSORBACKGROUND;                  /**< The background color for Masked cursors, offset: 0x1550 */
       uint8_t RESERVED_22[12];
  __IO uint32_t CURSORFOREGROUND;                  /**< The foreground color for Masked cursors, offset: 0x1560 */
       uint8_t RESERVED_23[156];
  __IO uint32_t DISPLAYINTR;                       /**< Display interrupt register, offset: 0x1600 */
       uint8_t RESERVED_24[12];
  __IO uint32_t DISPLAYINTRENABLE;                 /**< The interrupt enable register for display_0 (and display_1 if present), offset: 0x1610 */
       uint8_t RESERVED_25[12];
  __IO uint32_t DBICONFIG0;                        /**< Configuration register for DBI output, offset: 0x1620 */
       uint8_t RESERVED_26[28];
  __O  uint32_t DBIIFRESET0;                       /**< Reset DBI interface to idle state, offset: 0x1640 */
       uint8_t RESERVED_27[28];
  __IO uint32_t DBIWRCHAR10;                       /**< DBI write AC characteristics definition register 1, offset: 0x1660 */
       uint8_t RESERVED_28[28];
  __IO uint32_t DBIWRCHAR20;                       /**< DBI write AC characteristics definition register 2, offset: 0x1680 */
       uint8_t RESERVED_29[28];
  __O  uint32_t DBICMD0;                           /**< DBI Command in/out port, offset: 0x16A0 */
       uint8_t RESERVED_30[28];
  __IO uint32_t DPICONFIG0;                        /**< The configuration register for DPI output, offset: 0x16C0 */
       uint8_t RESERVED_31[44];
  __I  uint32_t DCCHIPREV;                         /**< Revision for the chip in BCD, offset: 0x16F0 */
       uint8_t RESERVED_32[12];
  __I  uint32_t DCCHIPDATE;                        /**< Shows the release date for the IP in YYYYMMDD (year, month), offset: 0x1700 */
       uint8_t RESERVED_33[28];
  __I  uint32_t DCCHIPPATCHREV;                    /**< Patch revision, offset: 0x1720 */
       uint8_t RESERVED_34[28];
  __IO uint32_t DCTILEINCFG0;                      /**< Tile input configuration, offset: 0x1740 */
       uint8_t RESERVED_35[28];
  __IO uint32_t DCTILEUVFRAMEBUFFERADR0;           /**< UV frame buffer address when tile input, offset: 0x1760 */
       uint8_t RESERVED_36[28];
  __IO uint32_t DCTILEUVFRAMEBUFFERSTR0;           /**< UV frame buffer stride when tile input, offset: 0x1780 */
       uint8_t RESERVED_37[44];
  __I  uint32_t DCPRODUCTID;                       /**< Product ID, offset: 0x17B0 */
       uint8_t RESERVED_38[44];
  __IO uint32_t DBITYPECCFG0;                      /**< DBI Type C write timing definition., offset: 0x17E0 */
       uint8_t RESERVED_39[28];
  __IO uint32_t DCSTATUS0;                         /**< , offset: 0x1800 */
       uint8_t RESERVED_40[28];
  __IO uint32_t DEBUGCOUNTERSELECT0;               /**< , offset: 0x1820 */
       uint8_t RESERVED_41[28];
  __IO uint32_t DEBUGCOUNTERVALUE0;                /**< Debug Counter Value as specified in DebugCounterSelect, offset: 0x1840 */
} LCDIF_Type;

/* ----------------------------------------------------------------------------
   -- LCDIF Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LCDIF_Register_Masks LCDIF Register Masks
 * @{
 */

/*! @name FRAMEBUFFERCONFIG0 - Frame Buffer and Timing control */
/*! @{ */
#define LCDIF_FRAMEBUFFERCONFIG0_FORMAT_MASK     (0x7U)
#define LCDIF_FRAMEBUFFERCONFIG0_FORMAT_SHIFT    (0U)
/*! FORMAT - The format of the frame buffer.
 */
#define LCDIF_FRAMEBUFFERCONFIG0_FORMAT(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_FORMAT_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_FORMAT_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_MODE_MASK       (0x10U)
#define LCDIF_FRAMEBUFFERCONFIG0_MODE_SHIFT      (4U)
/*! MODE - Mode of the frame buffer.
 *  0b0..LINEAR
 *  0b1..TILE4x4 INPUT
 */
#define LCDIF_FRAMEBUFFERCONFIG0_MODE(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_MODE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_MODE_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_OUTPUT_MASK     (0x100U)
#define LCDIF_FRAMEBUFFERCONFIG0_OUTPUT_SHIFT    (8U)
/*! OUTPUT - When Output is enabled, pixels will be displayed. When Output is disabled, all pixels
 *    will be black. This allows a panel to have correct timing but without any pixels.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_FRAMEBUFFERCONFIG0_OUTPUT(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_OUTPUT_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_OUTPUT_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_SWITCHPANEL_MASK (0x200U)
#define LCDIF_FRAMEBUFFERCONFIG0_SWITCHPANEL_SHIFT (9U)
/*! SWITCHPANEL - When SwitchPanel of panel 0 is enabled, output channel 0 will show the image of
 *    panel 1,not panel 0's. When SwitchPanel of panel 0 is disabeld,output channel 0 will show its
 *    original image which is from panel 0. When SwitchPanel of panel 1 is enabled, output channel 1
 *    will show the image of panel 0,not panel 1's. When SwitchPanle of panel 1 is disabled,output
 *    channel 1 will show the original image which is from panel 1. disabled(normal) enabled(switch)
 *    output channel 0 panel 0 panel 1 output channel 1 panel 1 panel 0.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_FRAMEBUFFERCONFIG0_SWITCHPANEL(x)  (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_SWITCHPANEL_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_SWITCHPANEL_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_GAMMA_MASK      (0x1000U)
#define LCDIF_FRAMEBUFFERCONFIG0_GAMMA_SHIFT     (12U)
/*! GAMMA
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_FRAMEBUFFERCONFIG0_GAMMA(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_GAMMA_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_GAMMA_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_VALID_MASK      (0x10000U)
#define LCDIF_FRAMEBUFFERCONFIG0_VALID_SHIFT     (16U)
#define LCDIF_FRAMEBUFFERCONFIG0_VALID(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_VALID_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_VALID_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_RESET_MASK      (0x100000U)
#define LCDIF_FRAMEBUFFERCONFIG0_RESET_SHIFT     (20U)
/*! RESET
 *  0b0..For DBI, this field should be = 0.
 *  0b1..Enable DPI Timing, start a DPI transfer.
 */
#define LCDIF_FRAMEBUFFERCONFIG0_RESET(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_RESET_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_RESET_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_UNDERFLOW_MASK  (0x1000000U)
#define LCDIF_FRAMEBUFFERCONFIG0_UNDERFLOW_SHIFT (24U)
#define LCDIF_FRAMEBUFFERCONFIG0_UNDERFLOW(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_UNDERFLOW_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_UNDERFLOW_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_FLIP_IN_PROGRESS_MASK (0x10000000U)
#define LCDIF_FRAMEBUFFERCONFIG0_FLIP_IN_PROGRESS_SHIFT (28U)
#define LCDIF_FRAMEBUFFERCONFIG0_FLIP_IN_PROGRESS(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_FLIP_IN_PROGRESS_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_FLIP_IN_PROGRESS_MASK)
#define LCDIF_FRAMEBUFFERCONFIG0_BACK_PRESSURE_DISABLE_MASK (0x20000000U)
#define LCDIF_FRAMEBUFFERCONFIG0_BACK_PRESSURE_DISABLE_SHIFT (29U)
/*! BACK_PRESSURE_DISABLE - 0=NO; 1=YES;
 */
#define LCDIF_FRAMEBUFFERCONFIG0_BACK_PRESSURE_DISABLE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERCONFIG0_BACK_PRESSURE_DISABLE_SHIFT)) & LCDIF_FRAMEBUFFERCONFIG0_BACK_PRESSURE_DISABLE_MASK)
/*! @} */

/*! @name FRAMEBUFFERADDRESS0 - Starting address of the frame buffer */
/*! @{ */
#define LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_MASK   (0x7FFFFFFFU)
#define LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_SHIFT  (0U)
/*! ADDRESS - ADDRESS
 */
#define LCDIF_FRAMEBUFFERADDRESS0_ADDRESS(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_SHIFT)) & LCDIF_FRAMEBUFFERADDRESS0_ADDRESS_MASK)
#define LCDIF_FRAMEBUFFERADDRESS0_TYPE_MASK      (0x80000000U)
#define LCDIF_FRAMEBUFFERADDRESS0_TYPE_SHIFT     (31U)
/*! TYPE - 0=SYSTEM; 1=VIRTUAL_SYSTEM;
 */
#define LCDIF_FRAMEBUFFERADDRESS0_TYPE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERADDRESS0_TYPE_SHIFT)) & LCDIF_FRAMEBUFFERADDRESS0_TYPE_MASK)
/*! @} */

/*! @name FRAMEBUFFERSTRIDE0 - Stride of the frame buffer in bytes */
/*! @{ */
#define LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_MASK     (0x1FFFFU)
#define LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_SHIFT    (0U)
/*! STRIDE - Number of bytes from start of one line to next line. This value needs to be 128 byte aligned.
 */
#define LCDIF_FRAMEBUFFERSTRIDE0_STRIDE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_SHIFT)) & LCDIF_FRAMEBUFFERSTRIDE0_STRIDE_MASK)
/*! @} */

/*! @name FRAMEBUFFERORIGIN0 - Pixel origin inside the frame buffer for the top-left panel pixel */
/*! @{ */
#define LCDIF_FRAMEBUFFERORIGIN0_X_MASK          (0x7FFU)
#define LCDIF_FRAMEBUFFERORIGIN0_X_SHIFT         (0U)
/*! X - X origin of frame buffer for panning.
 */
#define LCDIF_FRAMEBUFFERORIGIN0_X(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERORIGIN0_X_SHIFT)) & LCDIF_FRAMEBUFFERORIGIN0_X_MASK)
#define LCDIF_FRAMEBUFFERORIGIN0_Y_MASK          (0x7FF0000U)
#define LCDIF_FRAMEBUFFERORIGIN0_Y_SHIFT         (16U)
/*! Y - Y origin of frame buffer for panning.
 */
#define LCDIF_FRAMEBUFFERORIGIN0_Y(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_FRAMEBUFFERORIGIN0_Y_SHIFT)) & LCDIF_FRAMEBUFFERORIGIN0_Y_MASK)
/*! @} */

/*! @name DISPLAYDITHERCONFIG0 - Configuration register for dithering */
/*! @{ */
#define LCDIF_DISPLAYDITHERCONFIG0_BLUE_SIZE_MASK (0xFU)
#define LCDIF_DISPLAYDITHERCONFIG0_BLUE_SIZE_SHIFT (0U)
/*! BLUE_SIZE - Number of important bits for the blue channel for the panel. Start counting from MSB.
 */
#define LCDIF_DISPLAYDITHERCONFIG0_BLUE_SIZE(x)  (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERCONFIG0_BLUE_SIZE_SHIFT)) & LCDIF_DISPLAYDITHERCONFIG0_BLUE_SIZE_MASK)
#define LCDIF_DISPLAYDITHERCONFIG0_GREEN_SIZE_MASK (0xF00U)
#define LCDIF_DISPLAYDITHERCONFIG0_GREEN_SIZE_SHIFT (8U)
/*! GREEN_SIZE - Number of important bits for the green channel for the panel. Start counting from MSB.
 */
#define LCDIF_DISPLAYDITHERCONFIG0_GREEN_SIZE(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERCONFIG0_GREEN_SIZE_SHIFT)) & LCDIF_DISPLAYDITHERCONFIG0_GREEN_SIZE_MASK)
#define LCDIF_DISPLAYDITHERCONFIG0_RED_SIZE_MASK (0xF0000U)
#define LCDIF_DISPLAYDITHERCONFIG0_RED_SIZE_SHIFT (16U)
/*! RED_SIZE - Number of important bits for the red channel for the panel. Start counting from MSB.
 */
#define LCDIF_DISPLAYDITHERCONFIG0_RED_SIZE(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERCONFIG0_RED_SIZE_SHIFT)) & LCDIF_DISPLAYDITHERCONFIG0_RED_SIZE_MASK)
#define LCDIF_DISPLAYDITHERCONFIG0_ENABLE_MASK   (0x80000000U)
#define LCDIF_DISPLAYDITHERCONFIG0_ENABLE_SHIFT  (31U)
/*! ENABLE - Enabling dithering allows R8G8B8 modes to show better on panels with less bits-per-pixel.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_DISPLAYDITHERCONFIG0_ENABLE(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERCONFIG0_ENABLE_SHIFT)) & LCDIF_DISPLAYDITHERCONFIG0_ENABLE_MASK)
/*! @} */

/*! @name DISPLAYDITHERTABLELOW0 - Dither table low */
/*! @{ */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_MASK  (0xFU)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_SHIFT (0U)
/*! Y0_X0 - Dither threshold value for x,y=0,0.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X0_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_MASK  (0xF0U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_SHIFT (4U)
/*! Y0_X1 - Dither threshold value for x,y=1,0.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X1_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_MASK  (0xF00U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_SHIFT (8U)
/*! Y0_X2 - Dither threshold value for x,y=2,0.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X2_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_MASK  (0xF000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_SHIFT (12U)
/*! Y0_X3 - Dither threshold value for x,y=3,0.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y0_X3_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_MASK  (0xF0000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_SHIFT (16U)
/*! Y1_X0 - Dither threshold value for x,y=0,1.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y1_X0_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_MASK  (0xF00000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_SHIFT (20U)
/*! Y1_X1 - Dither threshold value for x,y=1,1.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y1_X1_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X2_MASK  (0xF000000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X2_SHIFT (24U)
/*! Y1_X2 - Dither threshold value for x,y=2,1.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X2(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y1_X2_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y1_X2_MASK)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X3_MASK  (0xF0000000U)
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X3_SHIFT (28U)
/*! Y1_X3 - Dither threshold value for x,y=3,1.
 */
#define LCDIF_DISPLAYDITHERTABLELOW0_Y1_X3(x)    (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLELOW0_Y1_X3_SHIFT)) & LCDIF_DISPLAYDITHERTABLELOW0_Y1_X3_MASK)
/*! @} */

/*! @name DISPLAYDITHERTABLEHIGH0 - Dither table high */
/*! @{ */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X0_MASK (0xFU)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X0_SHIFT (0U)
/*! Y2_X0 - Dither threshold value for x,y=0,2.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X0(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X0_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X0_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X1_MASK (0xF0U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X1_SHIFT (4U)
/*! Y2_X1 - Dither threshold value for x,y=1,2.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X1(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X1_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X1_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X2_MASK (0xF00U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X2_SHIFT (8U)
/*! Y2_X2 - Dither threshold value for x,y=2,2.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X2(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X2_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X2_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X3_MASK (0xF000U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X3_SHIFT (12U)
/*! Y2_X3 - Dither threshold value for x,y=3,2.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X3(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X3_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y2_X3_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X0_MASK (0xF0000U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X0_SHIFT (16U)
/*! Y3_X0 - Dither threshold value for x,y=0,3.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X0(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X0_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X0_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X1_MASK (0xF00000U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X1_SHIFT (20U)
/*! Y3_X1 - Dither threshold value for x,y=1,3.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X1(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X1_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X1_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X2_MASK (0xF000000U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X2_SHIFT (24U)
/*! Y3_X2 - Dither threshold value for x,y=2,3.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X2(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X2_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X2_MASK)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X3_MASK (0xF0000000U)
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X3_SHIFT (28U)
/*! Y3_X3 - Dither threshold value for x,y=3,3.
 */
#define LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X3(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X3_SHIFT)) & LCDIF_DISPLAYDITHERTABLEHIGH0_Y3_X3_MASK)
/*! @} */

/*! @name PANELCONFIG0 - Panel configuration */
/*! @{ */
#define LCDIF_PANELCONFIG0_DE_MASK               (0x1U)
#define LCDIF_PANELCONFIG0_DE_SHIFT              (0U)
/*! DE - Data Enable enabled/disabled.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_PANELCONFIG0_DE(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_DE_SHIFT)) & LCDIF_PANELCONFIG0_DE_MASK)
#define LCDIF_PANELCONFIG0_DE_POLARITY_MASK      (0x2U)
#define LCDIF_PANELCONFIG0_DE_POLARITY_SHIFT     (1U)
/*! DE_POLARITY - Data Enable polarity.
 *  0b0..POSITIVE
 *  0b1..NEGATIVE
 */
#define LCDIF_PANELCONFIG0_DE_POLARITY(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_DE_POLARITY_SHIFT)) & LCDIF_PANELCONFIG0_DE_POLARITY_MASK)
#define LCDIF_PANELCONFIG0_DATA_ENABLE_MASK      (0x10U)
#define LCDIF_PANELCONFIG0_DATA_ENABLE_SHIFT     (4U)
/*! DATA_ENABLE - Data enabled/disabled.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_PANELCONFIG0_DATA_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_DATA_ENABLE_SHIFT)) & LCDIF_PANELCONFIG0_DATA_ENABLE_MASK)
#define LCDIF_PANELCONFIG0_DATA_POLARITY_MASK    (0x20U)
#define LCDIF_PANELCONFIG0_DATA_POLARITY_SHIFT   (5U)
/*! DATA_POLARITY - Data polarity.
 *  0b0..POSITIVE
 *  0b1..NEGATIVE
 */
#define LCDIF_PANELCONFIG0_DATA_POLARITY(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_DATA_POLARITY_SHIFT)) & LCDIF_PANELCONFIG0_DATA_POLARITY_MASK)
#define LCDIF_PANELCONFIG0_CLOCK_MASK            (0x100U)
#define LCDIF_PANELCONFIG0_CLOCK_SHIFT           (8U)
/*! CLOCK - Clock enable/disable.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_PANELCONFIG0_CLOCK(x)              (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_CLOCK_SHIFT)) & LCDIF_PANELCONFIG0_CLOCK_MASK)
#define LCDIF_PANELCONFIG0_CLOCK_POLARITY_MASK   (0x200U)
#define LCDIF_PANELCONFIG0_CLOCK_POLARITY_SHIFT  (9U)
/*! CLOCK_POLARITY - Clock polarity.
 *  0b0..POSITIVE
 *  0b1..NEGATIVE
 */
#define LCDIF_PANELCONFIG0_CLOCK_POLARITY(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_CLOCK_POLARITY_SHIFT)) & LCDIF_PANELCONFIG0_CLOCK_POLARITY_MASK)
#define LCDIF_PANELCONFIG0_POWER_MASK            (0x1000U)
#define LCDIF_PANELCONFIG0_POWER_SHIFT           (12U)
/*! POWER - Power enable/disable.
 */
#define LCDIF_PANELCONFIG0_POWER(x)              (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_POWER_SHIFT)) & LCDIF_PANELCONFIG0_POWER_MASK)
#define LCDIF_PANELCONFIG0_POWER_POLARITY_MASK   (0x2000U)
#define LCDIF_PANELCONFIG0_POWER_POLARITY_SHIFT  (13U)
/*! POWER_POLARITY - Power polarity.
 */
#define LCDIF_PANELCONFIG0_POWER_POLARITY(x)     (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_POWER_POLARITY_SHIFT)) & LCDIF_PANELCONFIG0_POWER_POLARITY_MASK)
#define LCDIF_PANELCONFIG0_BACKLIGHT_MASK        (0x10000U)
#define LCDIF_PANELCONFIG0_BACKLIGHT_SHIFT       (16U)
/*! BACKLIGHT - Backlight enabled/disbaled.
 */
#define LCDIF_PANELCONFIG0_BACKLIGHT(x)          (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_BACKLIGHT_SHIFT)) & LCDIF_PANELCONFIG0_BACKLIGHT_MASK)
#define LCDIF_PANELCONFIG0_BACKLIGHT_POLARITY_MASK (0x20000U)
#define LCDIF_PANELCONFIG0_BACKLIGHT_POLARITY_SHIFT (17U)
/*! BACKLIGHT_POLARITY - Backlight polarity.
 */
#define LCDIF_PANELCONFIG0_BACKLIGHT_POLARITY(x) (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_BACKLIGHT_POLARITY_SHIFT)) & LCDIF_PANELCONFIG0_BACKLIGHT_POLARITY_MASK)
#define LCDIF_PANELCONFIG0_SEQUENCING_MASK       (0x80000000U)
#define LCDIF_PANELCONFIG0_SEQUENCING_SHIFT      (31U)
/*! SEQUENCING - Enable software or hardware panel sequencing.
 *  0b0..HARDWARE
 *  0b1..SOFTWARE
 */
#define LCDIF_PANELCONFIG0_SEQUENCING(x)         (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELCONFIG0_SEQUENCING_SHIFT)) & LCDIF_PANELCONFIG0_SEQUENCING_MASK)
/*! @} */

