espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name PANELTIMING0 - Timing for hardware panel sequencing */
/*! @{ */
#define LCDIF_PANELTIMING0_POWER_ENABLE_MASK     (0xFU)
#define LCDIF_PANELTIMING0_POWER_ENABLE_SHIFT    (0U)
/*! POWER_ENABLE - Number of VSYNCsto wait after power has been enabled.
 */
#define LCDIF_PANELTIMING0_POWER_ENABLE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_POWER_ENABLE_SHIFT)) & LCDIF_PANELTIMING0_POWER_ENABLE_MASK)
#define LCDIF_PANELTIMING0_BACKLIGHT_ENABLE_MASK (0xF0U)
#define LCDIF_PANELTIMING0_BACKLIGHT_ENABLE_SHIFT (4U)
/*! BACKLIGHT_ENABLE - Number of VSYNCs to wait after backlight has been enabled.
 */
#define LCDIF_PANELTIMING0_BACKLIGHT_ENABLE(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_BACKLIGHT_ENABLE_SHIFT)) & LCDIF_PANELTIMING0_BACKLIGHT_ENABLE_MASK)
#define LCDIF_PANELTIMING0_CLOCK_ENABLE_MASK     (0xF00U)
#define LCDIF_PANELTIMING0_CLOCK_ENABLE_SHIFT    (8U)
/*! CLOCK_ENABLE - Number of VSYNCs to wait after clock has been enabled.
 */
#define LCDIF_PANELTIMING0_CLOCK_ENABLE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_CLOCK_ENABLE_SHIFT)) & LCDIF_PANELTIMING0_CLOCK_ENABLE_MASK)
#define LCDIF_PANELTIMING0_DATA_ENABLE_MASK      (0xF000U)
#define LCDIF_PANELTIMING0_DATA_ENABLE_SHIFT     (12U)
/*! DATA_ENABLE - Number of VSYNCs to wait after data has been enabled.
 */
#define LCDIF_PANELTIMING0_DATA_ENABLE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_DATA_ENABLE_SHIFT)) & LCDIF_PANELTIMING0_DATA_ENABLE_MASK)
#define LCDIF_PANELTIMING0_DATA_DISABLE_MASK     (0xF0000U)
#define LCDIF_PANELTIMING0_DATA_DISABLE_SHIFT    (16U)
/*! DATA_DISABLE - Number of VSYNCs to wait after data has been disabled.
 */
#define LCDIF_PANELTIMING0_DATA_DISABLE(x)       (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_DATA_DISABLE_SHIFT)) & LCDIF_PANELTIMING0_DATA_DISABLE_MASK)
#define LCDIF_PANELTIMING0_CLOCK_DISABLE_MASK    (0xF00000U)
#define LCDIF_PANELTIMING0_CLOCK_DISABLE_SHIFT   (20U)
/*! CLOCK_DISABLE - Number of VSYNCs to wait after clock has been disabled.
 */
#define LCDIF_PANELTIMING0_CLOCK_DISABLE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_CLOCK_DISABLE_SHIFT)) & LCDIF_PANELTIMING0_CLOCK_DISABLE_MASK)
#define LCDIF_PANELTIMING0_BACKLIGHT_DISABLE_MASK (0xF000000U)
#define LCDIF_PANELTIMING0_BACKLIGHT_DISABLE_SHIFT (24U)
/*! BACKLIGHT_DISABLE - Number of VSYNCs to wait after backlight has been disabled.
 */
#define LCDIF_PANELTIMING0_BACKLIGHT_DISABLE(x)  (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_BACKLIGHT_DISABLE_SHIFT)) & LCDIF_PANELTIMING0_BACKLIGHT_DISABLE_MASK)
#define LCDIF_PANELTIMING0_POWER_DISABLE_MASK    (0xF0000000U)
#define LCDIF_PANELTIMING0_POWER_DISABLE_SHIFT   (28U)
/*! POWER_DISABLE - Number of VSYNCs to wait after power has been disabled.
 */
#define LCDIF_PANELTIMING0_POWER_DISABLE(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_PANELTIMING0_POWER_DISABLE_SHIFT)) & LCDIF_PANELTIMING0_POWER_DISABLE_MASK)
/*! @} */

/*! @name HDISPLAY0 - Horizontal Total and Display End counters */
/*! @{ */
#define LCDIF_HDISPLAY0_DISPLAY_END_MASK         (0x1FFFU)
#define LCDIF_HDISPLAY0_DISPLAY_END_SHIFT        (0U)
/*! DISPLAY_END - Number of visible horizontal pixels.
 */
#define LCDIF_HDISPLAY0_DISPLAY_END(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_HDISPLAY0_DISPLAY_END_SHIFT)) & LCDIF_HDISPLAY0_DISPLAY_END_MASK)
#define LCDIF_HDISPLAY0_TOTAL_MASK               (0x1FFF0000U)
#define LCDIF_HDISPLAY0_TOTAL_SHIFT              (16U)
/*! TOTAL - Total number of horizontal pixels.
 */
#define LCDIF_HDISPLAY0_TOTAL(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIF_HDISPLAY0_TOTAL_SHIFT)) & LCDIF_HDISPLAY0_TOTAL_MASK)
/*! @} */

/*! @name HSYNC0 - Horizontal Sync counters */
/*! @{ */
#define LCDIF_HSYNC0_START_MASK                  (0x1FFFU)
#define LCDIF_HSYNC0_START_SHIFT                 (0U)
/*! START - Start of horizontal sync pulse.
 */
#define LCDIF_HSYNC0_START(x)                    (((uint32_t)(((uint32_t)(x)) << LCDIF_HSYNC0_START_SHIFT)) & LCDIF_HSYNC0_START_MASK)
#define LCDIF_HSYNC0_END_MASK                    (0x1FFF0000U)
#define LCDIF_HSYNC0_END_SHIFT                   (16U)
/*! END - End of horizontal sync pulse.
 */
#define LCDIF_HSYNC0_END(x)                      (((uint32_t)(((uint32_t)(x)) << LCDIF_HSYNC0_END_SHIFT)) & LCDIF_HSYNC0_END_MASK)
#define LCDIF_HSYNC0_PULSE_MASK                  (0x40000000U)
#define LCDIF_HSYNC0_PULSE_SHIFT                 (30U)
/*! PULSE - Horizontal sync pulse control.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_HSYNC0_PULSE(x)                    (((uint32_t)(((uint32_t)(x)) << LCDIF_HSYNC0_PULSE_SHIFT)) & LCDIF_HSYNC0_PULSE_MASK)
#define LCDIF_HSYNC0_POLARITY_MASK               (0x80000000U)
#define LCDIF_HSYNC0_POLARITY_SHIFT              (31U)
/*! POLARITY - Polarity of the horizontal sync pulse
 *  0b0..POSITIVE
 *  0b1..NEGATIVE
 */
#define LCDIF_HSYNC0_POLARITY(x)                 (((uint32_t)(((uint32_t)(x)) << LCDIF_HSYNC0_POLARITY_SHIFT)) & LCDIF_HSYNC0_POLARITY_MASK)
/*! @} */

/*! @name HCOUNTER10 - Horizontal Programmable Counter 1 */
/*! @{ */
#define LCDIF_HCOUNTER10_START_MASK              (0xFFFU)
#define LCDIF_HCOUNTER10_START_SHIFT             (0U)
/*! START - Start of horizontal counter 1.
 */
#define LCDIF_HCOUNTER10_START(x)                (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER10_START_SHIFT)) & LCDIF_HCOUNTER10_START_MASK)
#define LCDIF_HCOUNTER10_END_MASK                (0xFFF0000U)
#define LCDIF_HCOUNTER10_END_SHIFT               (16U)
/*! END - End of horizontal counter 1.
 */
#define LCDIF_HCOUNTER10_END(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER10_END_SHIFT)) & LCDIF_HCOUNTER10_END_MASK)
#define LCDIF_HCOUNTER10_PULSE_MASK              (0x40000000U)
#define LCDIF_HCOUNTER10_PULSE_SHIFT             (30U)
/*! PULSE - Horizontal counter 1 control.
 *  0b0..DISABLED
 *  0b1..ENABLED
 */
#define LCDIF_HCOUNTER10_PULSE(x)                (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER10_PULSE_SHIFT)) & LCDIF_HCOUNTER10_PULSE_MASK)
#define LCDIF_HCOUNTER10_POLARITY_MASK           (0x80000000U)
#define LCDIF_HCOUNTER10_POLARITY_SHIFT          (31U)
/*! POLARITY - Polarity of the pulse.
 *  0b0..POSITIVE
 *  0b1..ACTIVE-LOW
 */
#define LCDIF_HCOUNTER10_POLARITY(x)             (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER10_POLARITY_SHIFT)) & LCDIF_HCOUNTER10_POLARITY_MASK)
/*! @} */

/*! @name HCOUNTER20 - Horizontal Programmable Counter 2 */
/*! @{ */
#define LCDIF_HCOUNTER20_END_MASK                (0xFFF0000U)
#define LCDIF_HCOUNTER20_END_SHIFT               (16U)
/*! END - End of horizontal counter 2.
 */
#define LCDIF_HCOUNTER20_END(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER20_END_SHIFT)) & LCDIF_HCOUNTER20_END_MASK)
#define LCDIF_HCOUNTER20_PULSE_MASK              (0x40000000U)
#define LCDIF_HCOUNTER20_PULSE_SHIFT             (30U)
/*! PULSE - Horizontal counter 2 control.
 */
#define LCDIF_HCOUNTER20_PULSE(x)                (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER20_PULSE_SHIFT)) & LCDIF_HCOUNTER20_PULSE_MASK)
#define LCDIF_HCOUNTER20_POLARITY_MASK           (0x80000000U)
#define LCDIF_HCOUNTER20_POLARITY_SHIFT          (31U)
/*! POLARITY - Polarity of the pulse.
 */
#define LCDIF_HCOUNTER20_POLARITY(x)             (((uint32_t)(((uint32_t)(x)) << LCDIF_HCOUNTER20_POLARITY_SHIFT)) & LCDIF_HCOUNTER20_POLARITY_MASK)
/*! @} */

