espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name DBITYPECCFG0 - DBI Type C write timing definition. */
/*! @{ */
#define LCDIF_DBITYPECCFG0_TAS_MASK              (0xFU)
#define LCDIF_DBITYPECCFG0_TAS_SHIFT             (0U)
/*! TAS - Divide counter for Tas (address setup time).
 */
#define LCDIF_DBITYPECCFG0_TAS(x)                (((uint32_t)(((uint32_t)(x)) << LCDIF_DBITYPECCFG0_TAS_SHIFT)) & LCDIF_DBITYPECCFG0_TAS_MASK)
#define LCDIF_DBITYPECCFG0_SCL_TWRL_MASK         (0xFF0U)
#define LCDIF_DBITYPECCFG0_SCL_TWRL_SHIFT        (4U)
/*! SCL_TWRL - Divide counter for Twrl (SCL L duration (write)).
 */
#define LCDIF_DBITYPECCFG0_SCL_TWRL(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_DBITYPECCFG0_SCL_TWRL_SHIFT)) & LCDIF_DBITYPECCFG0_SCL_TWRL_MASK)
#define LCDIF_DBITYPECCFG0_SCL_TWRH_MASK         (0xFF000U)
#define LCDIF_DBITYPECCFG0_SCL_TWRH_SHIFT        (12U)
/*! SCL_TWRH - Divide counter for Twrl (SCL H duration (write)).
 */
#define LCDIF_DBITYPECCFG0_SCL_TWRH(x)           (((uint32_t)(((uint32_t)(x)) << LCDIF_DBITYPECCFG0_SCL_TWRH_SHIFT)) & LCDIF_DBITYPECCFG0_SCL_TWRH_MASK)
#define LCDIF_DBITYPECCFG0_SCL_SEL_MASK          (0x100000U)
#define LCDIF_DBITYPECCFG0_SCL_SEL_SHIFT         (20U)
/*! SCL_SEL - Determine the source of output Scl.
 */
#define LCDIF_DBITYPECCFG0_SCL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << LCDIF_DBITYPECCFG0_SCL_SEL_SHIFT)) & LCDIF_DBITYPECCFG0_SCL_SEL_MASK)
/*! @} */

/*! @name DCSTATUS0 -  */
/*! @{ */
#define LCDIF_DCSTATUS0_DBI_TYPEC_FIFO_FULL_MASK (0x1U)
#define LCDIF_DCSTATUS0_DBI_TYPEC_FIFO_FULL_SHIFT (0U)
/*! DBI_TYPEC_FIFO_FULL - DBI Type C afifo full.
 */
#define LCDIF_DCSTATUS0_DBI_TYPEC_FIFO_FULL(x)   (((uint32_t)(((uint32_t)(x)) << LCDIF_DCSTATUS0_DBI_TYPEC_FIFO_FULL_SHIFT)) & LCDIF_DCSTATUS0_DBI_TYPEC_FIFO_FULL_MASK)
/*! @} */

/*! @name DEBUGCOUNTERSELECT0 -  */
/*! @{ */
#define LCDIF_DEBUGCOUNTERSELECT0_SELECT_MASK    (0xFFU)
#define LCDIF_DEBUGCOUNTERSELECT0_SELECT_SHIFT   (0U)
/*! SELECT - Write a value to this field to pick up from 0~255 counters.
 */
#define LCDIF_DEBUGCOUNTERSELECT0_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << LCDIF_DEBUGCOUNTERSELECT0_SELECT_SHIFT)) & LCDIF_DEBUGCOUNTERSELECT0_SELECT_MASK)
/*! @} */

/*! @name DEBUGCOUNTERVALUE0 - Debug Counter Value as specified in DebugCounterSelect */
/*! @{ */
#define LCDIF_DEBUGCOUNTERVALUE0_VALUE_MASK      (0xFFFFFFFFU)
#define LCDIF_DEBUGCOUNTERVALUE0_VALUE_SHIFT     (0U)
/*! VALUE - Selected debug counter value
 */
#define LCDIF_DEBUGCOUNTERVALUE0_VALUE(x)        (((uint32_t)(((uint32_t)(x)) << LCDIF_DEBUGCOUNTERVALUE0_VALUE_SHIFT)) & LCDIF_DEBUGCOUNTERVALUE0_VALUE_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group LCDIF_Register_Masks */


/* LCDIF - Peripheral instance base addresses */
/** Peripheral LCDIF base address */
#define LCDIF_BASE                               (0x40210000u)
/** Peripheral LCDIF base pointer */
#define LCDIF                                    ((LCDIF_Type *)LCDIF_BASE)
/** Array initializer of LCDIF peripheral base addresses */
#define LCDIF_BASE_ADDRS                         { LCDIF_BASE }
/** Array initializer of LCDIF peripheral base pointers */
#define LCDIF_BASE_PTRS                          { LCDIF }

/*!
 * @}
 */ /* end of group LCDIF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MIPI_DSI_HOST Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MIPI_DSI_HOST_Peripheral_Access_Layer MIPI_DSI_HOST Peripheral Access Layer
 * @{
 */

/** MIPI_DSI_HOST - Register Layout Typedef */
typedef struct {
  __IO uint32_t DSI_HOST_CFG_NUM_LANES;            /**< , offset: 0x0 */
  __IO uint32_t DSI_HOST_CFG_NONCONTINUOUS_CLK;    /**< , offset: 0x4 */
  __IO uint32_t DSI_HOST_CFG_T_PRE;                /**< , offset: 0x8 */
  __IO uint32_t DSI_HOST_CFG_T_POST;               /**< , offset: 0xC */
  __IO uint32_t DSI_HOST_CFG_TX_GAP;               /**< , offset: 0x10 */
  __IO uint32_t DSI_HOST_CFG_AUTOINSERT_EOTP;      /**< , offset: 0x14 */
  __IO uint32_t DSI_HOST_CFG_EXTRA_CMDS_AFTER_EOTP; /**< , offset: 0x18 */
  __IO uint32_t DSI_HOST_CFG_HTX_TO_COUNT;         /**< , offset: 0x1C */
  __IO uint32_t DSI_HOST_CFG_LRX_H_TO_COUNT;       /**< , offset: 0x20 */
  __IO uint32_t DSI_HOST_CFG_BTA_H_TO_COUNT;       /**< , offset: 0x24 */
  __IO uint32_t DSI_HOST_CFG_TWAKEUP;              /**< , offset: 0x28 */
  __I  uint32_t DSI_HOST_CFG_STATUS_OUT;           /**< , offset: 0x2C */
  __I  uint32_t DSI_HOST_RX_ERROR_STATUS;          /**< , offset: 0x30 */
       uint8_t RESERVED_0[204];
  __IO uint32_t DSI_HOST_CFG_DBI_PIXEL_PAYLOAD_SIZE; /**< , offset: 0x100 */
  __IO uint32_t DSI_HOST_CFG_DBI_PIXEL_FIFO_SEND_LEVEL; /**< , offset: 0x104 */
       uint8_t RESERVED_1[248];
  __IO uint32_t DSI_HOST_CFG_DPI_PIXEL_PAYLOAD_SIZE; /**< , offset: 0x200 */
  __IO uint32_t DSI_HOST_CFG_DPI_PIXEL_FIFO_SEND_LEVEL; /**< , offset: 0x204 */
  __IO uint32_t DSI_HOST_CFG_DPI_INTERFACE_COLOR_CODING; /**< , offset: 0x208 */
  __IO uint32_t DSI_HOST_CFG_DPI_PIXEL_FORMAT;     /**< , offset: 0x20C */
  __IO uint32_t DSI_HOST_CFG_DPI_VSYNC_POLARITY;   /**< , offset: 0x210 */
  __IO uint32_t DSI_HOST_CFG_DPI_HSYNC_POLARITY;   /**< , offset: 0x214 */
  __IO uint32_t DSI_HOST_CFG_DPI_VIDEO_MODE;       /**< , offset: 0x218 */
  __IO uint32_t DSI_HOST_CFG_DPI_HFP;              /**< , offset: 0x21C */
  __IO uint32_t DSI_HOST_CFG_DPI_HBP;              /**< , offset: 0x220 */
  __IO uint32_t DSI_HOST_CFG_DPI_HSA;              /**< , offset: 0x224 */
  __IO uint32_t DSI_HOST_CFG_DPI_ENABLE_MULT_PKTS; /**< , offset: 0x228 */
  __IO uint32_t DSI_HOST_CFG_DPI_VBP;              /**< , offset: 0x22C */
  __IO uint32_t DSI_HOST_CFG_DPI_VFP;              /**< , offset: 0x230 */
  __IO uint32_t DSI_HOST_CFG_DPI_BLLP_MODE;        /**< , offset: 0x234 */
  __IO uint32_t DSI_HOST_CFG_DPI_USE_NULL_PKT_BLLP; /**< , offset: 0x238 */
  __IO uint32_t DSI_HOST_CFG_DPI_VACTIVE;          /**< , offset: 0x23C */
  __IO uint32_t DSI_HOST_CFG_DPI_VC;               /**< , offset: 0x240 */
       uint8_t RESERVED_2[60];
  __IO uint32_t DSI_HOST_TX_PAYLOAD;               /**< , offset: 0x280 */
  __IO uint32_t DSI_HOST_PKT_CONTROL;              /**< , offset: 0x284 */
  __IO uint32_t DSI_HOST_SEND_PACKET;              /**< , offset: 0x288 */
  __I  uint32_t DSI_HOST_PKT_STATUS;               /**< , offset: 0x28C */
  __I  uint32_t DSI_HOST_PKT_FIFO_WR_LEVEL;        /**< , offset: 0x290 */
  __I  uint32_t DSI_HOST_PKT_FIFO_RD_LEVEL;        /**< , offset: 0x294 */
  __I  uint32_t DSI_HOST_PKT_RX_PAYLOAD;           /**< , offset: 0x298 */
  __I  uint32_t DSI_HOST_PKT_RX_PKT_HEADER;        /**< , offset: 0x29C */
  __I  uint32_t DSI_HOST_IRQ_STATUS;               /**< , offset: 0x2A0 */
  __I  uint32_t DSI_HOST_IRQ_STATUS2;              /**< , offset: 0x2A4 */
  __IO uint32_t DSI_HOST_IRQ_MASK;                 /**< , offset: 0x2A8 */
  __IO uint32_t DSI_HOST_IRQ_MASK2;                /**< , offset: 0x2AC */
       uint8_t RESERVED_3[80];
  __IO uint32_t DPHY_PD_DPHY;                      /**< , offset: 0x300 */
  __IO uint32_t DPHY_M_PRG_HS_PREPARE;             /**< , offset: 0x304 */
  __IO uint32_t DPHY_MC_PRG_HS_PREPARE;            /**< , offset: 0x308 */
  __IO uint32_t DPHY_M_PRG_HS_ZERO;                /**< , offset: 0x30C */
  __IO uint32_t DPHY_MC_PRG_HS_ZERO;               /**< , offset: 0x310 */
  __IO uint32_t DPHY_M_PRG_HS_TRAIL;               /**< , offset: 0x314 */
  __IO uint32_t DPHY_MC_PRG_HS_TRAIL;              /**< , offset: 0x318 */
  __IO uint32_t DPHY_TST;                          /**< , offset: 0x31C */
  __IO uint32_t DPHY_RTERM_SEL;                    /**< , offset: 0x320 */
  __IO uint32_t DPHY_AUTO_PD_EN;                   /**< , offset: 0x324 */
  __IO uint32_t DPHY_RXLPRP;                       /**< , offset: 0x328 */
  __IO uint32_t DPHY_RXCDRP;                       /**< , offset: 0x32C */
} MIPI_DSI_HOST_Type;

/* ----------------------------------------------------------------------------
   -- MIPI_DSI_HOST Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MIPI_DSI_HOST_Register_Masks MIPI_DSI_HOST Register Masks
 * @{
 */

