espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name BOOTROM_LCKOUT - BOOT ROM lockout */
/*! @{ */
#define SYSCTL0_BOOTROM_LCKOUT_READ_LCKOUT_SPACE_MASK (0x1FFFFU)
#define SYSCTL0_BOOTROM_LCKOUT_READ_LCKOUT_SPACE_SHIFT (0U)
/*! READ_LCKOUT_SPACE - Read Lockout
 */
#define SYSCTL0_BOOTROM_LCKOUT_READ_LCKOUT_SPACE(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_BOOTROM_LCKOUT_READ_LCKOUT_SPACE_SHIFT)) & SYSCTL0_BOOTROM_LCKOUT_READ_LCKOUT_SPACE_MASK)
#define SYSCTL0_BOOTROM_LCKOUT_WRITE_LOCK_MASK   (0xC0000000U)
#define SYSCTL0_BOOTROM_LCKOUT_WRITE_LOCK_SHIFT  (30U)
/*! WRITE_LOCK - Self Write Disable
 *  0b00..Write disable
 *  0b01..Write disable
 *  0b11..Write disable
 *  0b10..Write enable
 */
#define SYSCTL0_BOOTROM_LCKOUT_WRITE_LOCK(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_BOOTROM_LCKOUT_WRITE_LOCK_SHIFT)) & SYSCTL0_BOOTROM_LCKOUT_WRITE_LOCK_MASK)
/*! @} */

/*! @name M33NMISRCSEL - M33 NMI source selection */
/*! @{ */
#define SYSCTL0_M33NMISRCSEL_NMISRCSEL_MASK      (0x7FU)
#define SYSCTL0_M33NMISRCSEL_NMISRCSEL_SHIFT     (0U)
/*! NMISRCSEL - Selects one of the M33 interrupt sources as the NMI source interrupt.
 */
#define SYSCTL0_M33NMISRCSEL_NMISRCSEL(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL0_M33NMISRCSEL_NMISRCSEL_SHIFT)) & SYSCTL0_M33NMISRCSEL_NMISRCSEL_MASK)
#define SYSCTL0_M33NMISRCSEL_NMI_Enable_MASK     (0x80000000U)
#define SYSCTL0_M33NMISRCSEL_NMI_Enable_SHIFT    (31U)
/*! NMI_Enable
 *  0b0..Disable NMI interrupt
 *  0b1..Enable NMI interrupt
 */
#define SYSCTL0_M33NMISRCSEL_NMI_Enable(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_M33NMISRCSEL_NMI_Enable_SHIFT)) & SYSCTL0_M33NMISRCSEL_NMI_Enable_MASK)
/*! @} */

/*! @name SYSTEM_STICK_CALIB - System secure tick calibration */
/*! @{ */
#define SYSCTL0_SYSTEM_STICK_CALIB_SYSTEM_STICK_CALIB_MASK (0x7FFFFFFU)
#define SYSCTL0_SYSTEM_STICK_CALIB_SYSTEM_STICK_CALIB_SHIFT (0U)
/*! SYSTEM_STICK_CALIB - M33 secure tick calibration
 */
#define SYSCTL0_SYSTEM_STICK_CALIB_SYSTEM_STICK_CALIB(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SYSTEM_STICK_CALIB_SYSTEM_STICK_CALIB_SHIFT)) & SYSCTL0_SYSTEM_STICK_CALIB_SYSTEM_STICK_CALIB_MASK)
/*! @} */

/*! @name SYSTEM_NSTICK_CALIB - System non-secure tick calibration */
/*! @{ */
#define SYSCTL0_SYSTEM_NSTICK_CALIB_SYSTEM_NSTICK_CALIB_MASK (0x7FFFFFFU)
#define SYSCTL0_SYSTEM_NSTICK_CALIB_SYSTEM_NSTICK_CALIB_SHIFT (0U)
/*! SYSTEM_NSTICK_CALIB - M33 non secure tick calibration
 */
#define SYSCTL0_SYSTEM_NSTICK_CALIB_SYSTEM_NSTICK_CALIB(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SYSTEM_NSTICK_CALIB_SYSTEM_NSTICK_CALIB_SHIFT)) & SYSCTL0_SYSTEM_NSTICK_CALIB_SYSTEM_NSTICK_CALIB_MASK)
/*! @} */

/*! @name CONFIG_LCKOUT - System Configuration Lock-Out */
/*! @{ */
#define SYSCTL0_CONFIG_LCKOUT_LCKOUT_MASK        (0x1U)
#define SYSCTL0_CONFIG_LCKOUT_LCKOUT_SHIFT       (0U)
/*! LCKOUT - Configuration Lock-Out
 *  0b0..Enable Write to Configuration Registers
 *  0b1..Disable Write to Configuration Registers
 */
#define SYSCTL0_CONFIG_LCKOUT_LCKOUT(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_CONFIG_LCKOUT_LCKOUT_SHIFT)) & SYSCTL0_CONFIG_LCKOUT_LCKOUT_MASK)
/*! @} */

/*! @name SRAMCFGENABLE0 - System SRAM Configuration Enable */
/*! @{ */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF0_MASK     (0x1U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF0_SHIFT    (0U)
/*! SRAM_IF0 - SRAM_IF0 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF0(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF0_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF0_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF1_MASK     (0x2U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF1_SHIFT    (1U)
/*! SRAM_IF1 - SRAM_IF1 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF1(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF1_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF1_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF2_MASK     (0x4U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF2_SHIFT    (2U)
/*! SRAM_IF2 - SRAM_IF2 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF2(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF2_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF2_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF3_MASK     (0x8U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF3_SHIFT    (3U)
/*! SRAM_IF3 - SRAM_IF3 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF3(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF3_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF3_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF4_MASK     (0x10U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF4_SHIFT    (4U)
/*! SRAM_IF4 - SRAM_IF4 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF4(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF4_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF4_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF5_MASK     (0x20U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF5_SHIFT    (5U)
/*! SRAM_IF5 - SRAM_IF5 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF5(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF5_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF5_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF6_MASK     (0x40U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF6_SHIFT    (6U)
/*! SRAM_IF6 - SRAM_IF6 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF6(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF6_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF6_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF7_MASK     (0x80U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF7_SHIFT    (7U)
/*! SRAM_IF7 - SRAM_IF7 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF7(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF7_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF7_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF8_MASK     (0x100U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF8_SHIFT    (8U)
/*! SRAM_IF8 - SRAM_IF8 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF8(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF8_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF8_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF9_MASK     (0x200U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF9_SHIFT    (9U)
/*! SRAM_IF9 - SRAM_IF9 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF9(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF9_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF9_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF10_MASK    (0x400U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF10_SHIFT   (10U)
/*! SRAM_IF10 - SRAM_IF10 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF10(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF10_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF10_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF11_MASK    (0x800U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF11_SHIFT   (11U)
/*! SRAM_IF11 - SRAM_IF11 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF11(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF11_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF11_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF12_MASK    (0x1000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF12_SHIFT   (12U)
/*! SRAM_IF12 - SRAM_IF12 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF12(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF12_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF12_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF13_MASK    (0x2000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF13_SHIFT   (13U)
/*! SRAM_IF13 - SRAM_IF13 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF13(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF13_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF13_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF14_MASK    (0x4000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF14_SHIFT   (14U)
/*! SRAM_IF14 - SRAM_IF14 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF14(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF14_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF14_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF15_MASK    (0x8000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF15_SHIFT   (15U)
/*! SRAM_IF15 - SRAM_IF15 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF15(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF15_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF15_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF16_MASK    (0x10000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF16_SHIFT   (16U)
/*! SRAM_IF16 - SRAM_IF16 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF16(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF16_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF16_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF17_MASK    (0x20000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF17_SHIFT   (17U)
/*! SRAM_IF17 - SRAM_IF17 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF17(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF17_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF17_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF18_MASK    (0x40000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF18_SHIFT   (18U)
/*! SRAM_IF18 - SRAM_IF18 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF18(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF18_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF18_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF19_MASK    (0x80000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF19_SHIFT   (19U)
/*! SRAM_IF19 - SRAM_IF19 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF19(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF19_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF19_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF20_MASK    (0x100000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF20_SHIFT   (20U)
/*! SRAM_IF20 - SRAM_IF20 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF20(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF20_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF20_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF21_MASK    (0x200000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF21_SHIFT   (21U)
/*! SRAM_IF21 - SRAM_IF21 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF21(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF21_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF21_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF22_MASK    (0x400000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF22_SHIFT   (22U)
/*! SRAM_IF22 - SRAM_IF22 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF22(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF22_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF22_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF23_MASK    (0x800000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF23_SHIFT   (23U)
/*! SRAM_IF23 - SRAM_IF23 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF23(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF23_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF23_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF24_MASK    (0x1000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF24_SHIFT   (24U)
/*! SRAM_IF24 - SRAM_IF24 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF24(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF24_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF24_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF25_MASK    (0x2000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF25_SHIFT   (25U)
/*! SRAM_IF25 - SRAM_IF25 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF25(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF25_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF25_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF26_MASK    (0x4000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF26_SHIFT   (26U)
/*! SRAM_IF26 - SRAM_IF26 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF26(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF26_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF26_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF27_MASK    (0x8000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF27_SHIFT   (27U)
/*! SRAM_IF27 - SRAM_IF27 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF27(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF27_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF27_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF28_MASK    (0x10000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF28_SHIFT   (28U)
/*! SRAM_IF28 - SRAM_IF28 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF28(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF28_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF28_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF29_MASK    (0x20000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF29_SHIFT   (29U)
/*! SRAM_IF29 - SRAM_IF29 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF29(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF29_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF29_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF30_MASK    (0x40000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF30_SHIFT   (30U)
/*! SRAM_IF30 - SRAM_IF30 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF30(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF30_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF30_MASK)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF31_MASK    (0x80000000U)
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF31_SHIFT   (31U)
/*! SRAM_IF31 - SRAM_IF31 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE0_SRAM_IF31(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE0_SRAM_IF31_SHIFT)) & SYSCTL0_SRAMCFGENABLE0_SRAM_IF31_MASK)
/*! @} */

