espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name SRAMCFGENABLE1 - System SRAM Configuration Enable */
/*! @{ */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF0_MASK     (0x1U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF0_SHIFT    (0U)
/*! SRAM_IF0 - SRAM_IF0 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF0(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF0_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF0_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF1_MASK     (0x2U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF1_SHIFT    (1U)
/*! SRAM_IF1 - SRAM_IF1 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF1(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF1_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF1_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF2_MASK     (0x4U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF2_SHIFT    (2U)
/*! SRAM_IF2 - SRAM_IF2 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF2(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF2_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF2_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF3_MASK     (0x8U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF3_SHIFT    (3U)
/*! SRAM_IF3 - SRAM_IF3 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF3(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF3_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF3_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF4_MASK     (0x10U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF4_SHIFT    (4U)
/*! SRAM_IF4 - SRAM_IF4 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF4(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF4_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF4_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF5_MASK     (0x20U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF5_SHIFT    (5U)
/*! SRAM_IF5 - SRAM_IF5 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF5(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF5_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF5_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF6_MASK     (0x40U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF6_SHIFT    (6U)
/*! SRAM_IF6 - SRAM_IF6 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF6(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF6_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF6_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF7_MASK     (0x80U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF7_SHIFT    (7U)
/*! SRAM_IF7 - SRAM_IF7 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF7(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF7_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF7_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF8_MASK     (0x100U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF8_SHIFT    (8U)
/*! SRAM_IF8 - SRAM_IF8 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF8(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF8_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF8_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF9_MASK     (0x200U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF9_SHIFT    (9U)
/*! SRAM_IF9 - SRAM_IF9 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF9(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF9_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF9_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF10_MASK    (0x400U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF10_SHIFT   (10U)
/*! SRAM_IF10 - SRAM_IF10 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF10(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF10_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF10_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF11_MASK    (0x800U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF11_SHIFT   (11U)
/*! SRAM_IF11 - SRAM_IF11 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF11(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF11_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF11_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF12_MASK    (0x1000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF12_SHIFT   (12U)
/*! SRAM_IF12 - SRAM_IF12 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF12(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF12_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF12_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF13_MASK    (0x2000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF13_SHIFT   (13U)
/*! SRAM_IF13 - SRAM_IF13 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF13(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF13_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF13_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF14_MASK    (0x4000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF14_SHIFT   (14U)
/*! SRAM_IF14 - SRAM_IF14 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF14(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF14_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF14_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF15_MASK    (0x8000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF15_SHIFT   (15U)
/*! SRAM_IF15 - SRAM_IF15 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF15(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF15_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF15_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF16_MASK    (0x10000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF16_SHIFT   (16U)
/*! SRAM_IF16 - SRAM_IF16 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF16(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF16_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF16_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF17_MASK    (0x20000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF17_SHIFT   (17U)
/*! SRAM_IF17 - SRAM_IF17 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF17(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF17_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF17_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF18_MASK    (0x40000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF18_SHIFT   (18U)
/*! SRAM_IF18 - SRAM_IF18 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF18(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF18_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF18_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF19_MASK    (0x80000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF19_SHIFT   (19U)
/*! SRAM_IF19 - SRAM_IF19 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF19(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF19_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF19_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF20_MASK    (0x100000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF20_SHIFT   (20U)
/*! SRAM_IF20 - SRAM_IF20 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF20(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF20_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF20_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF21_MASK    (0x200000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF21_SHIFT   (21U)
/*! SRAM_IF21 - SRAM_IF21 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF21(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF21_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF21_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF22_MASK    (0x400000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF22_SHIFT   (22U)
/*! SRAM_IF22 - SRAM_IF22 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF22(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF22_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF22_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF23_MASK    (0x800000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF23_SHIFT   (23U)
/*! SRAM_IF23 - SRAM_IF23 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF23(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF23_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF23_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF24_MASK    (0x1000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF24_SHIFT   (24U)
/*! SRAM_IF24 - SRAM_IF24 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF24(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF24_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF24_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF25_MASK    (0x2000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF25_SHIFT   (25U)
/*! SRAM_IF25 - SRAM_IF25 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF25(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF25_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF25_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF26_MASK    (0x4000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF26_SHIFT   (26U)
/*! SRAM_IF26 - SRAM_IF26 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF26(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF26_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF26_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF27_MASK    (0x8000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF27_SHIFT   (27U)
/*! SRAM_IF27 - SRAM_IF27 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF27(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF27_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF27_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF28_MASK    (0x10000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF28_SHIFT   (28U)
/*! SRAM_IF28 - SRAM_IF28 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF28(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF28_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF28_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF29_MASK    (0x20000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF29_SHIFT   (29U)
/*! SRAM_IF29 - SRAM_IF29 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF29(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF29_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF29_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF30_MASK    (0x40000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF30_SHIFT   (30U)
/*! SRAM_IF30 - SRAM_IF30 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF30(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF30_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF30_MASK)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF31_MASK    (0x80000000U)
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF31_SHIFT   (31U)
/*! SRAM_IF31 - SRAM_IF31 buffering
 *  0b0..Disable SRAM
 *  0b1..Enable SRAM
 */
#define SYSCTL0_SRAMCFGENABLE1_SRAM_IF31(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SRAMCFGENABLE1_SRAM_IF31_SHIFT)) & SYSCTL0_SRAMCFGENABLE1_SRAM_IF31_MASK)
/*! @} */

/*! @name SOFTPARTCFG - Software configuration */
/*! @{ */
#define SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_MASK (0xFU)
#define SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_SHIFT (0U)
/*! SECURITY_ENABLED - Security Enabled
 *  0b0000..Illegal. Part will be locked.
 *  0b0101..Security is disabled.
 *  0b1010..Security is enabled. (Reset value)
 *  0b1111..Illegal. Part will be locked.
 */
#define SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED(x)  (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_SHIFT)) & SYSCTL0_SOFTPARTCFG_SECURITY_ENABLED_MASK)
#define SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_MASK (0xF0U)
#define SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_SHIFT (4U)
/*! TRUSTZONE_ENABLED - Security Enabled
 *  0b0000..Illegal. Part will be locked.
 *  0b0101..Security is disabled.
 *  0b1010..Security is enabled. (Reset value)
 *  0b1111..Illegal. Part will be locked.
 */
#define SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_SHIFT)) & SYSCTL0_SOFTPARTCFG_TRUSTZONE_ENABLED_MASK)
#define SYSCTL0_SOFTPARTCFG_CLOUSTON_MASK        (0xFFFFFF00U)
#define SYSCTL0_SOFTPARTCFG_CLOUSTON_SHIFT       (8U)
/*! CLOUSTON - 24-Bit R/W Field
 */
#define SYSCTL0_SOFTPARTCFG_CLOUSTON(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_SOFTPARTCFG_CLOUSTON_SHIFT)) & SYSCTL0_SOFTPARTCFG_CLOUSTON_MASK)
/*! @} */

/*! @name PERICFGENABLE0 - PERICFG Enable 0 */
/*! @{ */
#define SYSCTL0_PERICFGENABLE0_DSP_MASK          (0x2U)
#define SYSCTL0_PERICFGENABLE0_DSP_SHIFT         (1U)
/*! DSP - DSP
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_DSP(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_DSP_SHIFT)) & SYSCTL0_PERICFGENABLE0_DSP_MASK)
#define SYSCTL0_PERICFGENABLE0_AXI_SWITCH_MASK   (0x8U)
#define SYSCTL0_PERICFGENABLE0_AXI_SWITCH_SHIFT  (3U)
/*! AXI_SWITCH - AXI_SWITCH
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_AXI_SWITCH(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_AXI_SWITCH_SHIFT)) & SYSCTL0_PERICFGENABLE0_AXI_SWITCH_MASK)
#define SYSCTL0_PERICFGENABLE0_AXI_CONTROLLER_REGISTERS_MASK (0x10U)
#define SYSCTL0_PERICFGENABLE0_AXI_CONTROLLER_REGISTERS_SHIFT (4U)
/*! AXI_CONTROLLER_REGISTERS - AXI_CONTROLLER_REGISTERS
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_AXI_CONTROLLER_REGISTERS(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_AXI_CONTROLLER_REGISTERS_SHIFT)) & SYSCTL0_PERICFGENABLE0_AXI_CONTROLLER_REGISTERS_MASK)
#define SYSCTL0_PERICFGENABLE0_POWERQUAD_MASK    (0x100U)
#define SYSCTL0_PERICFGENABLE0_POWERQUAD_SHIFT   (8U)
/*! POWERQUAD - POWERQUAD
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_POWERQUAD(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_POWERQUAD_SHIFT)) & SYSCTL0_PERICFGENABLE0_POWERQUAD_MASK)
#define SYSCTL0_PERICFGENABLE0_CASPER_MASK       (0x200U)
#define SYSCTL0_PERICFGENABLE0_CASPER_SHIFT      (9U)
/*! CASPER - CASPER
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_CASPER(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_CASPER_SHIFT)) & SYSCTL0_PERICFGENABLE0_CASPER_MASK)
#define SYSCTL0_PERICFGENABLE0_HASHCRYPT_MASK    (0x400U)
#define SYSCTL0_PERICFGENABLE0_HASHCRYPT_SHIFT   (10U)
/*! HASHCRYPT - HASHCRYPT
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_HASHCRYPT(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_HASHCRYPT_SHIFT)) & SYSCTL0_PERICFGENABLE0_HASHCRYPT_MASK)
#define SYSCTL0_PERICFGENABLE0_PUF_MASK          (0x800U)
#define SYSCTL0_PERICFGENABLE0_PUF_SHIFT         (11U)
/*! PUF - PUF
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_PUF(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_PUF_SHIFT)) & SYSCTL0_PERICFGENABLE0_PUF_MASK)
#define SYSCTL0_PERICFGENABLE0_RNG_MASK          (0x1000U)
#define SYSCTL0_PERICFGENABLE0_RNG_SHIFT         (12U)
/*! RNG - RNG
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_RNG(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_RNG_SHIFT)) & SYSCTL0_PERICFGENABLE0_RNG_MASK)
#define SYSCTL0_PERICFGENABLE0_OTFAD_MASK        (0x8000U)
#define SYSCTL0_PERICFGENABLE0_OTFAD_SHIFT       (15U)
/*! OTFAD - OTFAD
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_OTFAD(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_OTFAD_SHIFT)) & SYSCTL0_PERICFGENABLE0_OTFAD_MASK)
#define SYSCTL0_PERICFGENABLE0_FLEXSPI0_OTFAD_MASK (0x10000U)
#define SYSCTL0_PERICFGENABLE0_FLEXSPI0_OTFAD_SHIFT (16U)
/*! FLEXSPI0_OTFAD - FLEXSPI0_OTFAD
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_FLEXSPI0_OTFAD(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_FLEXSPI0_OTFAD_SHIFT)) & SYSCTL0_PERICFGENABLE0_FLEXSPI0_OTFAD_MASK)
#define SYSCTL0_PERICFGENABLE0_OTP_CONTROLLER_MASK (0x20000U)
#define SYSCTL0_PERICFGENABLE0_OTP_CONTROLLER_SHIFT (17U)
/*! OTP_CONTROLLER - OTP_CONTROLLER
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_OTP_CONTROLLER(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_OTP_CONTROLLER_SHIFT)) & SYSCTL0_PERICFGENABLE0_OTP_CONTROLLER_MASK)
#define SYSCTL0_PERICFGENABLE0_FLEXSPI1_MASK     (0x40000U)
#define SYSCTL0_PERICFGENABLE0_FLEXSPI1_SHIFT    (18U)
/*! FLEXSPI1 - FLEXSPI1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_FLEXSPI1(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_FLEXSPI1_SHIFT)) & SYSCTL0_PERICFGENABLE0_FLEXSPI1_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_PHY_MASK    (0x100000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_PHY_SHIFT   (20U)
/*! USBHS_PHY - USBHS_PHY
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_PHY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_PHY_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_PHY_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_MASK (0x200000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_SHIFT (21U)
/*! USBHS_DEVICE - USBHS_DEVICE
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_DEVICE(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_DEVICE_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_HOST_MASK   (0x400000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_HOST_SHIFT  (22U)
/*! USBHS_HOST - USBHS_HOST
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_HOST(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_HOST_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_HOST_MASK)
#define SYSCTL0_PERICFGENABLE0_USBHS_SRAM_MASK   (0x800000U)
#define SYSCTL0_PERICFGENABLE0_USBHS_SRAM_SHIFT  (23U)
/*! USBHS_SRAM - USBHS_SRAM
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_USBHS_SRAM(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_USBHS_SRAM_SHIFT)) & SYSCTL0_PERICFGENABLE0_USBHS_SRAM_MASK)
#define SYSCTL0_PERICFGENABLE0_SCT_MASK          (0x1000000U)
#define SYSCTL0_PERICFGENABLE0_SCT_SHIFT         (24U)
/*! SCT - SCT
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_SCT(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_SCT_SHIFT)) & SYSCTL0_PERICFGENABLE0_SCT_MASK)
#define SYSCTL0_PERICFGENABLE0_GPU_MASK          (0x4000000U)
#define SYSCTL0_PERICFGENABLE0_GPU_SHIFT         (26U)
/*! GPU - GPU
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_GPU(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_GPU_SHIFT)) & SYSCTL0_PERICFGENABLE0_GPU_MASK)
#define SYSCTL0_PERICFGENABLE0_DISPLAY_CONTROLLER_MASK (0x8000000U)
#define SYSCTL0_PERICFGENABLE0_DISPLAY_CONTROLLER_SHIFT (27U)
/*! DISPLAY_CONTROLLER - DISPLAY CONTROLLER
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_DISPLAY_CONTROLLER(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_DISPLAY_CONTROLLER_SHIFT)) & SYSCTL0_PERICFGENABLE0_DISPLAY_CONTROLLER_MASK)
#define SYSCTL0_PERICFGENABLE0_MIPI_DSI_CONTROLLER_MASK (0x10000000U)
#define SYSCTL0_PERICFGENABLE0_MIPI_DSI_CONTROLLER_SHIFT (28U)
/*! MIPI_DSI_CONTROLLER - MIPI DSI CONTROLLER
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_MIPI_DSI_CONTROLLER(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_MIPI_DSI_CONTROLLER_SHIFT)) & SYSCTL0_PERICFGENABLE0_MIPI_DSI_CONTROLLER_MASK)
#define SYSCTL0_PERICFGENABLE0_SMARTDMA_MASK     (0x40000000U)
#define SYSCTL0_PERICFGENABLE0_SMARTDMA_SHIFT    (30U)
/*! SMARTDMA - SMARTDMA
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL0_PERICFGENABLE0_SMARTDMA(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL0_PERICFGENABLE0_SMARTDMA_SHIFT)) & SYSCTL0_PERICFGENABLE0_SMARTDMA_MASK)
/*! @} */

