espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name DSP_SRAM_ACCESS_DISABLE - DSP SRAM access disable */
/*! @{ */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM0_IF_MASK (0x1U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM0_IF_SHIFT (0U)
/*! SRAM0_IF - SRAM0_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM0_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM0_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM0_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM1_IF_MASK (0x2U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM1_IF_SHIFT (1U)
/*! SRAM1_IF - SRAM1_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM1_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM1_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM1_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM2_IF_MASK (0x4U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM2_IF_SHIFT (2U)
/*! SRAM2_IF - SRAM2_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM2_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM2_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM2_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM3_IF_MASK (0x8U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM3_IF_SHIFT (3U)
/*! SRAM3_IF - SRAM3_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM3_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM3_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM3_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM4_IF_MASK (0x10U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM4_IF_SHIFT (4U)
/*! SRAM4_IF - SRAM4_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM4_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM4_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM4_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM5_IF_MASK (0x20U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM5_IF_SHIFT (5U)
/*! SRAM5_IF - SRAM5_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM5_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM5_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM5_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM6_IF_MASK (0x40U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM6_IF_SHIFT (6U)
/*! SRAM6_IF - SRAM6_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM6_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM6_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM6_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM7_IF_MASK (0x80U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM7_IF_SHIFT (7U)
/*! SRAM7_IF - SRAM7_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM7_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM7_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM7_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM8_IF_MASK (0x100U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM8_IF_SHIFT (8U)
/*! SRAM8_IF - SRAM8_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM8_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM8_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM8_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM9_IF_MASK (0x200U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM9_IF_SHIFT (9U)
/*! SRAM9_IF - SRAM9_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM9_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM9_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM9_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM10_IF_MASK (0x400U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM10_IF_SHIFT (10U)
/*! SRAM10_IF - SRAM10_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM10_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM10_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM10_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM11_IF_MASK (0x800U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM11_IF_SHIFT (11U)
/*! SRAM11_IF - SRAM11_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM11_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM11_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM11_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM12_IF_MASK (0x1000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM12_IF_SHIFT (12U)
/*! SRAM12_IF - SRAM12_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM12_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM12_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM12_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM13_IF_MASK (0x2000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM13_IF_SHIFT (13U)
/*! SRAM13_IF - SRAM13_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM13_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM13_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM13_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM14_IF_MASK (0x4000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM14_IF_SHIFT (14U)
/*! SRAM14_IF - SRAM14_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM14_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM14_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM14_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM15_IF_MASK (0x8000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM15_IF_SHIFT (15U)
/*! SRAM15_IF - SRAM15_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM15_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM15_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM15_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM16_IF_MASK (0x10000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM16_IF_SHIFT (16U)
/*! SRAM16_IF - SRAM16_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM16_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM16_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM16_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM17_IF_MASK (0x20000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM17_IF_SHIFT (17U)
/*! SRAM17_IF - SRAM17_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM17_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM17_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM17_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM18_IF_MASK (0x40000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM18_IF_SHIFT (18U)
/*! SRAM18_IF - SRAM18_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM18_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM18_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM18_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM19_IF_MASK (0x80000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM19_IF_SHIFT (19U)
/*! SRAM19_IF - SRAM19_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM19_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM19_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM19_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM20_IF_MASK (0x100000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM20_IF_SHIFT (20U)
/*! SRAM20_IF - SRAM20_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM20_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM20_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM20_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM21_IF_MASK (0x200000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM21_IF_SHIFT (21U)
/*! SRAM21_IF - SRAM21_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM21_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM21_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM21_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM22_IF_MASK (0x400000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM22_IF_SHIFT (22U)
/*! SRAM22_IF - SRAM22_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM22_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM22_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM22_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM23_IF_MASK (0x800000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM23_IF_SHIFT (23U)
/*! SRAM23_IF - SRAM23_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM23_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM23_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM23_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM24_IF_MASK (0x1000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM24_IF_SHIFT (24U)
/*! SRAM24_IF - SRAM24_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM24_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM24_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM24_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM25_IF_MASK (0x2000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM25_IF_SHIFT (25U)
/*! SRAM25_IF - SRAM25_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM25_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM25_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM25_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM26_IF_MASK (0x4000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM26_IF_SHIFT (26U)
/*! SRAM26_IF - SRAM26_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM26_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM26_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM26_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM27_IF_MASK (0x8000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM27_IF_SHIFT (27U)
/*! SRAM27_IF - SRAM27_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM27_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM27_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM27_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM28_IF_MASK (0x10000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM28_IF_SHIFT (28U)
/*! SRAM28_IF - SRAM28_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM28_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM28_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM28_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM29_IF_MASK (0x20000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM29_IF_SHIFT (29U)
/*! SRAM29_IF - SRAM29_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM29_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM29_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM29_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM30_IF_MASK (0x40000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM30_IF_SHIFT (30U)
/*! SRAM30_IF - SRAM30_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM30_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM30_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM30_IF_MASK)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM31_IF_MASK (0x80000000U)
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM31_IF_SHIFT (31U)
/*! SRAM31_IF - SRAM31_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM31_IF(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM31_IF_SHIFT)) & SYSCTL0_DSP_SRAM_ACCESS_DISABLE_SRAM31_IF_MASK)
/*! @} */

/*! @name AUTO_SRAM_DISABLE - AUTO SRAM disable */
/*! @{ */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM0_IF_MASK  (0x1U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM0_IF_SHIFT (0U)
/*! SRAM0_IF - SRAM0_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM0_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM0_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM0_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM1_IF_MASK  (0x2U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM1_IF_SHIFT (1U)
/*! SRAM1_IF - SRAM1_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM1_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM1_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM1_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM2_IF_MASK  (0x4U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM2_IF_SHIFT (2U)
/*! SRAM2_IF - SRAM2_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM2_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM2_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM2_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM3_IF_MASK  (0x8U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM3_IF_SHIFT (3U)
/*! SRAM3_IF - SRAM3_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM3_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM3_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM3_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM4_IF_MASK  (0x10U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM4_IF_SHIFT (4U)
/*! SRAM4_IF - SRAM4_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM4_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM4_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM4_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM5_IF_MASK  (0x20U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM5_IF_SHIFT (5U)
/*! SRAM5_IF - SRAM5_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM5_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM5_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM5_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM6_IF_MASK  (0x40U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM6_IF_SHIFT (6U)
/*! SRAM6_IF - SRAM6_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM6_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM6_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM6_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM7_IF_MASK  (0x80U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM7_IF_SHIFT (7U)
/*! SRAM7_IF - SRAM7_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM7_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM7_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM7_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM8_IF_MASK  (0x100U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM8_IF_SHIFT (8U)
/*! SRAM8_IF - SRAM8_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM8_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM8_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM8_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM9_IF_MASK  (0x200U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM9_IF_SHIFT (9U)
/*! SRAM9_IF - SRAM9_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM9_IF(x)    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM9_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM9_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM10_IF_MASK (0x400U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM10_IF_SHIFT (10U)
/*! SRAM10_IF - SRAM10_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM10_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM10_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM10_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM11_IF_MASK (0x800U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM11_IF_SHIFT (11U)
/*! SRAM11_IF - SRAM11_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM11_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM11_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM11_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM12_IF_MASK (0x1000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM12_IF_SHIFT (12U)
/*! SRAM12_IF - SRAM12_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM12_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM12_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM12_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM13_IF_MASK (0x2000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM13_IF_SHIFT (13U)
/*! SRAM13_IF - SRAM13_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM13_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM13_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM13_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM14_IF_MASK (0x4000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM14_IF_SHIFT (14U)
/*! SRAM14_IF - SRAM14_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM14_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM14_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM14_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM15_IF_MASK (0x8000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM15_IF_SHIFT (15U)
/*! SRAM15_IF - SRAM15_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM15_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM15_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM15_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM16_IF_MASK (0x10000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM16_IF_SHIFT (16U)
/*! SRAM16_IF - SRAM16_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM16_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM16_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM16_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM17_IF_MASK (0x20000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM17_IF_SHIFT (17U)
/*! SRAM17_IF - SRAM17_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM17_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM17_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM17_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM18_IF_MASK (0x40000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM18_IF_SHIFT (18U)
/*! SRAM18_IF - SRAM18_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM18_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM18_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM18_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM19_IF_MASK (0x80000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM19_IF_SHIFT (19U)
/*! SRAM19_IF - SRAM19_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM19_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM19_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM19_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM20_IF_MASK (0x100000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM20_IF_SHIFT (20U)
/*! SRAM20_IF - SRAM20_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM20_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM20_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM20_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM21_IF_MASK (0x200000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM21_IF_SHIFT (21U)
/*! SRAM21_IF - SRAM21_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM21_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM21_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM21_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM22_IF_MASK (0x400000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM22_IF_SHIFT (22U)
/*! SRAM22_IF - SRAM22_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM22_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM22_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM22_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM23_IF_MASK (0x800000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM23_IF_SHIFT (23U)
/*! SRAM23_IF - SRAM23_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM23_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM23_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM23_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM24_IF_MASK (0x1000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM24_IF_SHIFT (24U)
/*! SRAM24_IF - SRAM24_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM24_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM24_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM24_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM25_IF_MASK (0x2000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM25_IF_SHIFT (25U)
/*! SRAM25_IF - SRAM25_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM25_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM25_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM25_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM26_IF_MASK (0x4000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM26_IF_SHIFT (26U)
/*! SRAM26_IF - SRAM26_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM26_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM26_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM26_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM27_IF_MASK (0x8000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM27_IF_SHIFT (27U)
/*! SRAM27_IF - SRAM27_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM27_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM27_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM27_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM28_IF_MASK (0x10000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM28_IF_SHIFT (28U)
/*! SRAM28_IF - SRAM28_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM28_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM28_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM28_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM29_IF_MASK (0x20000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM29_IF_SHIFT (29U)
/*! SRAM29_IF - SRAM29_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM29_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM29_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM29_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM30_IF_MASK (0x40000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM30_IF_SHIFT (30U)
/*! SRAM30_IF - SRAM30_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM30_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM30_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM30_IF_MASK)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM31_IF_MASK (0x80000000U)
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM31_IF_SHIFT (31U)
/*! SRAM31_IF - SRAM31_IF
 *  0b0..Enable
 *  0b1..Disable
 */
#define SYSCTL0_AUTO_SRAM_DISABLE_SRAM31_IF(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AUTO_SRAM_DISABLE_SRAM31_IF_SHIFT)) & SYSCTL0_AUTO_SRAM_DISABLE_SRAM31_IF_MASK)
/*! @} */

