espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name MIPI_DSI_TEST_IN1 - MIPI DSI Test IN1 */
/*! @{ */
#define SYSCTL0_MIPI_DSI_TEST_IN1_MIPI_DSI_TEST_IN1_MASK (0x3FU)
#define SYSCTL0_MIPI_DSI_TEST_IN1_MIPI_DSI_TEST_IN1_SHIFT (0U)
/*! MIPI_DSI_TEST_IN1 - MIPI-DSI Test input1 bus
 */
#define SYSCTL0_MIPI_DSI_TEST_IN1_MIPI_DSI_TEST_IN1(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_MIPI_DSI_TEST_IN1_MIPI_DSI_TEST_IN1_SHIFT)) & SYSCTL0_MIPI_DSI_TEST_IN1_MIPI_DSI_TEST_IN1_MASK)
/*! @} */

/*! @name MIPI_DSI_TEST_IN2 - MIPI DSI Test IN2 */
/*! @{ */
#define SYSCTL0_MIPI_DSI_TEST_IN2_MIPI_DSI_TEST_IN2_MASK (0xFFFFFFFFU)
#define SYSCTL0_MIPI_DSI_TEST_IN2_MIPI_DSI_TEST_IN2_SHIFT (0U)
/*! MIPI_DSI_TEST_IN2 - MIPI-DSI Test input2 bus
 */
#define SYSCTL0_MIPI_DSI_TEST_IN2_MIPI_DSI_TEST_IN2(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_MIPI_DSI_TEST_IN2_MIPI_DSI_TEST_IN2_SHIFT)) & SYSCTL0_MIPI_DSI_TEST_IN2_MIPI_DSI_TEST_IN2_MASK)
/*! @} */

/*! @name MIPI_DSI_TEST_OUT1 - MIPI DSI Test OUT1 */
/*! @{ */
#define SYSCTL0_MIPI_DSI_TEST_OUT1_MIPI_DSI_TEST_OUT1_MASK (0xFFFFFFFFU)
#define SYSCTL0_MIPI_DSI_TEST_OUT1_MIPI_DSI_TEST_OUT1_SHIFT (0U)
/*! MIPI_DSI_TEST_OUT1 - MIPI-DSI Test output 1 bus
 */
#define SYSCTL0_MIPI_DSI_TEST_OUT1_MIPI_DSI_TEST_OUT1(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_MIPI_DSI_TEST_OUT1_MIPI_DSI_TEST_OUT1_SHIFT)) & SYSCTL0_MIPI_DSI_TEST_OUT1_MIPI_DSI_TEST_OUT1_MASK)
/*! @} */

/*! @name MIPI_DSI_TEST_OUT2 - MIPI DSI Test OUT2 */
/*! @{ */
#define SYSCTL0_MIPI_DSI_TEST_OUT2_MIPI_DSI_TEST_OUT_2_MASK (0xFFFFFFFFU)
#define SYSCTL0_MIPI_DSI_TEST_OUT2_MIPI_DSI_TEST_OUT_2_SHIFT (0U)
/*! MIPI_DSI_TEST_OUT_2 - MIPI-DSI Test output 2 bus
 */
#define SYSCTL0_MIPI_DSI_TEST_OUT2_MIPI_DSI_TEST_OUT_2(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_MIPI_DSI_TEST_OUT2_MIPI_DSI_TEST_OUT_2_SHIFT)) & SYSCTL0_MIPI_DSI_TEST_OUT2_MIPI_DSI_TEST_OUT_2_MASK)
/*! @} */

/*! @name S0AES_UV - S0AES UV */
/*! @{ */
#define SYSCTL0_S0AES_UV_S0AES_UV_MASK           (0xFFFFFFFFU)
#define SYSCTL0_S0AES_UV_S0AES_UV_SHIFT          (0U)
/*! S0AES_UV - 32- Bit Unique Value
 */
#define SYSCTL0_S0AES_UV_S0AES_UV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S0AES_UV_S0AES_UV_SHIFT)) & SYSCTL0_S0AES_UV_S0AES_UV_MASK)
/*! @} */

/*! @name S0AES_UV_WLOCK - S0AES UV WLOCK */
/*! @{ */
#define SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_MASK (0x1U)
#define SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_SHIFT (0U)
/*! S0AES_UV_WLOCK - S0AES_UV Register Write Lock
 */
#define SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_SHIFT)) & SYSCTL0_S0AES_UV_WLOCK_S0AES_UV_WLOCK_MASK)
/*! @} */

/*! @name S1UDS_UV - S1UDS UV */
/*! @{ */
#define SYSCTL0_S1UDS_UV_S1UDS_UV_MASK           (0xFFFFFFFFU)
#define SYSCTL0_S1UDS_UV_S1UDS_UV_SHIFT          (0U)
/*! S1UDS_UV - 32- Bit Unique Value
 */
#define SYSCTL0_S1UDS_UV_S1UDS_UV(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S1UDS_UV_S1UDS_UV_SHIFT)) & SYSCTL0_S1UDS_UV_S1UDS_UV_MASK)
/*! @} */

/*! @name S1UDS_UV_WLOCK - S1UDS UV WLOCK */
/*! @{ */
#define SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_MASK (0x1U)
#define SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_SHIFT (0U)
/*! S1UDS_UV_WLOCK - S1UDS_UV Register Write Lock
 */
#define SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_SHIFT)) & SYSCTL0_S1UDS_UV_WLOCK_S1UDS_UV_WLOCK_MASK)
/*! @} */

/*! @name UDS_SEED - UDS SEED */
/*! @{ */
#define SYSCTL0_UDS_SEED_UDS_SEED_MASK           (0xFFFFFFFFU)
#define SYSCTL0_UDS_SEED_UDS_SEED_SHIFT          (0U)
/*! UDS_SEED - 32-Bit UDS Seed Value
 */
#define SYSCTL0_UDS_SEED_UDS_SEED(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL0_UDS_SEED_UDS_SEED_SHIFT)) & SYSCTL0_UDS_SEED_UDS_SEED_MASK)
/*! @} */

/*! @name UDS_SEED_RLOCK - UDS SEED RLOCK */
/*! @{ */
#define SYSCTL0_UDS_SEED_RLOCK_UDS_SEED_RLOCK_MASK (0x1U)
#define SYSCTL0_UDS_SEED_RLOCK_UDS_SEED_RLOCK_SHIFT (0U)
/*! UDS_SEED_RLOCK - UDS_SEED Register Read Lock
 */
#define SYSCTL0_UDS_SEED_RLOCK_UDS_SEED_RLOCK(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_UDS_SEED_RLOCK_UDS_SEED_RLOCK_SHIFT)) & SYSCTL0_UDS_SEED_RLOCK_UDS_SEED_RLOCK_MASK)
/*! @} */

/*! @name UUID - UUID */
/*! @{ */
#define SYSCTL0_UUID_UUIDN_MASK                  (0xFFFFFFFFU)
#define SYSCTL0_UUID_UUIDN_SHIFT                 (0U)
/*! UUIDN - UUIDn 32-Bit Data Register
 */
#define SYSCTL0_UUID_UUIDN(x)                    (((uint32_t)(((uint32_t)(x)) << SYSCTL0_UUID_UUIDN_SHIFT)) & SYSCTL0_UUID_UUIDN_MASK)
/*! @} */

/* The count of SYSCTL0_UUID */
#define SYSCTL0_UUID_COUNT                       (4U)

/*! @name UUID_WLOCK - UUID WLOCK */
/*! @{ */
#define SYSCTL0_UUID_WLOCK_UUID_WLOCK_MASK       (0x1U)
#define SYSCTL0_UUID_WLOCK_UUID_WLOCK_SHIFT      (0U)
/*! UUID_WLOCK - UUID0/1/2/3 Register Write Lock
 */
#define SYSCTL0_UUID_WLOCK_UUID_WLOCK(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL0_UUID_WLOCK_UUID_WLOCK_SHIFT)) & SYSCTL0_UUID_WLOCK_UUID_WLOCK_MASK)
/*! @} */

/*! @name AESKEY_SRCSEL - AES Key Source Select */
/*! @{ */
#define SYSCTL0_AESKEY_SRCSEL_AESKEY_SRCSEL_MASK (0x3U)
#define SYSCTL0_AESKEY_SRCSEL_AESKEY_SRCSEL_SHIFT (0U)
/*! AESKEY_SRCSEL - AES Key Source Select
 *  0b00..PUF
 *  0b01..PUF
 *  0b10..OTP
 *  0b11..PUF
 */
#define SYSCTL0_AESKEY_SRCSEL_AESKEY_SRCSEL(x)   (((uint32_t)(((uint32_t)(x)) << SYSCTL0_AESKEY_SRCSEL_AESKEY_SRCSEL_SHIFT)) & SYSCTL0_AESKEY_SRCSEL_AESKEY_SRCSEL_MASK)
/*! @} */

/*! @name OTFADKEY_SRCSEL - OTFAD Key Source Select */
/*! @{ */
#define SYSCTL0_OTFADKEY_SRCSEL_OTFADKEY_SRCSEL_MASK (0x3U)
#define SYSCTL0_OTFADKEY_SRCSEL_OTFADKEY_SRCSEL_SHIFT (0U)
/*! OTFADKEY_SRCSEL - OTFAD Key Source Select
 *  0b00..PUF
 *  0b01..PUF
 *  0b10..OTP
 *  0b11..PUF
 */
#define SYSCTL0_OTFADKEY_SRCSEL_OTFADKEY_SRCSEL(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL0_OTFADKEY_SRCSEL_OTFADKEY_SRCSEL_SHIFT)) & SYSCTL0_OTFADKEY_SRCSEL_OTFADKEY_SRCSEL_MASK)
/*! @} */

