espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/MIMXRT595S_dsp.h
/*! @name CONFIG_LCKOUT - Configuration Lock-Out */
/*! @{ */
#define SYSCTL1_CONFIG_LCKOUT_LCKOUT_MASK        (0x1U)
#define SYSCTL1_CONFIG_LCKOUT_LCKOUT_SHIFT       (0U)
/*! LCKOUT - Configuration Lock-Out
 *  0b0..Enable Write to Configuration Registers
 *  0b1..Disable Write to Configuration Registers
 */
#define SYSCTL1_CONFIG_LCKOUT_LCKOUT(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL1_CONFIG_LCKOUT_LCKOUT_SHIFT)) & SYSCTL1_CONFIG_LCKOUT_LCKOUT_MASK)
/*! @} */

/*! @name PERICFGENABLE0 - Peripheral Configuration Enable 0 */
/*! @{ */
#define SYSCTL1_PERICFGENABLE0_Flexcomm0_MASK    (0x100U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm0_SHIFT   (8U)
/*! Flexcomm0 - Flexcomm0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm0(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm0_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm0_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm1_MASK    (0x200U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm1_SHIFT   (9U)
/*! Flexcomm1 - Flexcomm1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm1(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm1_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm1_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm2_MASK    (0x400U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm2_SHIFT   (10U)
/*! Flexcomm2 - Flexcomm2
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm2(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm2_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm2_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm3_MASK    (0x800U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm3_SHIFT   (11U)
/*! Flexcomm3 - Flexcomm3
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm3(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm3_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm3_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm4_MASK    (0x1000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm4_SHIFT   (12U)
/*! Flexcomm4 - Flexcomm4
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm4(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm4_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm4_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm5_MASK    (0x2000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm5_SHIFT   (13U)
/*! Flexcomm5 - Flexcomm5
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm5(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm5_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm5_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm6_MASK    (0x4000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm6_SHIFT   (14U)
/*! Flexcomm6 - Flexcomm6
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm6(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm6_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm6_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm7_MASK    (0x8000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm7_SHIFT   (15U)
/*! Flexcomm7 - Flexcomm7
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm7(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm7_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm7_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm8_MASK    (0x10000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm8_SHIFT   (16U)
/*! Flexcomm8 - Flexcomm8
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm8(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm8_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm8_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm9_MASK    (0x20000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm9_SHIFT   (17U)
/*! Flexcomm9 - Flexcomm9
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm9(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm9_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm9_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm10_MASK   (0x40000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm10_SHIFT  (18U)
/*! Flexcomm10 - Flexcomm10
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm10(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm10_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm10_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm11_MASK   (0x80000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm11_SHIFT  (19U)
/*! Flexcomm11 - Flexcomm11
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm11(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm11_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm11_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm12_MASK   (0x100000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm12_SHIFT  (20U)
/*! Flexcomm12 - Flexcomm12
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm12(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm12_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm12_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm13_MASK   (0x200000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm13_SHIFT  (21U)
/*! Flexcomm13 - Flexcomm13
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm13(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm13_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm13_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm14_SPI0_MASK (0x400000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm14_SPI0_SHIFT (22U)
/*! Flexcomm14_SPI0 - Flexcomm14 SPI0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm14_SPI0(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm14_SPI0_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm14_SPI0_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm15_I2C_MASK (0x800000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm15_I2C_SHIFT (23U)
/*! Flexcomm15_I2C - Flexcomm15 I2C
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm15_I2C(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm15_I2C_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm15_I2C_MASK)
#define SYSCTL1_PERICFGENABLE0_DMIC0_MASK        (0x1000000U)
#define SYSCTL1_PERICFGENABLE0_DMIC0_SHIFT       (24U)
/*! DMIC0 - DMIC0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_DMIC0(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_DMIC0_SHIFT)) & SYSCTL1_PERICFGENABLE0_DMIC0_MASK)
#define SYSCTL1_PERICFGENABLE0_Flexcomm16_SPI1_MASK (0x2000000U)
#define SYSCTL1_PERICFGENABLE0_Flexcomm16_SPI1_SHIFT (25U)
/*! Flexcomm16_SPI1 - Flexcomm16 SPI1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_Flexcomm16_SPI1(x) (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_Flexcomm16_SPI1_SHIFT)) & SYSCTL1_PERICFGENABLE0_Flexcomm16_SPI1_MASK)
#define SYSCTL1_PERICFGENABLE0_FlexIO_MASK       (0x20000000U)
#define SYSCTL1_PERICFGENABLE0_FlexIO_SHIFT      (29U)
/*! FlexIO - FlexIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE0_FlexIO(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE0_FlexIO_SHIFT)) & SYSCTL1_PERICFGENABLE0_FlexIO_MASK)
/*! @} */

/*! @name PERICFGENABLE1 - Peripheral Configuration Enable 1 */
/*! @{ */
#define SYSCTL1_PERICFGENABLE1_HSGPIO0_MASK      (0x1U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO0_SHIFT     (0U)
/*! HSGPIO0 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO0(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO0_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO0_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO1_MASK      (0x2U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO1_SHIFT     (1U)
/*! HSGPIO1 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO1(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO1_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO1_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO2_MASK      (0x4U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO2_SHIFT     (2U)
/*! HSGPIO2 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO2(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO2_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO2_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO3_MASK      (0x8U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO3_SHIFT     (3U)
/*! HSGPIO3 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO3(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO3_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO3_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO4_MASK      (0x10U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO4_SHIFT     (4U)
/*! HSGPIO4 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO4(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO4_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO4_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO5_MASK      (0x20U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO5_SHIFT     (5U)
/*! HSGPIO5 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO5(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO5_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO5_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO6_MASK      (0x40U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO6_SHIFT     (6U)
/*! HSGPIO6 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO6(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO6_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO6_MASK)
#define SYSCTL1_PERICFGENABLE1_HSGPIO7_MASK      (0x80U)
#define SYSCTL1_PERICFGENABLE1_HSGPIO7_SHIFT     (7U)
/*! HSGPIO7 - High Speed GPIO
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_HSGPIO7(x)        (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_HSGPIO7_SHIFT)) & SYSCTL1_PERICFGENABLE1_HSGPIO7_MASK)
#define SYSCTL1_PERICFGENABLE1_CRC_MASK          (0x10000U)
#define SYSCTL1_PERICFGENABLE1_CRC_SHIFT         (16U)
/*! CRC - CRC
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_CRC(x)            (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_CRC_SHIFT)) & SYSCTL1_PERICFGENABLE1_CRC_MASK)
#define SYSCTL1_PERICFGENABLE1_DMAC0_MASK        (0x800000U)
#define SYSCTL1_PERICFGENABLE1_DMAC0_SHIFT       (23U)
/*! DMAC0 - DMAC0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_DMAC0(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_DMAC0_SHIFT)) & SYSCTL1_PERICFGENABLE1_DMAC0_MASK)
#define SYSCTL1_PERICFGENABLE1_DMAC1_MASK        (0x1000000U)
#define SYSCTL1_PERICFGENABLE1_DMAC1_SHIFT       (24U)
/*! DMAC1 - DMAC1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_DMAC1(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_DMAC1_SHIFT)) & SYSCTL1_PERICFGENABLE1_DMAC1_MASK)
#define SYSCTL1_PERICFGENABLE1_MU_MASK           (0x10000000U)
#define SYSCTL1_PERICFGENABLE1_MU_SHIFT          (28U)
/*! MU - MU
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_MU(x)             (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_MU_SHIFT)) & SYSCTL1_PERICFGENABLE1_MU_MASK)
#define SYSCTL1_PERICFGENABLE1_SEMA_MASK         (0x20000000U)
#define SYSCTL1_PERICFGENABLE1_SEMA_SHIFT        (29U)
/*! SEMA - SEMA
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_SEMA(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_SEMA_SHIFT)) & SYSCTL1_PERICFGENABLE1_SEMA_MASK)
#define SYSCTL1_PERICFGENABLE1_FREQME_MASK       (0x80000000U)
#define SYSCTL1_PERICFGENABLE1_FREQME_SHIFT      (31U)
/*! FREQME - FREQME
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE1_FREQME(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE1_FREQME_SHIFT)) & SYSCTL1_PERICFGENABLE1_FREQME_MASK)
/*! @} */

/*! @name PERICFGENABLE2 - Peripheral Configuration Enable 2 */
/*! @{ */
#define SYSCTL1_PERICFGENABLE2_CT32BIT0_MASK     (0x1U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT0_SHIFT    (0U)
/*! CT32BIT0 - CT32BIT0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT0(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT0_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT0_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT1_MASK     (0x2U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT1_SHIFT    (1U)
/*! CT32BIT1 - CT32BIT1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT1(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT1_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT1_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT2_MASK     (0x4U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT2_SHIFT    (2U)
/*! CT32BIT2 - CT32BIT2
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT2(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT2_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT2_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT3_MASK     (0x8U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT3_SHIFT    (3U)
/*! CT32BIT3 - CT32BIT3
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT3(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT3_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT3_MASK)
#define SYSCTL1_PERICFGENABLE2_CT32BIT4_MASK     (0x10U)
#define SYSCTL1_PERICFGENABLE2_CT32BIT4_SHIFT    (4U)
/*! CT32BIT4 - CT32BIT4
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_CT32BIT4(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_CT32BIT4_SHIFT)) & SYSCTL1_PERICFGENABLE2_CT32BIT4_MASK)
#define SYSCTL1_PERICFGENABLE2_RTC_LITE_MASK     (0x80U)
#define SYSCTL1_PERICFGENABLE2_RTC_LITE_SHIFT    (7U)
/*! RTC_LITE - RTC Lite
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_RTC_LITE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_RTC_LITE_SHIFT)) & SYSCTL1_PERICFGENABLE2_RTC_LITE_MASK)
#define SYSCTL1_PERICFGENABLE2_MRT0_MASK         (0x100U)
#define SYSCTL1_PERICFGENABLE2_MRT0_SHIFT        (8U)
/*! MRT0 - MRT0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_MRT0(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_MRT0_SHIFT)) & SYSCTL1_PERICFGENABLE2_MRT0_MASK)
#define SYSCTL1_PERICFGENABLE2_WWDT1_MASK        (0x400U)
#define SYSCTL1_PERICFGENABLE2_WWDT1_SHIFT       (10U)
/*! WWDT1 - WWDT1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_WWDT1(x)          (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_WWDT1_SHIFT)) & SYSCTL1_PERICFGENABLE2_WWDT1_MASK)
#define SYSCTL1_PERICFGENABLE2_I3C0_MASK         (0x10000U)
#define SYSCTL1_PERICFGENABLE2_I3C0_SHIFT        (16U)
/*! I3C0 - I3C0
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_I3C0(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_I3C0_SHIFT)) & SYSCTL1_PERICFGENABLE2_I3C0_MASK)
#define SYSCTL1_PERICFGENABLE2_I3C1_MASK         (0x20000U)
#define SYSCTL1_PERICFGENABLE2_I3C1_SHIFT        (17U)
/*! I3C1 - I3C1
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_I3C1(x)           (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_I3C1_SHIFT)) & SYSCTL1_PERICFGENABLE2_I3C1_MASK)
#define SYSCTL1_PERICFGENABLE2_GPIO0GINT_MASK    (0x10000000U)
#define SYSCTL1_PERICFGENABLE2_GPIO0GINT_SHIFT   (28U)
/*! GPIO0GINT - GPIO0GINT
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_GPIO0GINT(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_GPIO0GINT_SHIFT)) & SYSCTL1_PERICFGENABLE2_GPIO0GINT_MASK)
#define SYSCTL1_PERICFGENABLE2_GPIO1GINT_MASK    (0x20000000U)
#define SYSCTL1_PERICFGENABLE2_GPIO1GINT_SHIFT   (29U)
/*! GPIO1GINT - GPIO1GINT
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_GPIO1GINT(x)      (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_GPIO1GINT_SHIFT)) & SYSCTL1_PERICFGENABLE2_GPIO1GINT_MASK)
#define SYSCTL1_PERICFGENABLE2_GPIOINTCTL_MASK   (0x40000000U)
#define SYSCTL1_PERICFGENABLE2_GPIOINTCTL_SHIFT  (30U)
/*! GPIOINTCTL - GPIOINTCTL
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_GPIOINTCTL(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_GPIOINTCTL_SHIFT)) & SYSCTL1_PERICFGENABLE2_GPIOINTCTL_MASK)
#define SYSCTL1_PERICFGENABLE2_PIMCTL_MASK       (0x80000000U)
#define SYSCTL1_PERICFGENABLE2_PIMCTL_SHIFT      (31U)
/*! PIMCTL - IOPCTL
 *  0b0..Disable
 *  0b1..Enable
 */
#define SYSCTL1_PERICFGENABLE2_PIMCTL(x)         (((uint32_t)(((uint32_t)(x)) << SYSCTL1_PERICFGENABLE2_PIMCTL_SHIFT)) & SYSCTL1_PERICFGENABLE2_PIMCTL_MASK)
/*! @} */

/*! @name RXEVPULSEGEN - RX Event Pulse Generator */
/*! @{ */
#define SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_MASK   (0x1U)
#define SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT  (0U)
/*! RXEVPULSEGEN - RX Event Pulse Generator
 *  0b0..No effect
 *  0b1..Pulse RXEV High for one PSCLK cycle
 */
#define SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_SHIFT)) & SYSCTL1_RXEVPULSEGEN_RXEVPULSEGEN_MASK)
/*! @} */

/*! @name SCRATCH - Scratch */
/*! @{ */
#define SYSCTL1_SCRATCH_Scratch_MASK             (0xFFFFFFFFU)
#define SYSCTL1_SCRATCH_Scratch_SHIFT            (0U)
/*! Scratch - Scratch
 */
#define SYSCTL1_SCRATCH_Scratch(x)               (((uint32_t)(((uint32_t)(x)) << SYSCTL1_SCRATCH_Scratch_SHIFT)) & SYSCTL1_SCRATCH_Scratch_MASK)
/*! @} */

/* The count of SYSCTL1_SCRATCH */
#define SYSCTL1_SCRATCH_COUNT                    (2U)


/*!
 * @}
 */ /* end of group SYSCTL1_Register_Masks */


